[["Many films have sought to capture the impact of America’s prison industrial complex. But “Time” is one of a kind, writes @jakecoyleAP.", "53", ["43", "Comments"]], ["Mike Pence and Kamala Harris square off Wednesday night - two candidates with conflicting visions for America who could be asked to step into the Oval Office before the end of the next term. Rarely has a vice presidential debate mattered this much.", "481", ["436", "Comments"]], ["Eddie Van Halen's distinctive guitar solos fueled the rise of the band Van Halen, one of the top 20 best-selling artists of all time. The band's hits include “Jump,” “Panama” and “Hot for Teacher.” Van Halen also played on one of the biggest singles of the 1980s: Michael Jackson’s “Beat It.” Van Halen has died of cancer at age 65.", "1.3K", ["101", "Comments"]], ["Once firmly in Republican control, suburbs are increasingly politically divided. As such, they are poised to decide not just who wins the White House this year but also who controls the Senate.", "865", ["366", "Comments"]], ["From the moment the coronavirus reached America’s shores, the country was unprepared. Hospitals didn’t have the masks and gowns to protect their workers. AP launched a seven-month investigation with FRONTLINE | PBS and the Global Reporting Centre to understand what was behind these critical shortages.", "1.3K", ["603", "Comments"]], ["Federal prosecutors can have a profound effect on the criminal justice system and leadership holds an immense sway. Without a diverse group considering cases, bias can seep in unnoticed. An AP analysis found 85% of President Trump's Senate-confirmed U.S. attorneys are white men.", "2.1K", ["1.5K", "Comments"]], ["Bad news for moviegoers: A big chain is closing hundreds of theaters, at least temporarily. http://apne.ws/OMtuDmq", "258", ["103", "Comments"]], ["The CDC, in new guidance, says the coronavirus can spread more than 6 feet through the air. But the health agency maintains that such spread is uncommon and current social distancing guidelines still make sense. http://apne.ws/99n0eD0", "5.8K", ["394", "Comments"]], ["“Thank you for fighting so hard, Larry.” Larry Brown fell ill will the coronavirus in March, and he spent about 50 days on a ventilator and nearly 80 days in the hospital. Despite some progress, he still fights the effects of his illness to this day. http://apne.ws/qGTgo8V", "141", ["47", "Comments"]], ["COMING TUESDAY: Why did the U.S. run out of masks, gloves and sanitizer as COVID-19 swept the country? AP reporters Juliet Linderman and Martha Mendoza spent seven months investigating the collapse of medical supply chains with FRONTLINE | PBS and Global Reporting Centre.", "188", ["136", "Comments"]], ["“Getting medical help shouldn’t be discouraging for anyone. It is a discouraging place for Black people.” Christy DeGallerie's experience not being taken seriously when she had COVID-19 is something more cities and states are trying to avoid by declaring racism a public health crisis.", "280", ["147", "Comments"]], ["A new UChicago Harris/AP-NORC poll finds ore Americans blame the U.S. government than foreign governments for the current coronavirus crisis in United States. Overall, 56% of Americans say the U.S. government has a great deal or quite a bit of responsibility for the U.S. situation, including 79% of Democrats but just 38% of Republicans.", "1.5K", ["552", "Comments"]], ["Students in the Philippines have started classes at home after the coronavirus pandemic forced remote-learning onto an already struggling educational system. http://apne.ws/k8zDpev", "98", ["12", "Comments"]], ["The fires of 2020 have killed 31 people in California and burned a record 4 million acres, well over double the previous high mark of 1.67 million acres set two years ago.", "3.4K", ["470", "Comments"]], ["Parents are complaining about racist and sexist content on an online learning program used by schools nationwide. With the scramble to keep classes running during the pandemic, the curriculum may not have been vetted the way it should, experts say. http://apne.ws/KHWTLOJ", "1.2K", ["142", "Comments"]], ["In Pennsylvania and Michigan, local election clerks are not allowed to start verifying mail-in ballots until Election Day or just before, unlike in many states when that process can start weeks before. This is raising concerns that the vote counting there will be delayed for days or even weeks, potentially sowing doubts about the outcome.", "751", ["199", "Comments"]], ["Larry Brown's doctors feared he wouldn't make it. Fluid was filling his lungs. But after about 50 days on a ventilator, Brown woke up, to a foreign world and a long list of unknowns. He didn't die of COVID-19, but months later, life isn't the same for the 46-year-old Indiana man. It may never be. Exactly how many patients like Brown exist is unknown, but thousands have taken to social media to find informal advice and support.", "1.2K", ["265", "Comments"]], ["The NBC late-night sketch series jumped into the reenactment of the recent debate between the Republican President Trump and Democratic challenger Joe Biden. Alec Baldwin returned to play Trump before the president’s COVID diagnosis, while Jim Carrey made his feature debut as Biden.", "2.2K", ["1.3K", "Comments"]], ["“We’re still not on a clear path yet to a full recovery.\"", "6.9K", ["670", "Comments"]], ["President Trump’s doctor on Saturday painted a rosy picture of the president’s health as he remains hospitalized for coronavirus treatment. But that assessment was immediately contradicted by a person familiar with Trump’s condition, who said the situation had been very concerning. A source told AP that Trump was administered supplemental oxygen at the White House on Friday before going to hospital.", "5.9K", ["1.2K", "Comments"]], ["New England Patriots quarterback Cam Newton reportedly has COVID-19. The Chiefs-Patriots game, originally scheduled for Sunday afternoon, has been postponed.", "235", ["55", "Comments"]], ["CDC health experts said sealing off the border to immigrants and asylum seekers wouldn't slow coronavirus. Vice President Pence ordered them to do it, anyway. @AP has exclusive details on how political pressure caused an unprecedented border shutdown.", "3.2K", ["1K", "Comments"]], ["\"If I don’t do this, then who will?” In India’s northeastern Assam state, one man has been braving the risk of contamination and social stigma to conduct the funeral rites of COVID-19 victims.", "494", ["37", "Comments"]], ["Hall of Famer Bob Gibson, St. Louis Cardinals pitcher who won a record seven consecutive World Series starts and finished the 1968 season with a 1.12 ERA, has died at age 84. “The only thing you know about pitching is you can’t hit it,” Gibson used to say.", "383", ["25", "Comments"]], ["Highlights of some of the most compelling images made or published in the past week by The Associated Press from around the world.", "154", ["5", "Comments"]], ["In a video taped before leaving for Walter Reed, Trump said, “I think I’m doing very well, but we’re going to make sure that things work out.”", "862", ["636", "Comments"]], ["President Trump has some strikes against him — age, obesity, elevated cholesterol and being male — that could put him at greater risk of becoming seriously ill from coronavirus. But experts say the virus causes mild or no symptoms in about 80% of cases.", "1K", ["875", "Comments"]], ["In a Black community on Chicago's South Side, the triple tragedy of coronavirus, gun violence and economic misery has compounded anger and despair. Yet residents find hope looking beyond the trauma. See the story of Auburn Greshmam told by AP journalists.", "101", ["34", "Comments"]], ["President Donald Trump announces he and Melania Trump have tested positive for the coronavirus after exposure to top aide, Hope Hicks.", "2.7K", ["1K", "Comments"]], ["Millions of distressed Indian manufacturers and traders are counting on the eagerly-awaited October-December festive season to rescue them from their coronavirus catastrophe. This year will likely lack the customary pomp and show, given the need for masks and social distancing with the pandemic still raging and no vaccine yet available.", "56", ["3", "Comments"]], ["Hope Hicks, one of President Donald Trump's closest aides, has tested positive for the coronavirus. She traveled with Trump multiple times this week.", "4.2K", ["592", "Comments"]], ["Through threatening letters, lawsuits, viral videos and presidential misinformation, President Trump's campaign and its GOP allies are going to new lengths to contest election procedures county-by-county across battleground states.", "1.7K", ["690", "Comments"]], ["Meet the women of the ImillaSkate collective, a group of skateboarders in Bolivia combining sports with the South American country's tradition. READ MORE: http://apne.ws/6OR4cAM", "552", ["46", "Comments"]], ["“Every single school will have testing. It will be done every single month. It will be rigorous,” New York City Mayor Bill de Blasio said. NYC and Los Angeles are rolling out ambitious plans to test students and staff for the coronavirus.", "314", ["240", "Comments"]], ["In Minneapolis, Seattle and Portland, Oregon, all hotspots for protests after the death of George Floyd, the calls for “defunding the police” have been answered with relatively modest budget cuts, at least for now. It’s the same across the U.S., where most cities are not contemplating wholesale reforms to their police departments.", "763", ["405", "Comments"]], ["With the nation roiled by the pandemic and protests over racial justice, The Associated Press decided to take a road trip across America. First stop: The Appalachian foothills of SE Ohio, where we found anger, conspiracies and echoes of an LBJ speech.", "306", ["113", "Comments"]], ["Road trip! It's just what families working or going to school from home during the pandemic need to break out of the routine.", "171", ["12", "Comments"]], ["President Trump is expected to miss a deadline to decide how many refugees are allowed into the U.S. next year. Sidestepping the requirement in a 40-year-old law leaves the future of the country's refugee resettlement program in doubt. http://apne.ws/elc2aRL", "1.3K", ["537", "Comments"]], ["Nearly a quarter of Brazil's Pantanal wetlands — an area more than the size of Maryland — has been consumed by fire. Along that scorched landscape @AP journalists saw injured and disoriented animals, plus charred corpses.", "446", ["93", "Comments"]], ["How does early voting work in the U.S. election? All states allow some form of early voting, be it by casting votes in person at polling places, voting by mail, or both. But each state has its own rules and timelines on when this occurs.", "62", ["57", "Comments"]], ["Country star Mac Davis, who launched his career crafting the Elvis hits “A Little Less Conversation” and “In the Ghetto,” and whose own hits include “Baby Don't Get Hooked On Me,” has died. He was 78.", "328", ["20", "Comments"]], ["Parents with kids on full-time distance learning are breaking out of the house on extended family vacations around the world. From RV travel to five-star resorts, some call it a \"risk versus reward\" proposition. Many are avoiding long plane rides. Education experts say so-called \"schoolcations\" can work, so long as kids are actually logging on for class.", "459", ["86", "Comments"]], ["Helen Reddy, the Australian-born singer who scored an enduring hit with her feminist anthem “I Am Woman,” has died at age 78. http://apne.ws/KpNY9fA", "537", ["16", "Comments"]], ["Timothy Ray Brown, who made history as “the Berlin patient,” the first person known to be cured of HIV infection, has died of cancer. He was 54.", "1.4K", ["170", "Comments"]], ["President Trump continued his assault on the integrity of the U.S. elections during the debate, spreading falsehoods about the security of voting and misrepresenting issues with mail ballots. Here's a look at Trump's claims and the facts.  Get the facts about voting early, by mail or absentee in this interactive state-by-state guide: http://apne.ws/ETW4eaV", "1.5K", ["1.3K", "Comments"]], ["The chaotic first debate between President Trump and Joe Biden erupted in contentious exchanges over the coronavirus pandemic, job losses and how the Supreme Court will shape the future of the nation’s health care. The two candidates frequently talked over each other with Trump interrupting, nearly shouting, so often that Biden eventually snapped at him, “Will you shut up, man?”", "3K", ["1.4K", "Comments"]], ["After preying heavily on the elderly in the spring, the coronavirus is infecting a rising number of American children and teens. Authorities say the trend appears driven by school reopenings and the resumption of sports, playdates and other activities.", "554", ["370", "Comments"]], ["The Tennessee Titans are pausing team activities through Friday because of eight positive results for the coronavirus. It's the first COVID-19 outbreak of the NFL season and a significant test of the league’s virus protocols. http://apne.ws/0uBayHM", "108", ["23", "Comments"]], ["Presidential debates are typically some of the most exciting nights of the campaign season, drawing thousands of staffers, media and guests. This year, crowds and pageantry are out. COVID-19 tests and masks are in.", "142", ["76", "Comments"]], ["While debates have not significantly shaken up the election in recent years, Tuesday’s highly anticipated matchup will offer the clearest contrast yet between President Trump and Joe Biden. Here's what to watch for.", "166", ["225", "Comments"]], ["President Donald Trump’s reelection depends largely on energizing his seemingly immovable base of support. But there are defectors. The AP spoke to two dozen in three swing states.", "1K", ["896", "Comments"]], ["The close ties of Judge Amy Coney Barrett, President Trump's Supreme Court nominee, with the conservative religious group People of Praise are drawing scrutiny. The group views men as divinely ordained as the \"head” of the family. @MBieseck @MRSmithAP", "2.7K", ["1.4K", "Comments"]], ["The worldwide death toll from the coronavirus has eclipsed 1 million nine months into a crisis that has devastated the global economy, pitted science against politics and forced multitudes to change the way they live, learn and work. “It’s not just a number. It’s human beings. It’s people we love,” said Dr. Howard Markel, a medical history professor at the University of Michigan who has advised government officials on containing pandemics and lost his 84-year-old mother to COVID-19. http://apne.ws/Sd1QWnY", "3.9K", ["609", "Comments"]], ["The Trump administration wants to ban TikTok from U.S. app stores. But will its order stand?", "109", ["49", "Comments"]], ["“This is the first time I will practice democracy,” said Bilal Alobaidi, an Iraqi refugee who resettled in Phoenix and was naturalized last year. “I can’t wait.”", "1.9K", ["309", "Comments"]], ["President Trump found multiple ways to reduce his tax bills, according to the Times report. He has taken tax deductions on personal expenses such as housing, aircraft and $70,000 in haircare.", "5.9K", ["3.8K", "Comments"]], ["“We have elders that might not be able to move around much, those that might be afraid of the pandemic, people who are disabled and people that don’t have transportation.” President Trump claims allowing voters to designate others to return ballots on their behalf will lead to rampant fraud. But Native Americans say the impact of limiting ballot assistance in Indian Country is often absent from the debate.", "1.7K", ["305", "Comments"]], ["President Trump has nominated Amy Coney Barrett, hailed by religious conservatives as an ideological heir to Antonin Scalia, to fill liberal Justice Ruth Bader Ginsburg’s Supreme Court seat.", "3.1K", ["1.3K", "Comments"]], ["Amy Coney Barrett is the expected replacement for Justice Ruth Bader Ginsburg. But Barrett is more aptly described as heir to another departed Supreme Court justice: conservative hero Antonin Scalia, for whom she once clerked.", "2.7K", ["1.1K", "Comments"]], ["AP investigation finds stateless Rohingya Muslims escape violence in their homeland only to be forced to work on palm oil plantations in Malaysia. “People here say, ‘This is not your country, we will do whatever we want,’” one victim said.", "208", ["22", "Comments"]], ["“I will not make age an issue of this campaign. I am not going to exploit, for political purposes, my opponent’s youth and inexperience,” said President Ronald Reagan in a 1984 debate. AP looks at some of the most memorable moments in debate history.", "153", ["112", "Comments"]], ["Black voters, the least likely racial group to use mail-in balloting in the past, seem to be warming up to the idea. The evidence is clearest in North Carolina, the first state in the nation to send out mail-in ballots.", "1.5K", ["632", "Comments"]], ["Poll workers and voting machines typically catch voters’ ballot-marking mistakes. That help won’t be available for millions of Americans who vote from home this fall, leading experts to worry that poorly marked ballot ovals or boxes could become the ‘hanging chads’ of 2020.", "830", ["433", "Comments"]], ["“That broke me.” The grand jury decision in the Breonna Taylor case has been a painful gut punch to protesters. Many of them were tear gassed by police, arrested, threatened online, shot with pepper bullets. Some also lost jobs, friends and homes.", "1K", ["955", "Comments"]], ["PHOTO GALLERY: Highlights of some of the most compelling images made or published in the past week by The Associated Press from around the world.", "605", ["390", "Comments"]], ["A federal prosecutor's description of nine “discarded” military ballots found in the trash at a northeastern Pennsylvania elections office has been seized on by President Trump and his supporters, though little has been revealed about what happened.", "1K", ["655", "Comments"]], ["“The federal government needs to enforce this law and investigate all instances of forced labor in supply chains and block imports made with forced labor from coming into the U.S.\" -Sen. Sherrod Brown.", "996", ["143", "Comments"]], ["The latest hotspots for the coronavirus in the U.S. are in the Midwest and West. The pandemic is now striking cities with smaller populations, often in conservative corners of America where anti-mask sentiment runs high.", "1.9K", ["1K", "Comments"]], ["Two former leaders of a Massachusetts home for aging veterans where nearly 80 people sickened by the coronavirus died have been criminally charged for their handling of the outbreak. \"We believe this is the first criminal case in the country brought against those involved in nursing homes during the COVID-19 pandemic,” Attorney General Maura Healey said.", "2.1K", ["530", "Comments"]], ["Wedding busters: Police in the Arab world have been disrupting long-awaited wedding parties with officers barging in, kicking out guests and slapping hefty fines on the party's organizers The tough action has been triggered by resurgent coronavirus cases.", "106", ["10", "Comments"]], ["The coronavirus pandemic has forced thousands of parents around the U.S. to delay or skip kindergarten for their children. The opt outs, combined with declines in preschool enrollment, are raising worries about the long-term effects on early education. http://apne.ws/4xBZFTu", "386", ["268", "Comments"]], ["Data analyzed by the AP shows several Postal Service districts serving urban regions in battleground states have a history of delivering mail at below the national targets and saw sharp drop-offs in performance over the summer. The message to voters is clear: Mail those ballots early.", "777", ["316", "Comments"]], ["An AP investigation has found labor and human rights abuses on plantations producing palm oil, an ingredient contained in roughly half of all supermarket and most cosmetic products. When consumers see palm oil listed as an ingredient in their snacks, one worker says, they should know “it’s the same as consuming our sweat and blood.”", "1K", ["226", "Comments"]], ["Gov. Gavin Newsom's call for Californians to “pull away from the gas pumps\" is cheering environmental groups and provoking the oil industry.", "2.8K", ["671", "Comments"]], ["Wells Fargo CEO Charles Scharf is apologizing for comments he made suggesting it is difficult to find qualified Black executives in the financial industry.", "612", ["348", "Comments"]], ["A grand jury indicted a fired Kentucky police officer on criminal charges in the Breonna Taylor case — but not for her death. Brett Hankison was charged Wednesday with three counts of wanton endangerment for firing into the apartments of Taylor’s neighbors. Taylor was shot multiple times by officers who burst into her home on March 13 during a narcotics investigation.", "2.5K", ["1.1K", "Comments"]], ["COMING THURSDAY: Fruits of Labor: An AP investigation into the labor and human rights abuses of workers on giant plantations that grow palm oil, the world’s most consumed vegetable oil found in roughly half the products on supermarket shelves and in most cosmetic brands.", "162", ["27", "Comments"]], ["Chief Justice John Roberts described the late Justice Ruth Bader Ginsburg are “tough, brave, a fighter, a winner” but also “thoughtful, careful, compassionate, honest.” Roberts spoke during a private ceremony in the Great Hall of the Supreme Court.", "5.5K", ["349", "Comments"]], ["“I think that you are one of this country’s great men, and it was an honor to spend an evening with you,” Donald Trump wrote to Richard Nixon in 1982. AP got an exclusive look at letters between two men in Manhattan who craved the same thing: validation.", "682", ["290", "Comments"]], ["An image captured by an AP photographer showing a dust-covered girl carried against a man’s shoulder has come to symbolize the devastation of the Aug. 4 Beirut explosion. The tragic story behind the photo reflects the particular pain of Syrian refugee families in Lebanon, home to about a million Syrians.", "228", ["34", "Comments"]], ["The year 2020 was supposed to be a big one for the Pilgrims. But many of the activities planned to mark the 400th anniversary of the Mayflower's arrival to what we now know as Plymouth, Massachusetts, have been postponed or canceled due to the pandemic.", "172", ["21", "Comments"]], ["Oregonians are grieving the loss of some of their natural treasures after wildfires wiped out campgrounds, hot springs and wooded retreats that have been touchstones for generations.", "1.4K", ["306", "Comments"]], ["200,000 The number of dead in the U.S. from COVID-19 is equivalent to a 9/11 attack every day for 67 days. It is roughly equal to the population of Salt Lake City or Huntsville, Alabama. http://apne.ws/EaYxUg8", "3.6K", ["1.6K", "Comments"]], ["More than any other member of the Supreme Court, Justice Ruth Bader Ginsburg had a look all her own. And clothing became a way she connected with the public and even other members of the court.", "1K", ["264", "Comments"]], ["As Americans’ household wealth soars, many economists also see widening economic inequality.", "772", ["439", "Comments"]], ["Barbara Lagoa, an appeals court judge from Florida, is on President Trump’s short list to replace Ruth Bader Ginsburg on the Supreme Court.", "1.6K", ["1.1K", "Comments"]], ["Leaders are confronting the legacy of Alabama's Department of Archives and History, a vast repository of Confederate records and artifacts that once promoted the racist “lost cause” narrative of the Civil War. http://apne.ws/XVXbGCE", "192", ["195", "Comments"]], ["Ohio may not be the presidential bellwether it has been. But it could be a useful barometer. While it would take a deep suburban dive for President Trump to lose the state, the effect of similar declines in other states could be more devastating. http://apne.ws/5qvOQ2w", "2.5K", ["841", "Comments"]], ["\"Today people feel the insecurity and they feel it in almost every venue.\" The death of Justice Ruth Bader Ginsburg has brought another 2020 blow. http://apne.ws/fmMun75", "774", ["483", "Comments"]], ["\"We must show unity like never before.\"", "536", ["98", "Comments"]], ["“As recently as, say, two months ago she was looking ahead to next year, so even though we knew she was ill we didn’t expect it to come to an end at this point,” said Ann Claire Williams, a former federal appeals court judge and Ginsburg’s friend.", "13K", ["352", "Comments"]], ["Hours-long wait times at polling places and absentee ballots that never arrived marred the presidential primary in Fulton County, Georgia, and disproportionately affected Black voters. Now election officials in the county that includes Atlanta say they are making big changes, as they expect record turnout and Georgia emerges as a presidential battleground.", "432", ["198", "Comments"]], ["“We must recognize that Sweden, at the moment, has avoided the increase that has been seen in some of the other countries in western Europe,” WHO Europe’s senior emergency officer, Catherine Smallwood, said. “I think there are lessons for that. We will be very keen on working and hearing more from the Swedish approach.”", "541", ["257", "Comments"]], ["Thousands of protesters have flooded Belarusian cities for six weeks of demonstrations to demand an end to the 26-year rule of the country’s authoritarian President Alexander Lukashenko. While younger people make up the bulk of the protesters, many retirees have joined the daily demonstrations as well. “Our dream is to live in a free Belarus at least for a while. I have seen a lot in my life, I don’t fear anything anymore and I can’t look at what’s going on with indifference,” said 69-year-old former diplomat Mikhail Batsyan.", "662", ["25", "Comments"]], ["“If we had a good government, a democratic government, our politics, our education and our healthcare system would be better than this,\" said protester Amorn Panurang. \"This is our dream. And we hope that our dream will come true.”", "724", ["170", "Comments"]], ["If Arizona Democrat Mark Kelly wins a seat in the U.S. Senate, he could take office as early as Nov. 30, shrinking the GOP’s Senate majority at a crucial moment and complicating the path to confirmation for President Donald Trump’s Supreme Court nominee. “When it comes to making a lifetime appointment to the Supreme Court, Washington shouldn’t rush that process for political purposes,” Kelly said in a statement.", "8.5K", ["844", "Comments"]], ["“Getting the first job was hard for women of my vintage,” Justice Ruth Bader Ginsburg would say. “But once you got the first job you did it at least as well as the men and so the next step was not as hard.”", "765", ["54", "Comments"]], ["\"We’ll wait to the next election.\" A look at what key Republican senators said in the past — and what they are saying now — about filling a seat on the Supreme Court during an election year.", "1.5K", ["1K", "Comments"]], ["“The COVID-19 pandemic is a crisis unlike any in our lifetimes, and so this year’s General Assembly session will be unlike any other, too.” -U.N. Secretary-General Antonio Guterres.", "96", ["25", "Comments"]], ["President Trump is escalating his promise for a coronavirus vaccine before Election Day. But many do not trust his administration to produce a safe and effective vaccine so quickly. That poses a delicate political challenge for Democrats.", "238", ["239", "Comments"]], ["In Arizona, Texas, Florida and other states, voting groups are responding to what is projected to be record turnout among Latinos and other minorities by recruiting a diverse and bilingual group of poll workers for the upcoming presidential election.", "502", ["177", "Comments"]], ["Joe Biden has left little doubt that if elected he would try to scale back President Trump’s buildup in nuclear weapons spending. And although he has not fully detailed his plans, Biden says he would push for less reliance on the world’s deadliest weapons.", "1.5K", ["457", "Comments"]], ["President Trump’s push to repeat his thin victory in Pennsylvania four years ago won't happen without white evangelicals, and there are signs they haven't lost the faith. While some had misgivings about Trump in 2016, this time they seem eager to back him.", "1.6K", ["1.2K", "Comments"]], ["A look at the Supreme Court confirmation process. Confirming a nominee before the election would require a breakneck pace, yet there are no set rules for how long the process should take.", "474", ["546", "Comments"]], ["Highlights of some of the most compelling images made or published by The Associated Press from around the world.", "58", ["1", "Comments"]], ["Her dream was to be an opera singer. She was known for long pauses as she spoke. She was an architect of the women’s rights movement. She had five bouts with cancer. Read about the towering life of Justice Ruth Bader Ginsburg. http://apne.ws/gMp1DRs", "10K", ["663", "Comments"]], ["Justice Ginsburg showed over and over a steely resilience in the face of personal loss and serious health problems that made the diminutive New Yorker a towering women’s rights champion and forceful presence on the Supreme Court for over 27 years.", "2.9K", ["383", "Comments"]], ["The Supreme Court says Justice Ruth Bader Ginsburg has died of metastatic pancreatic cancer at age 87. http://apne.ws/5oELVqX", "5.9K", ["577", "Comments"]], ["“We’re tired and covered in ash and soot all blowing in our faces, coughing from the smoke.\" Firefighters in the American West battle exhaustion, fear and uncertainty alongside unending flames. http://apne.ws/71rOJXT", "298", ["35", "Comments"]], ["How do you feel about the U.S. government setting a date for banning TikTok? Forlorn? Angry? Ready to move on? Ready to take action?  Let us know in the comments or email reporter Barbara Ortutay at bortutay@ap.org.", "503", ["461", "Comments"]], ["Stranded in the Mediterranean: A Lebanese father’s dream of a better life for his family turns into a harrowing journey and loss of his 2-year-old son.", "126", ["12", "Comments"]], ["The Centers for Disease Control and Prevention has removed guidance posted online last month that said people who had been in close contact with someone exposed to the coronavirus didn’t need to get tested if they didn’t feel sick.", "782", ["312", "Comments"]], ["Companies are struggling to recruit diverse volunteers in final U.S. tests of possible COVID-19 vaccines. Many minority groups are at greater risk from the virus than whites, but a history of scientific exploitation and racism makes some reluctant.", "77", ["44", "Comments"]], ["An @AP review of medical records reveals growing allegations that a gynecologist operated on detained migrant women without their consent.", "1.6K", ["411", "Comments"]], ["Graphic photos of a Black man who died after a police pursuit last year have fueled calls for the Louisiana State Police to release body camera footage of what they called their \"struggle” to take 49-year-old Ronald Greene into custody. http://apne.ws/xwWm0xs", "233", ["198", "Comments"]], ["Less than seven weeks until Election Day, a new AP-NORC poll finds most Americans are deeply pessimistic about the direction of the country and skeptical of President Trump’s handling of the pandemic.", "2.2K", ["1.3K", "Comments"]], ["Attorney General William Barr told U.S. attorneys he wants prosecutors to be aggressive in charging demonstrators who cause violence. The crackdown has already led to more than 300 arrests. AP found many were accused of serious crimes, others were not.", "2.1K", ["852", "Comments"]], ["India is now second in the world with the number of reported coronavirus infections with over 5.1 million cases, behind only the United States. Its death toll of only 83,000 in a country of 1.3 billion people, however, is raising questions about the way it counts fatalities from COVID-19. Experts say its official death toll is likely an undercount.", "133", ["100", "Comments"]], ["President Trump contradicts CDC director Robert Redfield, saying he must have been \"confused\" when he testified to Congress that a coronavirus vaccine probably won't be widely available before late spring or summer 2021.", "4.1K", ["849", "Comments"]], ["A Mississippi alligator rancher is breathing a sigh of relief after Hurricane Sally spared him from a gator-unleashing storm surge. http://apne.ws/Jl6CZwC", "161", ["29", "Comments"]], ["Halloween is approaching and enthusiasts are trying to figure out how to pull out some fun while staying safe in the pandemic. Among the ideas: roving grown-ups tossing candy to kids waiting on lawns and corn mazes with wider paths to allow for social distancing. Many haunted houses and other terror-inducing attractions have been canceled, but some have pivoted to drive-thru events. Some traditional events have gone virtual, like the Safeway World Championship Giant Pumpkin Weigh-Off in Half Moon Bay, California.", "91", ["77", "Comments"]], ["In Texas and other states, scholars are working to piece together the story of a largely forgotten part of American history: a network that helped thousands of Black slaves escape to Mexico.", "2.2K", ["159", "Comments"]], ["“I’ve been at this 23 years, and by far this is the worst I’ve seen.” Firefighters battling the West Coast blazes say the fires are severely taxing the human, mechanical and financial resources of the nation’s wildfire fighting forces.", "2.9K", ["458", "Comments"]], ["America Disrupted: In a swing county in Wisconsin, even views on objective economic facts are seen through political lens.", "248", ["274", "Comments"]], ["Rochester, New York, police commanders urged city officials to hold off on releasing body camera footage of Daniel Prude’s March suffocation death because they feared violent blowback, emails show. The video was made public by Prude’s family on Sept. 4. http://apne.ws/4sGskmx", "782", ["290", "Comments"]], ["“Everything is covered in ashes. It’s hard to breathe.” Smoke from the massive West Coast wildfires means people from the region have been living for a week or longer with some of the most unhealthy air on the planet. Scientists and forecasters say relief may not come for days or even weeks.", "714", ["272", "Comments"]], ["The last time Tabitha was in the ocean, it didn't seem likely she would survive the week. But more than a year later, the 168-pound loggerhead turtle returned to the surf along with two other turtles nursed back to health by a New Jersey nonprofit. http://apne.ws/GZPZm4e", "1.3K", ["11", "Comments"]], ["President Trump hails \"dawn of the new Middle East\" at ceremony for signing of agreements between Israel and two Gulf Arab states, Bahrain and the United Arab Emirates. http://apne.ws/n4K2MbX", "12K", ["1.2K", "Comments"]], ["Louisville will pay several million dollars to the mother of Breonna Taylor and install police reforms as part of a settlement of a lawsuit from Taylor’s family, a person who has seen the settlement told The Associated Press. Taylor was fatally shot by police officers who burst into her apartment.", "1.3K", ["582", "Comments"]], ["The West Coast fires are damaging a regional economy already singed by the coronavirus outbreak The credit rating agency A.M. Best estimates that insured losses from the blazes in California could top the unprecedented $13 billion recorded in 2017.", "2K", ["151", "Comments"]], ["“It’s never been this tragic for such a sustained period of time. Since COVID hit, the numbers of people in line at food pantries and soup kitchens skyrocketed, and it’s not going down,” said Rosanna Robbins, director of food access and capacity at City Harvest, New York City’s biggest food rescue organization. http://apne.ws/KP4fM0C", "213", ["91", "Comments"]], ["Leaders in the Democratic-led West Coast states and President Donald Trump are clashing over the role of climate change as wildfires race through the region. Ahead of Trump's visit Monday to California for a fire briefing, the governors of California, Oregon and Washington state have said the fires are a consequence of climate change. Trump has blamed poor forest management.", "908", ["1.5K", "Comments"]], ["“We lost track of time because you can’t see the sun and you’ve been up for so many days. Forty-eight to 72 hours nonstop, you feel like you’re in a dream.” -Firefighter Steve McAdoo.", "5.5K", ["297", "Comments"]], ["Central Americans in a refugee program ended by President Trump fear for their futures. Despite a court settlement allowing them to come to the U.S., many are stuck in their home countries because of the pandemic or face uncertain prospects once they arrive.", "483", ["292", "Comments"]], ["“Some still wanted to go back in the classroom, but they didn’t think the risk was worth it. They looked at their grandkids and the life they have, and I think they’re saying, ‘I’m just not going to do it.’” Many teachers are choosing not to return to the classroom because of the coronavirus threat, and schools across the U.S. are scrambling to find replacements. That sometimes means lowering certification requirements to help get substitutes in the door.", "1.1K", ["463", "Comments"]], ["“I wear the nerdiest glasses I have and often a jacket that has my college logo, so that people don’t mistake me for what they think is a thug or hooligan.\" For Black environmental scientists, worrying about whether they are likely to be harassed or asked to justify their presence while doing fieldwork is a familiar concern.", "1.6K", ["375", "Comments"]], ["Top U.S. health officials delivered some mixed messages during the early days of the coronavirus outbreak, but their overall thrust was to take it seriously. President Trump had a louder megaphone, and in public he was playing down the threat.", "1.4K", ["1.2K", "Comments"]], ["A whistleblower’s allegation that he was pressured to suppress intelligence about Russian election interference is among a number of accounts from former officials that raise questions about how seriously the administration is taking the threat.", "1.9K", ["658", "Comments"]], ["In the nearly two years since the devastating Camp Fire, the Northern California town of Paradise has tried to entice people back. The road sign heading into town still boasts of a population of more than 26,000. But the reality is closer to 4,000 now, local leaders say.", "380", ["92", "Comments"]], ["Diminishing winds and rising humidity helped firefighters battling deadly blazes in Oregon and California, but with dozens of people still missing, authorities in both states feared that the receding flames could reveal many more dead.", "254", ["28", "Comments"]], ["Wildfires are raging in California and Oregon. The Atlantic has seen a record number of tropical storms and Phoenix keeps breaking heat records. But scientists say it will get worse. In 20 years, they say we'll look back and think 2020 wasn't so bad.", "1.1K", ["627", "Comments"]], ["A person U.S. officials say is a \"Russian agent\" released edited recordings of Joe Biden's phone calls that quickly flowed into the social media feeds of Americans, skirting new policies from Facebook, YouTube and Twitter to prevent such foreign meddling.", "2K", ["817", "Comments"]], ["Jeff Lello lost his job as a waiter amid the coronavirus pandemic. Unable to afford his rent, he lived in a tent deep in the woods for months, awaiting unemployment checks in Florida, one of the slowest states to process claims in the country.", "2.9K", ["535", "Comments"]], ["This photo gallery highlights some of the most compelling images made or published by The Associated Press from around the world.", "50", ["2", "Comments"]], ["Berry Creek, California, was largely destroyed in what has become the deadliest fire of 2020, a year that has already shattered California records for the most area burned — more land than the state of Connecticut. http://apne.ws/xve2KT0", "10K", ["755", "Comments"]], ["Parks and beaches are being closed, residents are being told to stay inside and authorities are considering opening \"smoke shelters\" as wildfires unleash some of the world's worst air quality in California and the Pacific Northwest. http://apne.ws/o0AEv1f", "543", ["194", "Comments"]], ["Can you vote in person before Election Day in your state? How much time do you have left to request an absentee ballot? Get the facts about early voting. #Election2020 http://apne.ws/GkSU6eB", "217", ["183", "Comments"]], ["President Trump told Bob Woodward that the U.S. has built a nuclear weapon system that “nobody’s ever had in this country before.” But weapons experts are puzzled. Some think he may have been talking about a modified nuclear warhead.", "915", ["506", "Comments"]], ["Americans are commemorating 9/11 as a new national crisis in the form of the coronavirus pandemic reconfigures anniversary ceremonies. In New York, victims’ relatives gathered for remembrances at the Sept. 11 memorial plaza.", "2.9K", ["149", "Comments"]], ["All five intensive care beds dedicated to COVID patients are full in the Laveran Military Training Hospital in Marseille, and its doctors are bracing for more. What’s happening reflects growing pressure on medical facilities across France as infections resurge.", "319", ["76", "Comments"]], ["An analysis by The Associated Press and Chalkbeat shows public schools with largely white student bodies are more likely to start the year in person than those with mostly Black and Latino ones. That often reflects parents' preferences but raises concerns about inequality.", "679", ["157", "Comments"]], ["Sandy Butler called her son to say she and her husband were going to try to find shelter in a pond as a wildfire roared across California's Sierra Nevada foothills. The Butlers are among the missing after the fire destroyed much of the town of Berry Creek.", "5.4K", ["241", "Comments"]], ["A disagreement over commemorating 9/11 in a time of social distancing is leading to an anniversary divide: two separate, simultaneous ceremonies at and near the Sept. 11 memorial plaza in New York.", "376", ["156", "Comments"]], ["Eight months into the pandemic and nurses say there still aren’t enough N95 medical masks. Here’s why:", "547", ["242", "Comments"]], ["Others may be faltering during the pandemic, but Amazon says it wants to bring aboard 33,000 people for corporate and tech roles in the next few months. It’s the most job openings it’s had at one time.", "181", ["88", "Comments"]], ["New standards for the Oscars best picture became a hot topic on social media as soon as they were announced. Some critics say the diversity rules go too far. Others contend they don't go far enough.", "92", ["132", "Comments"]], ["People from San Francisco to Seattle woke up to an eerie orange glow as dozens of wildfires blacken the American West. Despite the darkened skies, there was little scent of smoke and air quality did not reach unhealthy levels.", "620", ["174", "Comments"]], ["AstraZeneca's suspension of final testing of its potential COVID-19 vaccine while it investigates a volunteer's illness shows there will be “no compromises” on safety in developing the shots, the chief of the National Institutes of Health told Congress.", "541", ["55", "Comments"]], ["Wildfires are raging across parts of the Western U.S. In California, winds stoked fires that have forced rescues and evacuations. In Washington, more acres burned in a single day than firefighters see all year. There also were fires in Oregon and Idaho.", "529", ["225", "Comments"]], ["Thousands of migrants and refugees have fled a camp under COVID-19 lockdown after multiple fires gutted much of the site on the Greek island of Lesbos. They are now in need of emergency shelter after escaping scenes of inferno.", "684", ["33", "Comments"]], ["“I’m seeing America change before my eyes.”", "121", ["73", "Comments"]], ["“Keeping Up With the Kardashians\" debuted more than a decade ago and spawned a remarkable 12 spinoffs. Now it's time to bid the reality show goodbye.", "936", ["504", "Comments"]], ["It was already difficult to count Native Americans in the census, and the pandemic created new setbacks. As the deadline nears, tribes are racing to get more people counted to ensure enough federal funding for health care, housing and other critical needs.", "302", ["35", "Comments"]], ["THREAD: What should I look for in a hand sanitizer? Pick one that contains mostly alcohol, and has few other ingredients. http://apne.ws/NjIk4rW", "101", ["49", "Comments"]], ["Dozens of health-care workers in the Gaza Strip have been infected during the coronavirus outbreak detected last month, straining the already overburdened medical system gutted by years of strife with Israel and Palestinian feuds.", "121", ["68", "Comments"]], ["“If adults can work from home, kids can study from home.”", "819", ["105", "Comments"]], ["Scientists are reporting findings that hold promise for the health of astronauts on prolonged space trips like Mars missions.", "244", ["23", "Comments"]], ["California's wildfires have now burned a record 2 million acres in 2020 - and the most dangerous part of the year is still ahead.", "7.2K", ["327", "Comments"]], ["The battle for control of the U.S. Congress this fall is solidifying into a race about President Trump. Republicans are hitching their fortunes to the party’s leader, while Democrats position themselves as a bulwark against Trump.", "503", ["373", "Comments"]], ["An Associated Press analysis finds that up to three times as many voters in November could be disenfranchised in key battleground states when compared to the last presidential election if ballots are rejected at the same rate as in this year's primaries. Rejections could be even more pronounced in some urban areas where Democratic votes are concentrated.", "1.8K", ["721", "Comments"]], ["“There was definitely a lot of wishful thinking that there was going to be a magical test that was going to save us all, but we’re not there yet.” Coronavirus antibody tests touted by President Trump and his top officials to help reopen the economy are now widely available, but predictions for their usefulness haven't panned out. Scientists haven't figured out how much immunity antibodies provide.", "350", ["132", "Comments"]], ["\"This whole situation has left me really sad and empty. I checked on the lines person and the tournament told me that thank God she is feeling ok.\"", "799", ["238", "Comments"]], ["A deadlock in Congress over whether to pass another coronavirus relief package is frustrating state and local government leaders who are facing big drops in tax revenue. Some say they will have to begin cutting budgets for core services, such as schools, colleges and even childhood vaccination programs.", "766", ["577", "Comments"]], ["Candidates for state legislature in at least a dozen states have engaged in some way with the baseless QAnon conspiracy theory. But when contacted by the AP, some who had shared social media messages referencing the conspiracy tried to distance themselves from the movement.", "1.6K", ["831", "Comments"]], ["Memorial Day brought the death of George Floyd at the hands of Minneapolis police, prompting hundreds of thousands of Americans of all races to take to the streets in protest. President Trump called Floyd's death a “disgrace,\" and momentum built around policing reform. But by Labor Day, the prospects for federal legislation have evaporated. And Trump is hoping that the violence that has erupted will help him with white, suburban voters.", "1K", ["816", "Comments"]], ["Families are struggling to rebuild one month after a massive explosion centered at Beirut's port that devastated the Lebanese capital. Frustration is high, with the state almost nowhere to be seen and often-promised international help slow in coming.", "254", ["22", "Comments"]], ["Michael Cohen's book is a deeply personal put-down of President Trump. In it, the president's former personal attorney assails Trump as an “organized crime don” and “master manipulator.” The White House calls Cohen’s memoir “fan fiction.”", "1.7K", ["927", "Comments"]], ["Authentic won by 1 1/4 lengths without the usual crowd of 150,000 on hand at Churchill Downs because of the coronavirus pandemic.", "133", ["28", "Comments"]], ["“Their new theme is that it’s OK to support Trump even if you don’t care for him,” said Alex Conant, a Republican strategist who advised Florida Sen. Marco Rubio’s presidential bid four years ago. “People don’t like him because they think he is racist, sexist or doesn’t care about average people. But their message now is, ‘Don’t look at what he said, look at what he does.’”", "3.6K", ["1.8K", "Comments"]], ["“We already knew there was a large gender inequality in the labor force, and the pandemic just makes this worse.”", "1K", ["425", "Comments"]], ["Bret Schafer, an expert on foreign disinformation with the bipartisan group Alliance for Securing Democracy, said stoking racial animosity is a Kremlin strategy that goes back decades. His group tracked a major uptick in social media activity on racial issues from Russian state-sponsored media and political figures this summer, especially after the killing of George Floyd at the hands of Minneapolis police. “We have seen a constant messaging theme being race and racism in the U.S.,” Schafer said. “They’re very good at it.”", "1K", ["612", "Comments"]], ["Americans are heading into Labor Day weekend amid warnings from public health experts that backyard parties, crowded bars and other gatherings could cause the coronavirus to come surging back.", "411", ["613", "Comments"]], ["For months, nationwide protests against racial injustice and COVID-19 lockdown orders have attracted all kinds of extremists using online platforms. Recent protests in Kenosha, Wisconsin, show how easy it can be for them to avoid digital roadblocks.", "243", ["171", "Comments"]], ["The suffocation of a Black man in Rochester, New York, has drawn attention to the use by police of \"spit hoods\" – mesh bags that are meant to prevent officers from being spit on or even bitten. Critics denounce them as dangerous and inhumane.", "742", ["789", "Comments"]], ["“Ninety-nine percent there isn’t anything, but even if there is less than 1% hope, we should keep on looking,”", "229", ["23", "Comments"]], ["The Trump administration rolled out a $300-a-week federal unemployment benefit after Congress failed to agree to extend a $600 payment. Yet because of restrictions and bureaucratic hurdles, more than 1 million unemployed won’t receive that $300 check.", "813", ["403", "Comments"]], ["Desperate for relief: Afghans are rushing back to public recreation as the government eases the virus lockdown imposed in March. Since mid-July, Afghans can frequent parks and gyms, shop in malls and celebrate marriages in wedding halls.", "100", ["25", "Comments"]], ["Massachusetts congressman Joe Kennedy lll’s bid for the U.S. Senate ended this week in defeat. Sixty years after JFK’s election as president, some are wondering if the family's political mystique has vanished.", "1.1K", ["310", "Comments"]], ["A newly released video shows Rochester, New York, police putting a hood on a Black man and pinning him to the ground before his asphyxiation death in March.", "4.6K", ["1.4K", "Comments"]], ["Young fans of \"Black Panther\" honored star Chadwick Boseman in their own special way: mock funerals attended by their toys. Soon after the death of the King T'Challa star, parents took to social media with posts of the funerals in bedrooms and backyards. Other kids watched Boseman's movies all over again and donned their \"42\" jerseys.", "517", ["13", "Comments"]], ["Young fans of \"Black Panther\" have honored star Chadwick Boseman in their own way: mock funerals attended by their toys. Soon after the star's death, parents took to social media with posts of the funerals in bedrooms and backyards. Other kids are watching Boseman's movies all over again and donning their \"42\" jerseys.", "6K", ["88", "Comments"]], ["As the nation awaits a vaccine to end the pandemic, local health departments tell @AP and @KHNews they lack the staff, money and tools to distribute, administer and track millions of vaccines, most of which will require two doses.", "502", ["442", "Comments"]], ["“I have too many stories to tell.\" 99-year-old Hidekazu Tamura has vivid memories of his time locked up with thousands of other Japanese Americans in U.S. internment camps. He spoke to The Associated Press amid commemorations of Wednesday's 75th anniversary of the formal Sept. 2, 1945, surrender ceremony that ended World War II.", "721", ["427", "Comments"]], ["Migrants are trying to reach Europe one way or another. After Morocco increased border control in the Mediterranean, they are now taking an even riskier route to the Canaries, a Spanish archipelago off West Africa.", "161", ["49", "Comments"]], ["Walmart has a long way to go to catch up with Amazon Prime. But it's trying.", "127", ["89", "Comments"]], ["It's back to school for millions of children across Europe and beyond, despite the pandemic.", "153", ["30", "Comments"]], ["A familiar narrative has emerged since Jacob Blake’s shooting by a Wisconsin police officer. It's one seen many times after a Black person is killed or grievously wounded by police: That somehow his actions or past can explain why the officer fired.", "831", ["914", "Comments"]], ["One Belarus poll worker described being asked to sign the result sheet before voting ended, another watched helplessly as votes for other candidates were attributed to the president, and a third was fired on the spot for pointing out fraud.http://apne.ws/fXquJOD", "930", ["168", "Comments"]], ["Amazon is an \"important step\" closer to delivering packages by air.", "649", ["222", "Comments"]], ["The first-ever direct flight from Israel to the United Arab Emirates concluded with a warm reception in Abu Dhabi. Monday's flight was steeped in symbolism, with the word “peace” emblazoned in English, Hebrew and Arabic above the cockpit window.", "306", ["162", "Comments"]], ["The perfect storm: a pandemic, racial unrest and a rancorous election year are bringing armed Americans out on city streets. http://apne.ws/HRqERv3", "1.2K", ["1.6K", "Comments"]], ["“This nation feels so broken right now.” “People need to understand it’s not Black against white.\" “We don’t know what to believe.”... In 2 outbursts of bloodshed, Kenosha, Wisconsin, seemed a microcosm of a nation wracked by discord. http://apne.ws/fO2yDsD See More", "542", ["543", "Comments"]], ["Joe Biden is condemning violence at recent protests and blaming President Trump for fomenting the divide that's sparking it. Speaking after traveling to Pittsburgh, Biden denounced rioting, looting and arson at recent protests.", "3.9K", ["2K", "Comments"]], ["At 6-foot-10, with an ever-present white towel slung over his shoulder, John Thompson literally and figuratively towered over the Georgetown basketball program for decades. He never shied away from sensitive topics – particularly the role of race in both sports and society – and he once famously walked off the court before a game to protest an NCAA rule because he felt it hurt minority athletes.  Thompson, the first Black coach to lead a team to the NCAA men’s basketball championship, has died at age 78. http://apne.ws/0wr0D6S", "368", ["17", "Comments"]], ["What is Patriot Prayer? The right-wing group doesn’t have a big national footprint but is active in the Pacific Northwest. One of its members was fatally shot in Portland after supporters of President Trump clashed with Black Lives Matter protesters.", "1.7K", ["1.5K", "Comments"]], ["''Why are you forcing us to drink medicine when we’re not sick!”: Amid a second outbreak, some residents of China’s far west Xinjiang region are complaining they are being forced to drink traditional Chinese medicine. There’s no rigorous clinical data proving the remedies work against the virus, and experts call it a major breach of medical ethics.", "363", ["143", "Comments"]], ["Lady Gaga and Ariana Grande are the top contenders at the VMAs with nine nominations apiece, most of them for their No. 1 collaboration “Rain on Me,” which is nominated for the top prize — video of the year.", "2.4K", ["28", "Comments"]], ["Many election officials across the U.S. are trying to make voting as safe and accessible as possible amid the coronavirus pandemic. They will offer latex finger coverings for use on touchscreen machines, make masks and hand sanitizer widely available, and try to set up separate voting stations for voters who have recently tested positive for COVID-19.", "682", ["287", "Comments"]], ["Kobe Bryant. John Lewis. Chadwick Boseman. Lebron James, Al Sharpton and more reflect on the loss of three Black icons in a year already made tumultuous by COVID-19 and police shootings.", "1.2K", ["272", "Comments"]], ["Amid concerns about widespread mail delays, Congressional Democrats are looking into how Louis DeJoy came to be hired as postmaster general. DeJoy, a prominent donor to President Trump and other Republicans, wasn't among 53 original candidates for the job.", "2.5K", ["562", "Comments"]], ["“It’s fair to say that telemedicine was in its infancy prior to the pandemic, but it’s come of age this year.” The use of telehealth visits has taken off after Medicare temporarily relaxed restrictions because of the pandemic. Now there’s a push to make telemedicine a permanent mainstay of the government’s flagship health program.", "733", ["93", "Comments"]], ["Lebanon's militant group Hezbollah has come under unprecedented criticism in the wake of Beirut's massive explosion this month that killed at least 180 people, though no evidence has emerged linking the Iran-backed Shiite force to the blast.", "125", ["46", "Comments"]], ["Just driving through Lake Charles, Louisiana, remains a feat. Hurricane Laura hit the city of 80,000 head on, and downed power lines and trees still block streets or create one-lane roadways.", "1.7K", ["277", "Comments"]], ["“There’s a lot to learn from Jackie Robinson. There’s a lot to learn from James Brown. There’s a lot to learn from Thurgood Marshall,” Chadwick Boseman said. “I would like to say that some of those qualities have infused themselves into me at this point.”", "4.6K", ["138", "Comments"]]]