[["Vladimir Putin praised Trump for improving U.S.-Russia ties and said he also saw grounds for cooperation with a Biden administration.", "138", ["42", "Comments"]], ["Plexiglass barriers. Candidates will be 12 feet apart. Anyone who refuses to wear a mask in the audience will be removed.  Here's how this year's VP debate will be different.", "88", ["20", "Comments"]], ["NEW: People who love trading turnips on Animal Crossing's “stalk” market are also trying their hand investing in real shares.", "88", ["33", "Comments"]], ["LIVE: Daily life — and the global economy — may not fully return to normal until an inoculation against coronavirus is developed, manufactured in mass quantities and distributed worldwide. Join our Bloomberg Businessweek Town Hall for a discussion on the vaccine race.", "44", ["4", "Comments"]], ["U.S. stocks are on track to rebound after yesterday's slump as Wall Street reacts to President Donald Trump's decision to halt stimulus talks. Follow our live coverage from 9-10a ET.", "198", ["20", "Comments"]], ["\"Our commander-in-chief, sadly, has been missing in action.\" Michelle Obama calls out Trump for what she calls “willful  mismanagement” of the coronavirus crisis. https://bloom.bg/3ntLOz4", "214", ["83", "Comments"]], ["This could be a huge step toward resuming long-haul travel.", "36", ["5", "Comments"]], ["Trump torpedoed any chance of a new virus stimulus, saddling himself with the blame for layoffs and market losses before the election.", "397", ["292", "Comments"]], ["Former French police officer Noam Anouar was suspended after whistleblowing.  He's now dedicated his life to helping fight Islamophobia and racism within the force, via Bloomberg QuickTake.", "30", ["12", "Comments"]], ["A new front is opening up in a bitter political battle over the controversial gas project.", "31", ["3", "Comments"]], ["The former trader, who Denmark accuses of orchestrating a $2 billion dividend-tax fraud, said he \"obviously\" rejected the deal.", "11", ["2", "Comments"]], ["Global cinemas are reeling from virus restrictions and delayed releases. But for Japan's biggest movie company, things are looking up.", "16", ["3", "Comments"]], ["Global markets whipsawed after Trump unleashed a barrage of sometimes conflicting Twitter posts.", "45", ["26", "Comments"]], ["Britain’s governing Conservatives are increasingly seeing Chancellor of the Exchequer Rishi Sunak as the next prime minister.", "102", ["5", "Comments"]], ["Staff who choose to work three days a week will receive 60% of their salary and those who choose four days, 80%.", "86", ["4", "Comments"]], ["Pence's staff said if Harris “wants it, she’s more than welcome to surround herself with plexiglass if that makes her feel more comfortable.”", "169", ["89", "Comments"]], ["Dubai real estate stocks' spectacular fall from grace seems set to continue.", "38", ["5", "Comments"]], ["Covid has wiped out the dreams of a generation in Asia. Nearly 15 million jobs for teenagers and young adults could be lost in 13 countries this year, a report says.", "156", ["27", "Comments"]], ["Even the mildest Covid-19 cases can leave lingering symptoms for months. Over a third of patients felt sick or in worse condition after 60 days, a study finds.", "627", ["59", "Comments"]], ["Jurassic World: Dominion, the next sequel in the 'Jurassic World' series, has been pushed back by a year and is now scheduled for summer of 2022.", "23", ["2", "Comments"]], ["More women than ever hold the CFO job at major U.S. companies, though that role doesn't often lead to CEO.", "16", ["4", "Comments"]], ["South Korean conglomerate CJ Group is exploring a $1 billion sale of its Chinese unit, as a surge in e-commerce fuels demand for assets in related sectors", "16", ["5", "Comments"]], ["Trump unleashes a two-hour Twitter barrage on his first full day out of hospital, prompting Biden to post a “get off Twitter” image of himself.", "399", ["182", "Comments"]], ["Got $10,000 to invest? This is what market veterans suggest buying right now. https://trib.al/WVFFMf1", "29", ["8", "Comments"]], ["Biden says Trump shouldn't take part in next debate if he still has the coronavirus.", "1K", ["235", "Comments"]], ["Trump accused FDA of carrying out a “political hit job” against him, hours after it issued strict new requirements for Covid-19 vaccine applications.", "260", ["87", "Comments"]], ["Trump hails his move to declassify documents related to the FBI’s Russia investigation and the probe into Hillary Clinton’s use of a private email account.", "450", ["251", "Comments"]], ["Pence doesn’t want a plexiglass divider for his side of the stage during the vice-presidential debate with Harris.", "272", ["120", "Comments"]], ["The U.S. and 38 countries stepped up criticism of China’s human rights record, denouncing Beijing for its treatment of ethnic minorities and for curtailing freedoms in Hong Kong.", "209", ["139", "Comments"]], ["Lawmakers need to ignore Trump's tweets and strike a big stimulus deal, fast.", "747", ["226", "Comments"]], ["Here’s what you need to know to register to vote in the 2020 general election.", "18", ["1", "Comment"]], ["Stephen Miller, one of Trump's most senior advisers, tested positive for the coronavirus https://trib.al/9u22C7y", "423", ["59", "Comments"]], ["Biden says that if elected, \"I will send a clear, unequivocal message to the entire nation. There’s no place for hate in America.\"", "4.3K", ["680", "Comments"]], ["Facebook says it will remove all Pages, Groups and Instagram accounts linked to followers of the QAnon conspiracy movement.", "2.8K", ["809", "Comments"]], ["You can't follow the bread crumbs when no one's leaving them.", "74", ["45", "Comments"]], ["When wildfires or hurricanes hit, it's not just people, but entire ecosystems that are impacted.  Meet the drone photographer who created a plan to rescue animals during the Australian bushfires and is bringing his methods to the world ▶️ https://bloom.bg/3d30QXU", "48", ["2", "Comments"]], ["Microsoft says it’s confident the diversity pledges are legal.", "25", ["1", "Comment"]], ["Eddie Van Halen, the guitar virtuoso who propelled his band Van Halen into one of hard rock’s biggest groups, has died. He was 65.", "343", ["29", "Comments"]], ["About 53% of larger companies plan to reduce the size of their office space in the post-Covid era.", "157", ["2", "Comments"]], ["NEW: Trump wants to return to the Oval Office, less than 24 hours after being released from the hospital, sources say. Some of Trump’s aides don’t want him to leave the White House residence — but are unsure how long he’ll continue to isolate himself.", "357", ["184", "Comments"]], ["BREAKING: Trump says he told his negotiators to stop talks with Democratic leaders on a fiscal stimulus package.", "2.4K", ["869", "Comments"]], ["NEW: What if there's no will? Covid deaths are forcing difficult family conversations.", "105", ["30", "Comments"]], ["Can physician Sean Conley prevent Trump from worsening his illness or infecting others?", "81", ["62", "Comments"]], ["LATEST: Delta becomes category 4 hurricane, threatening to wreck Cancun.", "99", ["8", "Comments"]], ["Trump’s Covid-19 diagnosis is reverberating through Washington and around the world — raising new questions about the November election, public perception of the virus, and governance of the country. Here's everything we know so far.", "38", ["12", "Comments"]], ["NEW: Trump said he feels “great” and is looking forward to debating Joe Biden next week.", "4.1K", ["115", "Comments"]], ["\"My brain is not as sharp\"", "54", ["9", "Comments"]], ["It's Instagram's 10th birthday, but we still don't know how big it really is.", "29", ["1", "Comment"]], ["A sad truth about the pandemic: Even if each individual’s choice is rational, it can lead the collective to some undesirable places.", "71", ["9", "Comments"]], ["EXCLUSIVE: Boom Technology is debuting a supersonic jet that will fly twice as fast as today’s typical commercial planes.", "1.5K", ["71", "Comments"]], ["With four weeks to go, it's hard to find good news for Donald Trump.", "513", ["136", "Comments"]], ["Only 25 of the biggest 100 companies were willing to go on record.", "14", ["4", "Comments"]], ["California's wine-producing region has weathered earthquakes and devastation before, but this fire season is the worst ever.", "274", ["17", "Comments"]], ["NEW: New data shows how diverse America's biggest companies really are.", "15", ["2", "Comments"]], ["\"Now that he's busy tweeting campaign messages, I would ask him to do this: listen to the scientists.\" Joe Biden wishes Donald Trump a speedy recovery but asks the president to support a mask mandate to help curb the spread of Covid-19. https://trib.al/FawbK85", "231", ["73", "Comments"]], ["Stocks are fluctuating ahead of a speech by Fed Chair Jerome Powell, with investors following President Trump's recovery and weighing the possibility of a Democratic sweep in November. Follow our live coverage from 9-10a ET.", "206", ["22", "Comments"]], ["NEW: Joe Biden leads Donald Trump by 16 points in a new national poll released by CNN.  57% of likely voters backed Biden and 41% supported President Trump.", "4.3K", ["965", "Comments"]], ["Extraordinary circumstances will elevate the vice presidential debate to the highest-stakes running mate matchup in years.", "68", ["18", "Comments"]], ["BREAKING: The European Union has no plans to offer concessions to Boris Johnson before next week's Brexit deadline, sources say.", "368", ["21", "Comments"]], ["Trump's “don’t let it dominate you\" message may cement perceptions that he's been too cavalier about the threat posed by the virus.", "2.8K", ["202", "Comments"]], ["“There are areas that have been able to stay productive, and there are those that have fallen a bit short.”", "24", ["1", "Comment"]], ["Demonstrators overran the parliament building and released a former president from jail, Interfax reported.", "57", ["4", "Comments"]], ["The pattern could shift.", "38", ["2", "Comments"]], ["BREAKING: Australia projects a budget deficit of A$213.7 billion, the worst in postwar history, as it plans a spending spree to lift the economy out of recession.", "188", ["60", "Comments"]], ["Visitors welcome — as long you agree to testing and tracing.", "92", ["6", "Comments"]], ["Sanjay Shah’s dividend-trading fund made him rich but reviled.", "2.3K", ["45", "Comments"]], ["How to boost an economy in 80 days.", "100", ["16", "Comments"]], ["Mexico is counting suspicious cases in its official tallies.", "21", ["1", "Comment"]], ["The GOP wants to keep Supreme Court nominee Amy Coney Barrett's hearing on track. Step one: set up sanitary stations.", "147", ["47", "Comments"]], ["“Quite frankly, I wasn’t surprised.”", "1.5K", ["336", "Comments"]], ["That the meeting is happening at all, as Trump battles a Covid-19 infection in Washington, illustrates its importance to the U.S.", "91", ["54", "Comments"]], ["The rapper said his largest asset is Yeezy, worth “over $50 million.\" He also lists liabilities of up to $100 million, the bulk of which are made up of various mortgages.", "185", ["59", "Comments"]], ["“There is not a single person in the United States — not the President and not anyone else — whose job description includes slandering women who they sexually assaulted,” E. Jean Carroll's attorney said. The president has denied Carroll’s allegations.", "349", ["107", "Comments"]], ["The recommendations, which would represent the most dramatic overhaul of competition law in decades if approved, are the result of a yearlong investigation by the House antitrust panel.", "72", ["4", "Comments"]], ["“The truth is you have hundreds of thousands of people living in spaces that are less than 100 square feet, coffin homes, caged homes, sub-divided apartments.”", "34", ["11", "Comments"]], ["What's the point of being thousands of miles from home only to sit in your living room?", "221", ["5", "Comments"]], ["The Golden Week holiday is putting on display China’s confidence in its economic rebound and its public health measures.", "275", ["66", "Comments"]], ["U.S. Supreme Court reinstated a South Carolina requirement that a witness sign each absentee ballot, siding with Republicans in an election clash.", "299", ["49", "Comments"]], ["WATCH: Trump removes his mask upon return to the White House from Walter Reed National Military Medical Center (via @QuickTake) Aides say they are unsure they can limit the president's movements as he recovers from Covid-19 https://bloom.bg/36zwdIl", "713", ["434", "Comments"]], ["The office is probing whether the Trumps' real-estate company falsely reported property values to get loans or tax benefits.", "519", ["68", "Comments"]], ["NEW: Trump has returned to the White House from the hospital, but aides say they are unsure they can limit his movements as he recovers from Covid-19.", "8.4K", ["415", "Comments"]], ["The city says it will shut schools and businesses to stop the outbreak.", "25", ["1", "Comment"]], ["Biden said earlier Monday that he would meet Trump in a second debate “if the scientists say that it’s safe.”", "428", ["147", "Comments"]], ["In 34 states, the seven-day average of new coronavirus cases is higher now than it was a month ago.", "276", ["97", "Comments"]], ["NEW: Leaked documents reveal Exxon's secret projections for higher carbon emissions, even as other oil giants cut back.", "628", ["96", "Comments"]], ["Pelosi and Mnuchin engaged in another round of virus stimulus talks Monday with no sign they are close to deal.", "245", ["57", "Comments"]], ["A $5, 15-minute Covid test is on the horizon.", "94", ["15", "Comments"]], ["Millions of people will live with coronavirus’s effects long after the pandemic subsides.", "142", ["82", "Comments"]], ["BREAKING: Trump says on Twitter he will be leaving the hospital Monday evening, and will continue his treatment for Covid-19 from the White House. He was admitted to Walter Reed hospital on Friday.", "531", ["236", "Comments"]], ["BREAKING: The CDC says coronavirus can spread indoors in air beyond 6 feet. The agency last month posted and then removed a guideline on airborne transmission, which it later described as a draft posted in error.", "2.4K", ["510", "Comments"]], ["Trump has repeatedly said that a coronavirus vaccine will be widely available faster than top government scientists say is likely.", "133", ["20", "Comments"]], ["The World Health Organization says 10% of the global population might have contracted Covid-19.", "146", ["67", "Comments"]], ["The pandemic hasn't dented our obsession with growth.", "51", ["1", "Comment"]], ["Trump's fundraiser \"borders on reckless,\" says New Jersey's Governor.", "133", ["22", "Comments"]], ["BREAKING: White House Press Secretary Kayleigh McEnany says she has tested positive for Covid-19, days after Trump's diagnosis.", "1.1K", ["245", "Comments"]], ["Trump's illness might've generated some sympathetic coverage. Falsehoods from the White House have made that impossible.", "208", ["82", "Comments"]], ["The narrow margin for confirming Judge Amy Coney Barrett would evaporate if just three GOP lawmakers are unable to vote.", "1.7K", ["74", "Comments"]], ["Have $10,000 to invest right now? Five experts share their best ideas for this tough market.", "437", ["12", "Comments"]], ["Joe Biden is now leading Donald Trump by 14 points in a national poll.", "1.6K", ["412", "Comments"]], ["Stocks are climbing as investors track President Donald Trump's recovery and look for signs of further economic stimulus. Follow our live coverage from 9-10a ET.", "428", ["66", "Comments"]], ["Conflicting accounts from his doctors raise doubts about how soon he’ll be able resume his re-election campaign.", "94", ["132", "Comments"]], ["Hundreds of people—some masked, many not—came into contact with Trump in the week leading up to his positive Covid test.", "403", ["112", "Comments"]], ["Donald Trump’s condition remains clouded by confusion over his treatment for Covid-19, with the president’s effort to show strength contradicted by conflicting accounts from his doctors. He made a surprise outing from Walter Reed National Military Medical Center on Sunday, waving to supporters gathered outside from his motorcade. https://bloom.bg/3nkHYZi", "224", ["107", "Comments"]], ["Public Health England blamed a “technical issue” for the omission.", "80", ["7", "Comments"]], ["Britain faces a shock to its job market not seen since the 1980s.", "103", ["6", "Comments"]], ["Von der Leyen said she had come into contact with a person who tested positive for coronavirus.", "145", ["12", "Comments"]], ["Cineworld said it will temporarily shut all of its American and British movie theaters as the pandemic delays winter blockbusters.", "137", ["3", "Comments"]], ["Singapore is encouraging people to have babies during the pandemic with one-off payments, on top of the nation's existing baby bonus.", "228", ["18", "Comments"]], ["The pandemic exposed the cracks that were already appearing.", "61", ["14", "Comments"]], ["Preparations for vaccinating the planet’s 7.8 billion people are already underway.", "31", ["2", "Comments"]], ["The president's diagnosis suggests Covid-19 is far from being tamed.", "318", ["59", "Comments"]], ["White House physician discloses for the first time that the president was given supplemental oxygen and has received a medication that’s typically used in more severe Covid-19 patients, raising questions about his condition.", "180", ["107", "Comments"]], ["\"The meeting was at full capacity throughout the 2 hours and 30 minutes.\" This couple in Mumbai took their traditional wedding celebration online as India remains in lockdown as the #coronavirus outbreak rages on. More via Bloomberg: https://bloom.bg/2VULgpe #IndiaFightsCOVID19", "59", ["9", "Comments"]], ["Duterte has maintained majority approval and trust ratings amid Southeast Asia’s worst coronavirus outbreak, according to a pollster.", "381", ["42", "Comments"]], ["Trump’s triumphant ceremony for SCOTUS nominee Amy Coney Barrett has turned into a public health nightmare. Here's a look at the attendees who later tested positive for Covid-19 👇 More:https://bit.ly/33srCpm", "197", ["85", "Comments"]], ["Ireland’s top court has ruled Subway's signature bread is too sweet to be considered bread.", "222", ["104", "Comments"]], ["Free rent until... 2021? It's actually happening.", "117", ["5", "Comments"]], ["Almost everyone except founder Masayoshi Son opposes it, sources say.", "3.6K", ["12", "Comments"]], ["The trial comes at a time when coronavirus cases are rising in the U.K and globally and travel restrictions abound.", "60", ["2", "Comments"]], ["Weakness offers chance to reposition for recovery.", "44", ["1", "Comments"]], ["This is why you can't fight distraction. https://trib.al/e1R9QdJ", "124", ["8", "Comments"]], ["LATEST: Joe Biden tested negative for the coronavirus, marking the second time he has been screened and cleared in three days.", "2.8K", ["237", "Comments"]], ["The Patriots will play the Chiefs on Monday night in a game that was rescheduled from Sunday following positive Covid-19 tests from both teams.", "22", ["3", "Comments"]], ["Google is expected to be hit with the biggest U.S. antitrust suit since Microsoft. Here's how the search giant plans on fighting it.", "378", ["3", "Comments"]], ["Donald Trump's physician admitted to giving a misleading statement about the president receiving oxygen, the latest in a series of contradictory and confusing accounts about his coronavirus infection.", "280", ["94", "Comments"]], ["BREAKING: President Trump briefly left his hospital in a car to wave to supporters gathered outside.", "3.5K", ["1.2K", "Comments"]], ["It's lights out for bars in the City of Lights.", "734", ["62", "Comments"]], ["To understand the dynamics of 2020, look at the election of 1920.", "190", ["79", "Comments"]], ["Dexamethasone. Remdesivir. Regeneron's antibody cocktail. The president is getting almost every medication available to help him fight off the new coronavirus. That might not be a good thing.", "410", ["219", "Comments"]], ["Minority Leader Chuck Schumer said it won’t be safe for the Senate to move ahead with Supreme Court hearings for Amy Coney Barrett given the virus outbreak that has sickened three Republican senators.", "983", ["251", "Comments"]], ["LATEST: Get ready for a wild start to trading.", "306", ["43", "Comments"]], ["New to the stock market?  📈 Seasoned investors share 6 big mistakes amateur traders tend to make (and how to avoid them). http://bloom.bg/34cKSrF", "137", ["9", "Comments"]], ["He was 81.", "343", ["20", "Comments"]], ["What is dexamethasone?", "384", ["247", "Comments"]], ["Far-right National Rally Leader Marine Le Pen would take one of the top spots in the first round of voting if presidential elections were held this Sunday", "202", ["85", "Comments"]], ["JUST IN: New York City is closing schools and businesses in parts of Brooklyn and Queens in an effort to stop a second wave of the coronavirus.", "1.9K", ["319", "Comments"]], ["California has burned more in 2020 than in the last three years combined.", "589", ["39", "Comments"]], ["Trump has nominated Amy Coney Barrett for a seat on the Supreme Court to replace Justice Ruth Bader Ginsburg. Here is how the process will work ▶️ https://bloom.bg/2EJttwx", "42", ["10", "Comments"]], ["LATEST: President Trump is continuing his 5-day course of Remdesivir. His doctor said he had a high fever and oxygen saturation below 94 on Friday.", "1.8K", ["510", "Comments"]], ["Biden led Trump 53% to 39% in a national Wall Street Journal/NBC News poll, his highest margin of the presidential campaign.", "3.1K", ["495", "Comments"]], ["It may be dangerous.", "44", ["7", "Comments"]], ["The secretive big data firm’s direct listing left some shareholders wondering whether it was really ready to go public.", "33", ["7", "Comments"]], ["Here's the list.", "96", ["29", "Comments"]], ["French President Emmanuel Macron and far-right politician Marine Le Pen are neck and neck in the latest poll.", "330", ["84", "Comments"]], ["Trump routinely ignored mask and distancing recommendations. Now he's contracted the virus.", "581", ["305", "Comments"]], ["Face masks are a powerful tool of prevention: One study has shown that if everyone wears masks that are only 75% effective, then the number of people infected by each coronavirus carrier will shrink fourfold.", "675", ["303", "Comments"]], ["“He asked me, ‘Are you ready for this marriage or someone is forcing you?’” Netflix’s #IndianMatchmaking has sparked global debate over India’s arranged marriages and other wedding practices. Here's what these couples think. https://trib.al/iksnc7Y", "71", ["16", "Comments"]], ["Cineworld is drawing up plans to indefinitely close all of its sites in the U.K. and U.S., according to reports.", "77", ["11", "Comments"]], ["The surge in Covid-19 infections since September has forced Johnson to clamp down on the hospitality sector.", "178", ["19", "Comments"]], ["They've been trying to entice workers to leave voluntarily, so far.", "755", ["6", "Comments"]], ["Muslim travelers from outside Saudi Arabia could be allowed to perform the umrah pilgrimage as early as Nov. 1,", "122", ["7", "Comments"]], ["Spain is overtaking Italy as the euro's problem child.", "204", ["22", "Comments"]], ["He skirted the crisis the same way he always does.", "2.9K", ["31", "Comments"]], ["The parliament in this country has for years allegedly served as a backdrop for misogynistic conduct including everything from rape to sexual intimidation of female interns by male lawmakers.", "138", ["13", "Comments"]], ["He has ambitious plans for the country.", "85", ["3", "Comments"]], ["Labour peer Alf Dubs, who arrived in the U.K. as a child refugee from the Nazis, warned on Thursday that the plans were “ridiculous” and would “stir up tensions in the community.”", "39", ["2", "Comments"]], ["The global economy is entering the final quarter of its worst year in living memory.", "26", ["4", "Comments"]], ["The Dubai-Istanbul journey ranks among Emirates’ busier routes. But it's still not back.", "1.5K", ["6", "Comments"]], ["Australia's government is set to use its budget to unveil a massive surge in spending to restart the economy.", "84", ["2", "Comments"]], ["A former Chinese government official decided what content should be allowed on TikTok, the Financial Times reported.", "51", ["2", "Comments"]], ["The president’s campaign launched “Operation MAGA” to send out surrogates who would attest to his vitality and keep his voter base motivated until Trump recovers enough to resume campaigning in person.", "207", ["30", "Comments"]], ["A personal attendant to President Donald Trump has tested positive for coronavirus infection, sources say.", "510", ["121", "Comments"]], ["There have been concerns about the lack of transparency about Donald Trump's condition and he remains hospitalized at Walter Reed National Military Medical Center.", "1.1K", ["274", "Comments"]], ["It's his first outing since February.", "69", ["3", "Comments"]], ["Here is a list of Covid-19 test results for U.S. government officials and others within the political circle.", "117", ["34", "Comments"]], ["JUST IN: Donald Trump \"remains fever-free and off supplemental oxygen,\" but he's \"not yet out of the woods,\" according to his White House physician.", "481", ["224", "Comments"]], ["\"When I heard that President Donald Trump had been infected with the coronavirus, one of the first things I did was send a text to my sister-in-law. I wanted to know if the news had changed her mind about wearing masks,\" Joe Nocera writes.", "138", ["56", "Comments"]], ["Delta’s policy says customers who know they were exposed to the virus in the past 14 days cannot travel on the company's aircraft.", "905", ["136", "Comments"]], ["\"It's really a disservice to the American people.\" After the first presidential debate between Trump and Biden tumbled into a shouting match, two voters responded to the chaos. https://bloom.bg/2SihQQj", "83", ["70", "Comments"]], ["Nancy Pelosi said Friday that negotiations with the White House will press ahead.", "196", ["41", "Comments"]], ["A good college degree shouldn't be this painful.", "73", ["23", "Comments"]], ["What happens if Trump's condition worsens significantly?", "165", ["111", "Comments"]], ["For the mayor of the first major U.S. city to impose a lockdown to curb the spread of Covid-19, President Trump’s positive test results serve as a “wake up call” as she faces increasing pressure to reopen.", "106", ["22", "Comments"]], ["After two failed launches and a bankruptcy, the XFL is going to try again under new owner Dwayne “The Rock” Johnson.", "23", ["2", "Comments"]], ["How five small businesses survived Covid and found a new way to make money.", "24", ["3", "Comments"]], ["New York City restaurants are banking on outdoor dining to survive the winter, but the heat lamps that would help make that happen are almost impossible to get a hold of.", "77", ["18", "Comments"]], ["Cam Newton has tested positive for Covid-19.", "53", ["11", "Comments"]], ["These Buddhist nuns: ✔️ Teach young girls self-defense ✔️ Reached victims of the Nepal 2015 earthquake when others couldn't ✔️ Are solar panel technicians to promote green energy... And it all started with kung fu. See More", "261", ["22", "Comments"]], ["WATCH: Trump’s doctor says he is \"cautiously optimistic\" with the president’s progress against Covid-19. That assessment was almost immediately contradicted by a person familiar with the matter, who said Trump’s vital signs were very concerning over the last 24 hours.  Dr. Conley also created confusion by putting the timeline of the president's diagnosis at 72 hours — which would be longer than publicly announced. Read the latest: https://trib.al/6hmNBRV", "191", ["77", "Comments"]], ["A crash course on what happens when the President can't govern from someone who was in the Justice Department when Reagan was shot.", "65", ["86", "Comments"]], ["JUST IN: Trump’s vital signs over the last 24 hours were very concerning and he isn’t on a clear path to a full recovery yet, according to a person familiar with the matter.", "868", ["376", "Comments"]], ["Keurig is betting there’s a market for a Wi-Fi-enabled machine.", "23", ["7", "Comments"]], ["The first presidential debate between Joe Biden and Donald Trump was anything but predictable.  The candidates traded insults and interrupted each other throughout the night while debating the Covid-19 pandemic and race in America.  Here's what you missed. ▶️ https://bloom.bg/3l0eI8c", "133", ["36", "Comments"]], ["BREAKING: President Trump's doctor said he hasn't had a fever for 24 hours and isn't on oxygen today.", "5.6K", ["926", "Comments"]], ["Check out some our best stories of the week.", "83", ["21", "Comments"]], ["Virus positivity rates in some Orthodox communities have jumped to almost 30%.", "100", ["15", "Comments"]], ["“If masks work, then why are the positive cases rising everywhere?”", "494", ["315", "Comments"]], ["Traders were already bracing for market chaos — then Donald Trump tested positive..", "28", ["5", "Comments"]], ["“It’s colorful, it’s different, I don’t think anybody on Wall Street had ever seen somebody like myself,” he said.", "89", ["26", "Comments"]], ["While Joe Biden spent the first months of the pandemic campaigning from his home, drawing derision from Donald Trump for “hiding in his basement,” Trump is now the one locked down.", "3.7K", ["326", "Comments"]], ["American presidents have a checkered history with truth and disclosure about their health.", "75", ["28", "Comments"]], ["Dior just had a fashion show in front of a live audience in Paris, the first since the pandemic. Angelina Rascouët explains the new normal of the fashion industry. https://bloom.bg/2SfTSoS", "63", ["6", "Comments"]], ["Inside the White House and his campaign, some aides are despondent and fear the election is lost and the president is sicker than is known.", "1.4K", ["699", "Comments"]], ["That Donald Trump, who is wary of doctors, agreed to go to a U.S. military hospital is a sign of concern about his condition, sources say.", "1.9K", ["320", "Comments"]], ["It's a seller's market.", "87", ["3", "Comments"]], ["Could drones be the answer to saving animals in disaster zones?", "34", ["2", "Comments"]], ["Investors just got a big reminder that \"the virus takes priority over everything else that’s going on in the market\".", "38", ["4", "Comments"]], ["Forget about Amazon.", "73", ["3", "Comments"]], ["That's half the population.", "185", ["17", "Comments"]], ["So far, it was a milestone reached only by the U.S. and Brazil.", "124", ["15", "Comments"]], ["“Every new year of normal-thinking graduates is a threat to the authorities.”", "96", ["6", "Comments"]], ["To find out how a Universal Basic Income would work, German boffins want to study “statistical twins.”", "124", ["102", "Comments"]], ["“Our message is to vote early and vote local because it’s more convenient and minimizes election day queues, which lessens the risk of Covid-19,” Ardern said.", "94", ["6", "Comments"]], ["Firefighters may get a reprieve from the weather Saturday as red flag warnings of extreme fire danger expire. But the state is still poised to reach a grim milestone: 4 million acres burned this year by wildfires.", "57", ["8", "Comments"]], ["“The battle with Covid-19 has only just begun.”", "211", ["41", "Comments"]], ["He's the latest associate of the president to become infected with the disease.", "1.1K", ["259", "Comments"]], ["The initial plan was to have them sit seven feet apart.", "787", ["168", "Comments"]], ["BREAKING: President Donald Trump is being treated with antiviral drug Remdesivir  at a U.S. military hospital near Washington.", "437", ["208", "Comments"]], ["The $2.2 trillion coronavirus relief package just passed by the House includes a complete ban on eviction and foreclosure filings for 12 months.", "411", ["78", "Comments"]], ["BREAKING: Former Trump campaign manager Kellyanne Conway tested positive for Covid-19 and is experiencing mild symptoms.", "1K", ["188", "Comments"]], ["The vast majority of people with Covid-19 don’t need to be hospitalized, and those who do go to the hospital have a reason to be there, an infectious disease specialist said.", "429", ["232", "Comments"]], ["Donald Trump’s illness came after he had frequently mocked mask-wearers and tried to undermine state and local rules meant to stem the pandemic.", "230", ["217", "Comments"]], ["A CEO who gave $100,000 to Trump’s re-election effort in June criticized the president's behavior after he knew a close aide tested positive.", "644", ["73", "Comments"]], ["The robot could help the world.", "257", ["27", "Comments"]], ["Your crash course on the 25th Amendment and why everyone is talking about it.", "77", ["9", "Comments"]], ["Brazil, the U.K. and America are led by politicians who first belittled the coronavirus, but were then infected by it.", "3.8K", ["603", "Comments"]], ["This may batter the political system, but it won't break it.", "77", ["28", "Comments"]], ["Pelosi and McConnell are under new pressure to institute a testing regimen to keep the coronavirus from overrunning the Capitol.", "163", ["48", "Comments"]], ["News that President Donald Trump tested positive for Covid-19 has thrown investor fear into overdrive.", "44", ["39", "Comments"]], ["The Democratic nominee needs to show voters he’s still got his negotiating skills.", "192", ["99", "Comments"]], ["BREAKING: President Trump will go to Walter Reed hospital to be treated for Covid-19 out of an \"abundance of caution.\"", "1.1K", ["349", "Comments"]], ["At least three people have tested positive after attending the White House ceremony where Barrett’s nomination was announced.", "213", ["108", "Comments"]], ["Trump's Covid-19 case will be the world's most closely-watched.", "210", ["85", "Comments"]], ["Here's how doctors would treat a 74-year-old man who has Covid-19.", "100", ["24", "Comments"]], ["A controversial $300 million ad campaign about the coronavirus will face a “strategic review.”", "30", ["6", "Comments"]], ["President Trump's positive Covid-19 diagnosis changes everything from the election to stimulus. Here's what you need to know.", "396", ["168", "Comments"]], ["Consider this a crash course in the 25th Amendment.", "241", ["276", "Comments"]], ["BREAKING: Joe Biden and his wife have tested negative for Covid-19 after being exposed to President Donald Trump at the debate on Tuesday.", "4.2K", ["553", "Comments"]], ["Donald Trump has tested positive with coronavirus.  Health editor Drew Armstrong and political reporter Ryan Beckwith weigh in on what it means for the election, the economy and the country.  Follow our live coverage here: https://bloom.bg/3jvsSxS", "286", ["189", "Comments"]], ["Trump's coronavirus diagnosis threw even more chaos into an already frenetic election year with a month to go until the election.", "287", ["67", "Comments"]], ["The president has coronavirus. The White House must be transparent now.", "181", ["122", "Comments"]], ["BREAKING: Trump learned on Thursday morning that his aide Hope Hicks tested positive for coronavirus, yet continued on with a full schedule of events, including a fundraiser at his New Jersey resort.", "593", ["108", "Comments"]], ["“I don’t wear masks like him,” Trump said Tuesday. “Every time you see him, he’s got a mask.” Here's what Trump and Biden said about masks during #Debate2020. More via Bloomberg Politics trib.al/a9Kqwv8", "1.8K", ["258", "Comments"]], ["BREAKING: Donald Trump is experiencing \"mild\" symptoms of coronavirus after testing positive for Covid-19, AP reports", "1.2K", ["393", "Comments"]], ["NEW: Houston’s response to the coronavirus pandemic was to ignore it. It didn’t work.", "268", ["67", "Comments"]], ["BREAKING: In the last jobs report before the election, the U.S. adds fewer jobs than estimated and the unemployment rate falls to 7.9%.", "368", ["145", "Comments"]], ["After Trump's Covid-19 diagnosis, Joe Biden will need to decide whether to quarantine after sharing a debate stage with the president.", "170", ["68", "Comments"]], ["BREAKING: President Trump interacted and traveled with many top aides and advisers in the days before he was diagnosed with Covid-19.", "1.3K", ["392", "Comments"]], ["Trump has tested positive for Covid-19. So what happens next?  Here are some scenarios. https://trib.al/B98OcXf", "372", ["237", "Comments"]], ["BREAKING: President Donald Trump now faces an unprecedented health challenge and staffing chaos a month before Election Day.", "1K", ["324", "Comments"]], ["Public health officials have a message for Londoners: Act now, or surging cases and new restrictions will follow.", "49", ["8", "Comments"]], ["The outcome could determine whether the continent’s most developed nation prospers or fails.", "52", ["6", "Comments"]], ["Markets are already vulnerable to jitters in the month before an election, without the president contracting a deadly disease.", "43", ["17", "Comments"]], ["President Donald Trump announced that he and first lady Melania Trump tested positive for Covid-19. What does that mean for the U.S. and the November election? https://bloom.bg/36s3yFk", "75", ["49", "Comments"]], ["ANALYSIS: Covid-19 has been especially risky for men, the elderly and those who are overweight, raising the danger level for Donald Trump.", "1.5K", ["515", "Comments"]], ["BREAKING: Boris Johnson will hold talks with the EU's Ursula von der Leyen on Saturday, the U.K. prime minister's first intervention in the Brexit negotiations since June.", "80", ["6", "Comments"]], ["Putin declared victory in the race for a Covid-19 vaccine. Here’s why Western scientists doubt he has won.", "227", ["29", "Comments"]], ["LIVE: The latest news and analysis from Bloomberg TV, as Donald Trump announces he and First Lady Melanie Trump have tested positive for Covid-19. More: trib.al/OYZ22XY", "1.2K", ["351", "Comments"]], ["U.S. and European equity futures fell with Asian stocks, and the dollar climbed, after Trump announced his positive test.", "721", ["197", "Comments"]], ["In May, we asked what would happen in this worrisome situation. Now it's here.", "490", ["236", "Comments"]], ["BREAKING: Donald Trump and First Lady Melania Trump test positive for Covid-19, the president says in a tweet.", "4.5K", ["1K", "Comments"]], ["Indonesia revises rule banning foreigners from entering the country, as it discusses opening a travel corridor for essential business purposes from Singapore.", "73", ["3", "Comments"]], ["If Covid-19 infects the president, it could trigger a handoff of power — or constitutional chaos. Read our story from May 2020:", "462", ["129", "Comments"]], ["New Zealanders will be able to visit parts of Australia without having to undergo quarantine from Oct. 16.", "666", ["31", "Comments"]], ["Kim Yo Jong's absence had fueled speculation her power was clipped after she led a contentious pressure campaign against South Korea.", "164", ["10", "Comments"]], ["Trump condemns Proud Boys, a militant group that supports him, after declining to directly condemn white supremacists during Tuesday’s presidential debate.", "620", ["365", "Comments"]], ["BREAKING: President Donald Trump says that he and the First Lady will begin quarantine after aide Hope Hicks tests positive for the novel coronavirus.", "2.8K", ["742", "Comments"]], ["Twitter’s former CEO, Dick Costolo, criticized Coinbase's move, saying “me-first capitalists who think you can separate society from business are going to be the first people lined up against the wall and shot in the revolution.”", "38", ["15", "Comments"]], ["Singapore ruling party’s credibility rating dropped “across the board” among categories of voters.", "38", ["10", "Comments"]], ["California is set to issue guidelines for reopening theme parks, but Disney and other rivals are already pushing back.", "152", ["2", "Comments"]], ["Richard Branson’s blank-check company expands initial public offering to raise $480 Million.", "947", ["11", "Comments"]], ["BREAKING: The U.S. House passes a $2.2 trillion fiscal stimulus package despite no Republican support. Sharp differences remain on the scale of coronavirus relief.", "1.4K", ["494", "Comments"]], ["BREAKING: Hope Hicks, one of President Donald Trump’s closest aides, has tested positive for the coronavirus, sources say. Trump later told Fox News that he and First Lady Melania Trump have recently been tested and are awaiting results.", "2K", ["488", "Comments"]], ["LIVE: Tokyo stocks resume trading after worst-ever outage in market's history https://trib.al/rWY0MUa", "531", ["45", "Comments"]], ["The Trump administration was blocked by a judge from restricting H-1B visas.", "1K", ["115", "Comments"]], ["Many Americans will celebrate Halloween this year sitting at home, chowing down on candy.", "45", ["12", "Comments"]], ["JUST IN: Amazon says almost 20,000 employees have tested positive for Covid-19 during the pandemic.", "284", ["72", "Comments"]], ["The $1 billion was set aside by Congress in April. Most of it remains unused.", "79", ["8", "Comments"]], ["Ireland’s Supreme Court has ruled that bread sold by the fast food chain Subway contains so much sugar that it cannot be legally defined as bread.", "3.6K", ["420", "Comments"]], ["Being Black in America looks looks like a pre-existing condition that puts a person at risk for a host of problems.", "114", ["75", "Comments"]], ["Supreme Court nominee Amy Coney Barrett's name appears on a 2006 newspaper ad blasting Roe v. Wade.", "275", ["151", "Comments"]], ["NEW: Meet the next generation of personal finance experts.", "57", ["8", "Comments"]], ["Trump: “Why would I allow the Debate Commission to change the rules for the second and third Debates when I easily won last time?”", "2.1K", ["772", "Comments"]], ["“You can’t keep thinking when this is over, we get back to life. This is our life.”", "45", ["9", "Comments"]], ["New York state reported more than 1,300 new cases of coronavirus, the most since May.", "194", ["46", "Comments"]], ["How to make offices worth the rent? Businesses need to get creative.", "40", ["4", "Comments"]], ["NEW: Rapid Covid testing is how America can get something like its life back, even without a vaccine.", "249", ["19", "Comments"]], ["Free rent until... 2021? It's actually happening.", "1.1K", ["259", "Comments"]], ["A biotechnology startup called Koniku is trying to develop robots that could sniff out Covid-19 infections faster than conventional testing.", "121", ["8", "Comments"]], ["The Verizon deal expires just in time for the new season of The Mandalorian.", "77", ["7", "Comments"]], ["Trump’s taxes give Biden the perfect blueprint.", "442", ["127", "Comments"]], ["NEW: No kids. No mortgage. No going to the office. It's the perfect formula for young Americans to take epic road trips.", "1.1K", ["137", "Comments"]], ["LATEST: Quibi either needs a whole bunch of subscribers fast, or billions to meet a funding shortfall.", "38", ["10", "Comments"]], ["“Is there an October surprise? There better be, because this is headed off the cliff for him.”", "1.2K", ["85", "Comments"]], ["Stocks are higher amid signs of progress in Washington toward a fresh fiscal stimulus package. Follow our live coverage from 9-10a ET.", "282", ["38", "Comments"]], ["Some call it the democratization of investing. Some call it dangerous.", "161", ["17", "Comments"]], ["Democrats have already flipped two House seats in Iowa. Now they have the chance to take a Senate seat.", "236", ["7", "Comments"]], ["Washington to Chinese companies: Open your books.", "101", ["13", "Comments"]], ["Donald Trump claimed that he’s unfamiliar with the Proud Boys, a right-wing vigilante group he advised to “stand back and stand by” during Tuesday’s debate, and said they should step aside to let police regulate protests. https://bloom.bg/3jkUXaZ", "174", ["115", "Comments"]], ["It's become the most expensive event to hedge against ever.", "51", ["12", "Comments"]], ["The Russians have managed to damage the credibility of the very agency that is supposed to protect against foreign interference in U.S. elections.", "138", ["29", "Comments"]], ["Consumers have gotten used to cheap at-home delivery — and they aren't willing to give it up.", "61", ["13", "Comments"]], ["BREAKING: The European Commission will send a “letter of formal notice” to the U.K. for breaching the terms of the Withdrawal Agreement.", "814", ["92", "Comments"]], ["UPDATE: Police and protesters clashed during a holiday marking China's founding anniversary.", "87", ["8", "Comments"]], ["The exchange's bespoke computer system is in the spotlight.", "104", ["2", "Comments"]], ["Recession proof.", "54", ["7", "Comments"]], ["And more are likely to follow in coming weeks, according to EY.", "222", ["59", "Comments"]], ["Yevgeniy Nikulin stole the logins of 117 million LinkedIn users in one of the largest data breaches in U.S. history.", "55", ["10", "Comments"]], ["BREAKING: President Trump signs a stopgap funding bill to avert a U.S. government shutdown and keep operations running until Dec. 11.", "296", ["39", "Comments"]], ["There are signs that U.K. restrictions may be helping slow the spread of Covid-19, according to a major study.", "75", ["7", "Comments"]], ["Super-spreaders drove India’s explosive Covid-19 outbreak, a study found. Two-thirds of the country’s infections can be traced back to 8% of cases.", "99", ["13", "Comments"]], ["The risk of Chinese-style state surveillance is likely to rise across Asia if countries continue to use tracking technology even after the pandemic recedes.", "53", ["3", "Comments"]], ["Australia home prices fall for a fifth month, as declines in Sydney and Melbourne outweigh a nascent recovery in the rest of the country.", "34", ["9", "Comments"]], ["Brad Parscale has stepped aside from his role in the Trump campaign days after he was detained at his Florida home and taken to a hospital.", "112", ["29", "Comments"]], ["American Airlines and United Airlines to move ahead with job cuts adding pressure on Mnuchin and Pelosi as they haggle over the Democrats’ proposed $2.2 trillion stimulus package.", "1.8K", ["36", "Comments"]], ["After noticing hundreds of employees had received government funds in their accounts, JPMorgan began scrutinizing director-level employees and workers who received certain amounts, sources say.", "141", ["8", "Comments"]], ["Goodbye surplus.", "22", ["3", "Comments"]], ["The probe comes after the U.S. Departments of Commerce and Treasury determined Vietnam had manipulated its currency in a specific trade case involving tires, sources say.", "88", ["9", "Comments"]], ["Trump declares national emergency in the mining industry and moves to expand domestic production of rare earth minerals.", "515", ["199", "Comments"]], ["UPDATE: Trading has been scrapped for an entire day due to a hardware breakdown, in the worst glitch in the market's history.", "404", ["5", "Comments"]], ["Mail-in ballots have been used widely in Republican-leaning Montana for two decades.", "422", ["81", "Comments"]], ["Undocumented workers need Covid-19 relief, too.", "207", ["97", "Comments"]], ["Members of the extremist group are welcoming the presidential attention.", "125", ["155", "Comments"]], ["Russia’s military is now more capable than at any time since the end of the Cold War, according to a new report.", "488", ["193", "Comments"]], ["Cases continue to climb again in New York City, with hot spots in Brooklyn and Queen catching officials' attention.", "129", ["6", "Comments"]], ["Closing schools has been a disaster for the kids, and hasn't slowed the spread of Covid-19", "31", ["8", "Comments"]], ["“For most restaurants, it’s not month to month, it’s week to week.”", "33", ["19", "Comments"]], ["Covid-19 cases are surging in Wisconsin just as Trump prepares to hold rallies this weekend.", "265", ["39", "Comments"]], ["Trump claimed today that he's unfamiliar with the Proud Boys, a right-wing vigilante group he advised to \"stand back and stand by\" during Tuesday’s debate", "701", ["317", "Comments"]], ["California wants high school students to learn more about the dark side of U.S. history. Good! But there's a better way to do it.", "48", ["10", "Comments"]], ["\"Perhaps folks think their stocks and 401(k)s will do better with higher taxes and increased regulation than with nastiness and scorched earth.\"", "861", ["126", "Comments"]], ["BREAKING: Following the chaos on Tuesday night, the presidential debate commission says it will change the format between Trump and Biden \"to ensure a more orderly discussion of the issues\" at future events", "1.6K", ["425", "Comments"]], ["NEW: Forecasters say Biden has a 78% chance of winning the presidency. They raised his chances 3 percentage points a day after the tumultuous debate.", "6.8K", ["1.6K", "Comments"]], ["NEW: Draw a map of Chicago and shade the areas with more poverty, pollution and coronavirus. It will start to look like being Black is a pre-existing condition.", "102", ["18", "Comments"]], ["The spread of Covid-19 on a Qantas flight in March showed people in window seats in the middle of the economy cabin had the greatest risk of contracting the virus, according to genome sequencing analysis of infected passengers.", "49", ["8", "Comments"]], ["Some mid-sized U.S. cities that missed out on the first wave of pandemic relief are now watching their chances of aid fade.", "29", ["7", "Comments"]], ["\"If we had a panic button, we'd be hitting it.\"", "44", ["10", "Comments"]], ["The pandemic has disproportionately impacted women.", "84", ["25", "Comments"]], ["Farm jobs are ideal for creating an \"Instagram moment,\" according to Australia's deputy prime minister.", "47", ["10", "Comments"]], ["If the fist debate is any indication, Trump seems determined to bulldoze his way through Election Day.", "136", ["177", "Comments"]], ["Stocks are fluctuating after an acrimonious American presidential debate highlighted the risk of a contested vote in November. Follow our live coverage from 9-10a ET.", "702", ["217", "Comments"]], ["Any vaccine authorization will require “clear and compelling” evidence of efficacy, says the head of the FDA's biologics office.", "65", ["2", "Comments"]], ["The airlines can each borrow as much as $7.5 billion.", "104", ["3", "Comments"]], ["The first encounter between Joe Biden and Donald Trump didn't change anything, except to diminish the country’s dignity a little further.", "492", ["229", "Comments"]], ["BREAKING: Tennis star Serena Williams ended her latest bid for a 24th Grand Slam title, saying she is “struggling to walk.”", "154", ["16", "Comments"]], ["The rules, which would have taken effect Oct. 2, raises the price for naturalization to $1,170 from $640. Another required asylum seekers to pay $550 for an employment authorization document.", "130", ["5", "Comments"]], ["Cases are up in the U.K., but deaths have barely risen.", "75", ["3", "Comments"]], ["Members of the Proud Boys celebrated online after Trump said they should \"stand back and stand by\" during the presidential debate.", "747", ["377", "Comments"]], ["A three-year investigation found hidden weaknesses in a widely used metal alloy, with safety implications for aircraft worldwide.", "102", ["9", "Comments"]], ["Kuwait's new emir takes charge of one of the world's wealthiest countries as it faces an unprecedented financial crisis. He's 83 years old.", "234", ["5", "Comments"]], ["Trump just spent 90 minutes demonstrating how he’s not fit for the office he holds.", "5.5K", ["1.5K", "Comments"]], ["While much of the world can't travel, more than 15 million people are due to fly over the \"golden week\" holiday in China.", "198", ["171", "Comments"]], ["BREAKING: A Covid-19 test that can return results in 15 minutes has been approved for use in Europe, part of a new class of quicker screening tools to identify the virus.", "1.5K", ["52", "Comments"]], ["It may go down as one of the low points in U.S. presidential debate history.", "612", ["292", "Comments"]], ["Even once such a vaccine is on the market, it probably won’t protect everyone — as is the case with seasonal flu, he says.", "107", ["6", "Comments"]], ["LATEST: Protests and the pandemic have seen vacancies surge, rents drop and dealmaking dry up. The world's most expensive tower deal has backfired on investors.", "112", ["14", "Comments"]], ["The battleground state's election officials can accept mail-in ballots for six days after Election Day, a court ruling says.", "237", ["37", "Comments"]], ["The first presidential debate between Joe Biden and Donald Trump was anything but predictable.  The candidates traded insults and interrupted each other throughout the night while debating the Covid-19 pandemic and race in America. Here's what you missed ▶️ https://bloom.bg/3l0eI8c", "572", ["282", "Comments"]], ["Joe Biden says there is systemic racism in America, but that not every cop is a bad cop.  \"We have to have a system where people are held accountable,\" he says. The latest on the first presidential debate ▶️ https://bloom.bg/33bfCIS", "441", ["180", "Comments"]], ["The president asked: “Who would you like me to condemn?” When Biden suggested the Proud Boys, a far-right neo-fascist organization, Trump said they should “stand back and stand by.”", "464", ["229", "Comments"]], ["Chris Wallace: Are you willing to condem white supremacists and militia groups?  Trump: “I’m willing to do that. I would say almost everything I see is from the left wing, not from the right wing.” https://bloom.bg/3jfoO4p", "285", ["198", "Comments"]], ["Critics say the sexual-assault case case was fabricated to punish him for his work as a historian of Stalin-era repressions.", "47", ["1", "Comment"]], ["Before Joe Biden debated President Donald Trump, Kamala Harris kicked off a campaign fundraiser with artists.", "85", ["12", "Comments"]], ["Trump offered Judge Amy Coney Barrett the Supreme Court nomination on September 21, according to a Senate questionnaire.", "445", ["113", "Comments"]], ["“It's a day of grief and reckoning and fasting and introspection, so that makes a conversation like this have a higher emotional charge than it may otherwise.”", "14", ["2", "Comments"]], ["A long holiday won't save China’s gambling capital.", "42", ["1", "Comment"]], ["🚩 Claim: Trump predicts there will be widespread fraud, especially with mail-in ballots. 🔎Fact: Voter fraud is extremely rare. One study found it was more likely that an American would be struck by lightning than impersonate another voter. 🚩Claim: Biden says Trump would take health coverage for pre-existing conditions from 100 million Americans. 🔎Fact: If the Affordable Care Act were repealed, it would primarily impact those with pre-existing conditions who have sought covera...ge through the individual market, where Americans can purchase their own insurance. And that figure is much smaller, though difficult to gauge. We're fact-checking the first presidential debate. 👇 See More", "747", ["378", "Comments"]], ["One Apple stock right now is worth more than $100.", "2.6K", ["34", "Comments"]], ["LIVE: President Trump and Joe Biden face each other on the debate stage for the first time, sparring over Covid-19, income taxes and the Supreme Court", "136", ["97", "Comments"]], ["On September 28th, 1918, Philadelphia held the largest parade in its history. Two days later, the flu began raging uncontrolled. Exactly 102 years later, what lessons can we learn? At 1pm ET, Bloomberg Opinion editor Sarah Green Carmichael and history professor Stephen Mihm will join to discuss America’s historical struggles with illness.", "35", ["4", "Comments"]], ["WATCH: Donald Trump and Joe Biden meet for the first time in a high-stakes presidential debate. 🇺🇸 On the agenda? The economy, the Supreme Court and Covid-19. Follow our live coverage and analysis all night: https://bloom.bg/36hcFZh", "3.8K", ["14K", "Comments"]], ["Some New York City residents got return envelopes printed with the wrong names.", "86", ["17", "Comments"]], ["Microsoft says 52% of incidents between July 2019 and June 2020 are related to Russian hackers.", "364", ["27", "Comments"]], ["When Biden and Trump face off for the first time on the debate stage tonight, taxes are sure to be center stage.", "1.3K", ["108", "Comments"]], ["A antibody cocktail may help treat coronavirus patients outside of the hospital by reducing virus levels and symptoms, early study results indicate.", "100", ["7", "Comments"]], ["On the eve of the first presidential debate, the White House unveiled a $500 billion package of promises aimed at African-American voters. Details, however, were limited.", "320", ["224", "Comments"]], ["JUST IN: Disney is laying off 28,000 workers across its U.S. theme parks, cruise ships and retail businesses.", "1K", ["79", "Comments"]], ["Trump's tax returns shed new light on how his investments raise conflict of interest concerns abroad.", "858", ["341", "Comments"]], ["Is Amy Coney Barrett a threat to Obamacare? Only in Democratic fever dreams.", "118", ["42", "Comments"]], ["Whole Foods CEO: “We love most things about Amazon, and they probably love most things about Whole Foods. But, you know, not everything.”", "46", ["7", "Comments"]], ["In a slap at New York Mayor Bill de Blasio’s handling of basic city services, Governor Andrew Cuomo on Tuesday suggested a solution: soldiers.", "597", ["107", "Comments"]], ["How does a billionaire pay next to nothing in federal income taxes? The simple answer is by losing money.", "232", ["213", "Comments"]], ["“Carbon neutral” and “climate neutral” don’t mean what you think they mean.", "66", ["13", "Comments"]], ["Trump has nominated Amy Coney Barrett for a seat on the Supreme Court to replace Justice Ruth Bader Ginsburg. Here is how the process will work ▶️ https://bloom.bg/2EJttwx", "33", ["7", "Comments"]], ["Biden paid $299,346 in income taxes in 2019.", "3.7K", ["1.2K", "Comments"]], ["A bruising Senate confirmation fight may seal the fates of several incumbent senators in the November election.", "53", ["25", "Comments"]], ["Judge Amy Coney Barrett began making a round of meetings with Republican senators, a vital initial step in the confirmation process that Trump wants wrapped up before Election Day.", "199", ["34", "Comments"]], ["Rejoining the Paris Agreement is easy. For Biden, the hard part will be making good on one of the most ambitious climate goals in the world.", "601", ["108", "Comments"]], ["Mass airline layoffs in swing states are looming, and they’d be more bad news for Trump.", "115", ["26", "Comments"]], ["BREAKING: New York City’s daily rate of positive tests is more than 3% for the first time in months, Mayor Bill de Blasio said.", "938", ["22", "Comments"]], ["NEW: JPMorgan will pay a record $920 million fine and admit wrongdoing.", "1.1K", ["57", "Comments"]], ["The Covid-19 pandemic has battered NYC businesses, with almost 6,000 closures and a jump of about 40% in bankruptcy filings across the region", "338", ["107", "Comments"]], ["The coronavirus pandemic is wreaking havoc on the market’s tried-and-tested barometers for the business cycle.", "58", ["7", "Comments"]], ["Stimulus talks are about to reach a fork in the road.", "144", ["71", "Comments"]], ["A bombshell New York Times report found Donald Trump paid no income taxes in 10 of the past 15 years — and only $750 in 2016 and 2017.  Here are the key takeaways. https://trib.al/yqiHKLg", "211", ["195", "Comments"]], ["Trump heads into the election on track to be the first U.S. leader since World War II to oversee a net loss of jobs during a four-year term.", "1.8K", ["1K", "Comments"]], ["Even with colder weather and shorter days, it’s still possible to plan for pandemic-safe outdoor fun.", "38", ["6", "Comments"]], ["The system, called \"Amazon One,\" could be used to gain entry or make payments just by hovering your hand over a scanner.", "357", ["15", "Comments"]], ["The Supreme Court and the pandemic will be joined by another potentially explosive question — whether Trump ducked paying his taxes.", "158", ["81", "Comments"]], ["\"The 10pm closure of pubs and restaurants is simply making things worse, not better.\" Many, including Liverpool mayor Joe Anderson, are questioning England's coronavirus curfew. More: https://trib.al/kn4pmMB", "95", ["64", "Comments"]], ["Diners will be able to watch inflight entertainment channels during their meal for the full, on-board experience.", "185", ["10", "Comments"]], ["Sweden, which did not close its economy when Covid-19 struck, saw confidence rise to levels not seen since before the outbreak.", "199", ["28", "Comments"]], ["38 million more people are expected to be living in poverty in 2020.", "100", ["14", "Comments"]], ["The odds of a financially secure retirement are becoming ever more remote.", "64", ["4", "Comments"]], ["Nigeria is an important battleground for Netflix.", "37", ["4", "Comments"]], ["To fight megafires, European countries are letting smaller fires burn and offering subsidies to land owners and people living close to forests to manage them properly.", "44", ["9", "Comments"]], ["The latest escalation in the Azerbaijan-Armenian conflict differs from many previous skirmishes since the end of the war in 1994, both in scale and in geopolitical risk. Here's what you need to know.", "799", ["1.5K", "Comments"]], ["NEW: There could be a baby boom in the Philippines. Unintended pregnancies could spike by almost half to 2.6 million if Covid restrictions stay in place until year-end, the UN Population Fund says.", "192", ["29", "Comments"]], ["Trump used proceeds from his reality television star fame to finance a shopping spree of golf resorts, but then those lost money too.", "287", ["135", "Comments"]], ["Truck startup Hyliion’s founder, Thomas Healy, wins the SPAC lottery.", "1K", ["7", "Comments"]], ["Duterte blasts Facebook for taking down accounts supposedly linked to the military and police, and questions if it should continue operations in one of its biggest markets in Asia.", "145", ["22", "Comments"]], ["Finding it hard to navigate every twist and turn of the $90 trillion global economy? Here are 12 of the key global economic indicators to help you keep up.", "90", ["11", "Comments"]], ["A juror in the Breonna Taylor case wants transcripts and recordings of the secret proceeding to be made public so that “the truth may prevail.”", "54", ["12", "Comments"]], ["Mexico's president vowed to restore the national oil company to its former glory. Instead, Pemex is drowning in debt, its oil output is declining, and now it appears to be losing fuel market share in its own backyard.", "84", ["2", "Comments"]], ["Investors hyped up the AI company on forums like Reddit, triggering an \"astronomical\" price surge, an analyst says.", "257", ["10", "Comments"]], ["LIVE: Here's how Asia-Pacific markets are moving after banks led the S&P 500 Index to its biggest gain in 2 weeks https://trib.al/nkqjD1M", "308", ["38", "Comments"]], ["BREAKING: One million people have died from Covid-19, official data say. Estimates suggest the virus may be among the world's top 5 causes of death.", "2.4K", ["624", "Comments"]], ["The outages may be more disruptive right now because so many people are working and studying remotely.", "190", ["15", "Comments"]], ["She’s likely to enter a coalition with the Greens, forming the country’s first pure left-leaning government since 1999.", "350", ["44", "Comments"]], ["Asia’s second-largest economy holds lessons for the rest of us as the Covid-19 pandemic destroys jobs and rocks whole industries.", "68", ["7", "Comments"]], ["It's Apple vs. Fortnite.", "42", ["1", "Comments"]], ["Some Democrats won’t meet with the would-be Ginsburg replacement.", "221", ["121", "Comments"]], ["Biden's biggest focus: China.", "495", ["235", "Comments"]], ["As the seasons change, there are signs of more deaths and serious illness ahead.", "251", ["23", "Comments"]], ["Trump has $70,000 worth of write-offs for his haircuts. Now he could be liable for millions of dollars in penalties.", "1.3K", ["641", "Comments"]], ["Budgets reflect cities’ values. Places like Austin, Louisville and Fairfax County are trying new approaches to consider racial equity in spending plans", "38", ["7", "Comments"]], ["As Donald Trump spins a narrative of citizen-led chaos in cities, the story of an elite police squad that was flagrantly robbing its citizens offers a different one.", "100", ["29", "Comments"]], ["DeJoy told a judge that a court order directing the U.S. Postal Service to reinstate overtime to ensure speedy delivery of mail-in ballots could be abused by workers. The plaintiffs in the lawsuit call the concern \"almost laughable.\"", "307", ["98", "Comments"]], ["The U.S. desperately needs a plan driven by science, not politics.", "521", ["254", "Comments"]], ["America’s small businesses are more confident that they can survive the next 6-months, even if economic conditions don't improve.", "64", ["9", "Comments"]], ["Twelve crew members on a cruise ship carrying more than 900 passengers tested positive for the coronavirus.", "170", ["44", "Comments"]], ["NEW: Germany has its own Dr. Fauci—and unlike the U.S., government leaders and citizens actually listen to him.", "1.9K", ["220", "Comments"]], ["On September 28th, 1918, Philadelphia held the largest parade in its history. Two days later, the flu began raging uncontrolled. Exactly 102 years later, what lessons can we learn? At 1pm ET, Bloomberg Opinion editor Sarah Green Carmichael and history professor Stephen Mihm will join to discuss America’s historical struggles with illness.", "153", ["17", "Comments"]], ["Inside an alleged 8-year conspiracy on JPMorgan’s precious metals trading desk that could land the bank a record spoofing fine.", "290", ["34", "Comments"]], ["Think a Democratic sweep will be bad for markets? Think again.", "358", ["64", "Comments"]], ["Come for the colors, stay for the views.", "21", ["1", "Comment"]], ["On September 28th, 1918, Philadelphia held the largest parade in its history. Two days later, the flu began raging uncontrolled. Exactly 102 years later, what lessons can we learn? At 1pm ET, Bloomberg Opinion editor Sarah Green Carmichael and history professor Stephen Mihm will join to discuss America’s historical struggles with illness.", "27", ["11", "Comments"]], ["U.S. elections used to be a model of democracy for the rest of the world. International observers are no longer so sure.", "77", ["16", "Comments"]], ["That's half the size of Canada.", "206", ["6", "Comments"]], ["Trump deliberated for a month on a VP he could trust completely — and even considered Ivanka — according to a former campaign aide", "742", ["83", "Comments"]], ["\"The tax returns also show the extent to which Trump has repeatedly betrayed the interests of many of the average Americans who elected him and remain his most loyal supporters.\"", "2.9K", ["1.3K", "Comments"]], ["How might Trump’s SCOTUS nominee Amy Coney Barrett reshape the court if confirmed?  Bloomberg Politics' Greg Stohr explains how a Barrett vote could affect key issues including abortion, gun rights and Obamacare. https://bloom.bg/3kWTJmq", "84", ["30", "Comments"]], ["The billionaire paid no income taxes in 10 of the past 15 years and only $750 in 2016 and 2017, the New York Times reported.", "5.1K", ["548", "Comments"]], ["A pandemic villain becomes a hero in French wine country.", "26", ["14", "Comments"]], ["Fears are mounting over the possibility of Covid transmission through packaging.", "137", ["9", "Comments"]], ["Westminster’s bars are exempt from new coronavirus regulations and can keep serving politicians and their staff alcohol after the curfew.", "265", ["36", "Comments"]], ["Donald Trump paid just $750 in U.S. income taxes in both 2016 and 2017, according to a bombshell report in The New York Times.  He also reported losing millions of dollars from his golf courses and has hundreds of millions in debt that will come due in the next few years. Read more: https://trib.al/4IcOgd5", "1.7K", ["1.5K", "Comments"]], ["BREAKING: Uber wins another chance in its biggest European market after a London judge rules the company is “fit and proper” to operate.", "30", ["1", "Comment"]], ["Japanese stocks have finally topped the all-time high set at the peak of the 1980s bubble era, at least according to one index.", "181", ["5", "Comments"]], ["How likely are you to be exposed to the coronavirus on flights?", "214", ["32", "Comments"]], ["Germany actually listens to their Dr. Fauci.", "473", ["25", "Comments"]], ["It's the world’s second-largest tropical forest.", "104", ["2", "Comments"]], ["A mechanical-engineering graduate spent four weeks with a placard around his neck trying to hand out copies of his CV.", "88", ["22", "Comments"]], ["China has taken another step toward financial opening, offering more investment options to foreigners. Here's what market watchers make of the changes.", "74", ["39", "Comments"]], ["Ammonia can be burned in thermal power stations without releasing carbon emissions.", "742", ["40", "Comments"]], ["From an electric Mustang to flying cars: Here's a glimpse of what automakers have in store at the only major auto show of 2020.", "784", ["3", "Comments"]], ["China’s largest chipmaker sinks after the U.S. imposed export restrictions.", "321", ["18", "Comments"]], ["Virus cases spiked a day after a state election.", "246", ["9", "Comments"]], ["The company behind the world’s best-known boy group and K-Pop sensation BTS priced Its IPO at the top end of their range.", "10K", ["104", "Comments"]], ["Seven bidders will each purchase a portion of the 200-year-old gun maker that filed for bankruptcy again in July.", "156", ["14", "Comments"]], ["U.S. warns it may shut Baghdad embassy unless Iraq can halt attacks by Shiite militias that have targeted the outpost and other assets.", "96", ["9", "Comments"]], ["Who will win? 🏀", "236", ["21", "Comments"]], ["There's a wall of cash that's growing bigger.", "176", ["7", "Comments"]], ["BREAKING: Trump’s former campaign manager Brad Parscale detained by police after barricading himself in his home and threatening to harm himself https://trib.al/uyRcfKV", "499", ["123", "Comments"]], ["Bring it on, Elon Musk.", "5.4K", ["195", "Comments"]], ["While the cyber-attack didn’t impact Washington’s election systems, it highlights weak points in the state's computer networks.", "73", ["5", "Comments"]], ["Here's how Singapore helped 90% of households to own their own homes. https://bloom.bg/2NzVdTs", "419", ["39", "Comments"]], ["A U.S. federal judge temporarily blocks President Donald Trump’s ban on TikTok", "1.8K", ["207", "Comments"]], ["Russia expects a long and gradual revival of the oil market after the pandemic this year crushed energy demand.", "99", ["3", "Comments"]], ["American Airlines CEO Doug Parker said there's sufficient time for Congress to agree on extending $25 billion in federal aid that would prevent layoffs for tens of thousands of airline workers on Oct. 1.", "107", ["33", "Comments"]], ["Keeping the lights on.", "84", ["11", "Comments"]], ["BREAKING: Donald Trump paid just $750 in income taxes in both 2016 and 2017, reported losing millions of dollars from his golf courses and has hundreds of millions in debt that will come due in the next few years, according to a report in the New York Times.", "5.6K", ["2.5K", "Comments"]], ["It's easy to predict some things about Supreme Court justices like Amy Coney Barrett, but also a bit of suspense.", "75", ["18", "Comments"]], ["Joe Montana stiff-armed someone trying to kidnap his grandchild in Malibu.", "171", ["14", "Comments"]], ["New York City health officials say they’re alarmed at a continuing spike of Covid-19 in sections of south Brooklyn and Queens with large Orthodox Jewish communities.", "118", ["11", "Comments"]], ["They want Cuomo to run the city's schools.", "182", ["6", "Comments"]], ["We’ve just had the closest look yet at the global battle against money laundering, and it’s deeply troubling.", "320", ["84", "Comments"]], ["“If we couldn't control it very well during the summer, we are in for a big surprise.” Here’s how the coronavirus will be different in winter, according to virologist Juergen Richt, who tested Covid-19 on different surfaces. https://trib.al/YqMJdTz", "139", ["24", "Comments"]], ["SCOOP: AIG has lost four senior Black managers in recent weeks, including two who were tasked with improving the diversity of the insurer's ranks.", "42", ["5", "Comments"]], ["$25 an hour.", "2.4K", ["421", "Comments"]], ["Doctors can’t assume that all patients fully recover from Covid-19.", "100", ["21", "Comments"]], ["The proteins are called interferons, and they play a key role in beating the virus.", "95", ["16", "Comments"]], ["Emerging markets are heading toward the end of the third quarter with more reasons to be cautious than optimistic.", "241", ["2", "Comments"]], ["Is recycling really worth it? When it first took off, recycling was seen as one of the environmental movement’s great successes.  Recent market forces have made more and more countries reconsider the cost of going green. https://trib.al/0EUFhmY", "99", ["8", "Comments"]], ["LATEST: Investor Jeffrey Gundlach may be on the move.", "3.4K", ["45", "Comments"]], ["JUST IN: President Trump called for Joe Biden to take to a drug test before Tuesday's presidential debate, repeating a claim, without evidence, that the Democrat's public appearances have been affected by drug use.", "3.4K", ["1.2K", "Comments"]], ["Here's everything you need to know about why Amy Coney Barrett is right for the Right.", "297", ["116", "Comments"]], ["Inside digital currencies.", "3.4K", ["18", "Comments"]], ["LATEST: A legal battle highlights the symbiotic relationship between the superwealthy and their money whisperers.", "1.2K", ["5", "Comments"]], ["Showdown.", "307", ["147", "Comments"]], ["JUST IN: Biden leads Trump by 8 points nationally.", "677", ["206", "Comments"]], ["Amy Coney Barrett would be the Supreme Court's most conservative female justice in history.", "253", ["78", "Comments"]], ["The 10 p.m. curfew means pubs will lose out on the hours that tend to be their most profitable.", "34", ["2", "Comments"]], ["“We believe people want to travel and they will continue to travel.”", "91", ["10", "Comments"]], ["Right-wing militants, some in helmets and body armor, began converging on Portland on Saturday for a rally expected to attract thousands of pro-Trump, \"law-and-order\" protesters.", "318", ["192", "Comments"]], ["WATCH: The president names his pick to replace Ruth Bader Ginsburg.", "709", ["365", "Comments"]], ["“Like King Midas in reverse.”", "5.3K", ["47", "Comments"]], ["The electoral college favors Republicans, but this is ridiculous.", "101", ["109", "Comments"]], ["BREAKING: New York reported more than 1,000 new Covid-19 cases for the first time since early June.", "1.3K", ["333", "Comments"]], ["LATEST: The proteins are called interferons, and they play a key role in beating the virus.", "1.5K", ["258", "Comments"]], ["The move could stop China’s largest chipmaker SMIC from accessing U.S. chipmaking equipment and software, the FT reports.", "508", ["66", "Comments"]], ["A rebellion is brewing within the U.K.'s ruling Conservative Party.", "140", ["6", "Comments"]], ["The deal makes American the first major carrier to tap U.S. loans that were included in the $2 trillion Cares Act for economic relief from the coronavirus pandemic.", "88", ["17", "Comments"]], ["Will \"shy Trumpers\" be a factor in the 2020 race?", "64", ["38", "Comments"]], ["Civil rights groups argued the truncated timeline would undercount minorities, resulting in less funding for the areas they live in.", "113", ["1", "Comment"]], ["China demolished many of the hutongs surrounding the Forbidden City to make way for more modern buildings, but some residents have rediscovered their value.", "83", ["7", "Comments"]], ["Singapore's foreign workers are losing jobs and leaving.", "190", ["23", "Comments"]], ["Plenty of well-qualified minority and female job candidates exist — and would readily succeed if treated fairly.", "113", ["95", "Comments"]], ["The study would deliberately expose healthy people to the coronavirus in a bid to accelerate the development of a vaccine.", "64", ["9", "Comments"]], ["Stocks are looking for a second day of gains as markets build upward momentum after the September selloff cut valuations. Follow our live coverage from 9-10a ET.", "233", ["24", "Comments"]], ["This year, the Bloomberg Equality Summit is convening leaders including the Hon. Hillary Clinton, John Legend, Alicia Garza, Alyssa Milano, Dr. Anthony Fauci, Delta's Ed Bastien, Bank of America's Brian Moynihan, and more in our virtual summit.", "321", ["58", "Comments"]], ["His firm, incorporated in Nevada but based in Kazakhstan, has seen commission income surge 51-fold.", "1.7K", ["49", "Comments"]], ["Unfriending China? After years of shifting the Philippines closer to China, President Rodrigo Duterte appears to be leaning back toward the U.S.", "984", ["82", "Comments"]], ["Trump and Xi clash during a virtual United Nations General Assembly. Watch what the leaders had to say: https://trib.al/ZmxZ3K9", "219", ["103", "Comments"]], ["TOMORROW: At #BloombergEquality Melanne Verveer talks with 67th U.S. Secretary of State Hillary Clinton about Justice Ginsburg's legacy and how Democrats should respond to President Trump's push to replace her before Nov 3. Tune in at 7:40 AM ET. https://trib.al/aIF2RXU", "27", ["10", "Comments"]], ["Stocks are fluctuating as investors weigh strength in tech shares against tighter restrictions to combat the coronavirus and uncertainty in Washington. The dollar edged higher after its biggest daily gain in three months. Follow our live coverage from 9-10a ET.", "231", ["26", "Comments"]], ["LIVE: Prime Minister Boris Johnson addresses the House of Commons", "320", ["101", "Comments"]], ["When it comes to working from home, Tim Cook finds \"there are some things that actually work really well virtually.\"", "630", ["8", "Comments"]], ["LIVE: Here's how Asia-Pacific markets are moving after the S&P 500's slide overnight https://trib.al/lSHREzF", "266", ["19", "Comments"]], ["Trump faces a cash deficit in his race against Biden, and big GOP donors are coming off the sidelines to help.", "372", ["70", "Comments"]], ["NEW: Most banks target customers with higher incomes and good credit histories. Not Southern Bancorp. Under CEO Darrin Williams, it's pitching traditional banking to the untrusting and the unbanked.", "396", ["16", "Comments"]], ["Markets are tumbling with European stocks falling the most since July as investors worry about rising tensions in DC, tighter virus restrictions and a report detailing suspicious transactions at international banks. Follow our live coverage from 9-10a ET.", "425", ["129", "Comments"]], ["HBO won 30 awards in all. Netflix struck out on the top prizes.", "477", ["7", "Comments"]], ["Keep playing by Beijing’s rules or quit?", "86", ["24", "Comments"]], ["#BlackLivesMatter's Alicia Garza believes Black communities deserve what all communities deserve — to be powerful in every aspect of their lives. At #BloombergEquality we're discussing this year's protests and why hashtags don’t start movements. People do. https://trib.al/lfQO5b1", "97", ["82", "Comments"]], ["Now in its 8th year, we’re convening Canadian analysts, CEOs, government officials, and bankers to discuss everything from mining to ESG with the help of National Bank of Canada Financial Markets. Our first installment kicks off 9/24. Register here! https://trib.al/pEg5QRK #BloombergCFI", "29", ["2", "Comments"]], ["JUST IN: You can still download WeChat on your phone in the U.S.", "7.2K", ["118", "Comments"]], ["Ugliness feeds on itself. Trump has been unleashing a lot of it, with devastating effects on individuals and institutions.", "349", ["359", "Comments"]], ["The idea: Developed nations embrace zero growth or even shrinking GDP in favor of building an economy that makes humans healthier and happier.", "133", ["18", "Comments"]], ["Australian mines provide about two-thirds of China’s iron ore imports.", "237", ["53", "Comments"]], ["Can't blame it on the alcohol.", "29", ["8", "Comments"]], ["How do we advance racial equality and economic opportunity? At #BloombergEquality David Westin sits down with Bank of America Chairman & CEO Brian Moynihan. Tune in Wednesday at 9 AM ET. https://trib.al/YSzOy5m", "22", ["2", "Comments"]], ["Seven former law clerks talk about working for the Notorious RBG.", "203", ["3", "Comments"]], ["The suggestion that a politician helped create or expedite the Covid-19 vaccine is a dangerous thing, says Bill Gates. Watch the full interview with the Microsoft founder on the pandemic response, vaccine and inequity highlighted by the virus. https://bloom.bg/2ZFR2hf", "275", ["78", "Comments"]], ["“Mr. Trump! Our revenge for martyrdom of our great general is obvious, serious and real.”", "255", ["83", "Comments"]], ["How were hundreds of infected Ruby Princess passengers allowed to disembark in Sydney and return to homes from Tasmania to Florida?", "44", ["7", "Comments"]], ["Wall Street banks are losing confidence that Congress will soon provide a rescue.", "238", ["33", "Comments"]], ["The global economy and its citizens are confronting dual shocks: Covid-19 and nationwide protests in response to the tragic deaths of Breona Taylor, George Floyd, and Ahmaud Arbery. Join us for the #BloombergEquality Summit where we look to build inclusion and foster forward-thinking conversations in this age of disruption. https://trib.al/eQ7SQke", "29", ["3", "Comments"]], ["Now in its 8th year, we’re convening Canadian analysts, CEOs, government officials, and bankers to discuss everything from mining to ESG with the help of National Bank of Canada Financial Markets. Our first installment kicks off 9/24. Register here! https://trib.al/q5P5F0l #BloombergCFI", "23", ["1", "Comment"]], ["Monte Reel and Head of Bloomberg Podcasts Francesca Levy discuss the #BloodRiver Podcast - detailing the unsolved murder of environmental activist Berta Cáceres in 2016. With additional interviews featuring James Redford, Will Marshall, and Laura Nix.", "139", ["23", "Comments"]], ["Silicon Valley's elite have descended in droves on Lake Tahoe -- and it's drastically transformed the area in a matter of months.", "279", ["60", "Comments"]], ["Stocks are fluctuating as investors search for new catalysts to give direction to global markets and the Trump Administration moves to limit new downloads of TikTok and WeChat. Follow our live coverage from 9-10a ET.", "246", ["20", "Comments"]], ["Our final day of the #BloombergGreen Festival features interviews with Lord Jacob Rothschild, Lily Cole, Sabrina Elba, Nike's Noel Kinder, Cisco's Francine Katsoudas, Varshini Prakash, and James Redford.", "214", ["38", "Comments"]], ["Japan’s college graduates get one shot at their dream job. That’s it. And this year, they might not even get that.", "175", ["32", "Comments"]], ["NEW: These pieces of Vietnam's history have survived wars and revolutions. Now they're under pressure from a modernizing economy.", "67", ["1", "Comment"]], ["Bad to worse.", "90", ["21", "Comments"]], ["A bit of good news for 2020: Fewer children have died in the U.S. than would be expected in a non-pandemic year.", "68", ["17", "Comments"]], ["NOW: Day 4 of the #BloombergGreen Festival features Erik Schatzker's interview with Co-Chair of the Gates Foundation, Bill Gates.", "255", ["53", "Comments"]], ["NEW: Mark Zuckerberg has told employees that Facebook is likely to fare better under Republicans, according to people familiar with the conversations.", "945", ["159", "Comments"]], ["NEXT: We're excited to have Amazon pledge recipients Rivian, Redwood Materials, CarbonCure Technologies, Pachama, and TurnTide joining our next panel at the #BloombergGreen Festival. Tune in at 12 PM ET: https://trib.al/iQ6MWe2", "19", ["6", "Comments"]], ["How green in your toilet paper? Probably not very.", "51", ["6", "Comments"]], ["Global stocks are in retreat after Federal Reserve Chair Jerome Powell highlighted risks to the recovery in the central bank’s policy decision. Follow our live coverage from 9-10a ET.", "372", ["104", "Comments"]], ["Day 4 of the #BloombergGreen Festival features interviews with Bill Gates, Mayor of Helsinki Jan Vapaavuori, World Green Building Council CEO Cristina Gamboa, Microsoft’s David Cox, Rivian’s RJ Scaringe and more.", "242", ["52", "Comments"]], ["Matthew Moulding’s online retail business almost destroyed his personal finances back in the day. Now, he's part of the ultra-rich.", "495", ["9", "Comments"]], ["A surprise plunge in August suggests a difficult road ahead.", "203", ["8", "Comments"]], ["It's going to be extremely difficult for a vaccine to be widely available this year.", "46", ["14", "Comments"]], ["TOMORROW: Co-Chair of the Gates Foundation, Bill Gates speaks with Bloomberg TV's Erik Shatzker about findings from their latest Goalkeepers report, the search for a vaccine, and climate change. Watch live starting at 2 pm ET! https://trib.al/pL6e7go #BloombergGreen", "13", ["1", "Comment"]], ["“Every time we open indoor bars, indoor gyms, we see an uptick.”", "4.5K", ["59", "Comments"]], ["Stocks are higher as investors wait for the outcome of the Federal Reserve’s policy meeting later today. Follow our live coverage from 9-10a ET.", "429", ["85", "Comments"]], ["Swim, walk or do yoga. And earn as much as $280 in rewards.  Singapore has a new program to track and incentivize residents for staying healthy with the Apple Watch. https://trib.al/1zz3uVW", "319", ["36", "Comments"]], ["Imagine living in 122 °F. Sydney's new suburbs are too hot — and other cities across the world are facing the same problem. https://trib.al/Jd4Mjsm", "98", ["35", "Comments"]], ["Louisville, Kentucky will pay millions to the mother of Breonna Taylor and install police reforms as part of a settlement of a lawsuit from Taylor’s family, AP reports.", "101", ["23", "Comments"]], ["Conservatives see their best shot in decades to get rid of race in college admissions.", "106", ["67", "Comments"]], ["Stocks are pointing to another day of gains after data from China and Germany showed the economic recovery gaining traction. Follow our live coverage from 9-10a ET.", "373", ["38", "Comments"]], ["Failure by Republicans and Democrats to agree on a fresh round of fiscal stimulus would delay any economic recovery by six months, Morgan Stanley economists said.", "377", ["21", "Comments"]], ["Stocks are rising amid a flurry of deal activity and signs of progress toward a vaccine. Follow our live coverage from 9-10a ET.", "529", ["90", "Comments"]], ["Day 1 of the #BloombergGreen Festival kicks off with UNFCCC Executive Secretary Patricia Espinosa, Michael Bloomberg, Mayor of Los Angeles Eric Garcetti, Ellen Jackowski of HP, Frans van Houten of Philips and many more.", "233", ["24", "Comments"]], ["Pregnant women are left alone in hospitals to give birth, taps have run dry in urban centers, infrastructure is collapsing and more than half the population needs food aid.", "394", ["120", "Comments"]], ["The treaty is the start of a yearlong process that will unfold as the Gulf nation lobbies to buy the U.S.’s top warplane.", "53", ["26", "Comments"]], ["One of the hottest sectors in China's stock market.", "89", ["3", "Comments"]], ["How does HP ensure sustainability is at the core of its business results? And how do their efforts accelerate the creation of a more circular economy? Tune in to Jess Shankleman's conversation with Ellen Jackowski tomorrow at 12:25 pm ET. https://trib.al/iu2Djev", "20", ["9", "Comments"]], ["A Chinese Defense Ministry spokesman said the U.S. is \"the violator of the international order and the destroyer of world peace.\"", "3.4K", ["992", "Comments"]], ["British lenders are bracing for a spike in unemployment.", "259", ["12", "Comments"]], ["It wouldn’t be a new cold war without an accelerating nuclear arms race.", "296", ["76", "Comments"]], ["Germany's main economic artery faces a crisis. The government's answer: re-engineer Europe's most important river. For more: https://trib.al/dSjIOuR (via Bloomberg QuickTake)", "51", ["5", "Comments"]], ["The ruling could bar thousands of people from the polls in the swing state.", "221", ["91", "Comments"]], ["We're going behind the scenes of our latest issue. In our special election issue, we talk about the crises, people, and places that will determine whether Trump or Biden wins. https://www.bloomberg.com/businessweek", "122", ["43", "Comments"]], ["The University of Illinois did everything right, or so it seemed.", "48", ["5", "Comments"]], ["Years after the iPhone killed off Nokia’s mobile-phone business, the company is still feeding off a lucrative asset it salvaged from the wreckage.", "691", ["11", "Comments"]], ["Watch: Live coverage of 9/11 Memorial events in the U.S.", "555", ["127", "Comments"]], ["A fourth production flaw has surfaced in the marquee 787 Dreamliner.", "67", ["12", "Comments"]], ["BREAKING: TikTok owner ByteDance has a plan to turn Singapore into a stronghold in Asia, sources say.", "520", ["20", "Comments"]], ["A court agreed with Texas officials that only disabled, absentee or senior-citizen voters were entitled to use mail-in ballots, not able-bodied younger people.", "125", ["23", "Comments"]], ["Trump says a U.S.-China decoupling is possible, but his track record doesn’t back that.", "102", ["31", "Comments"]], ["BREAKING: A huge fire breaks out at the Port of Beirut, triggering panic among residents traumatized by last month's massive explosion.", "132", ["13", "Comments"]], ["BREAKING: Former Theranos CEO Elizabeth Holmes is exploring a “mental disease” defense for her criminal fraud trial.", "372", ["113", "Comments"]], ["What does the future of corporate sustainability look like? Don't miss interviews with Unilever CEO Alan Jope, EY Chairman & CEO Carmine Di Sibio, Drinkwell's Minhaj Chowdhury, HappyTap's Geoff Revell, Kasha's Joanna Bichsel, and Maya's Ivy Huq Russell.", "188", ["32", "Comments"]], ["Stocks are higher amid optimism that Tuesday’s tumble drew a line under the recent selloff. Follow our live coverage from 9-10a ET.", "311", ["89", "Comments"]], ["Small-dollar donors back Trump but other Republican candidates, not so much. That has the party worried.", "126", ["54", "Comments"]], ["LIVE: U.K. Prime Minister Boris Johnson faces PMQs amid a backlash against his government's plans to break international law over Brexit.  More:", "371", ["96", "Comments"]], ["North Korea suffered heavy damage from storms.", "108", ["5", "Comments"]], ["Politicians around the world are using more authoritarian language, and almost nowhere has the shift been more abrupt than in Hong Kong.", "112", ["37", "Comments"]], ["LIVE: Here's how Asia-Pacific markets are trading after a selloff in U.S. tech shares saw Tesla sink 21% and concerns mount over vaccine delay https://trib.al/UPAbXI", "451", ["36", "Comments"]], ["A group of international scientists says some of the findings from a study of Russia’s fast-moving coronavirus vaccine appeared improbable.", "176", ["69", "Comments"]], ["NEW: JPMorgan says it's found instances of Covid-relief funds being misused by customers and is probing employees’ involvement in potentially illegal activities.", "506", ["38", "Comments"]], ["General Motors took a $2 billion equity stake in Nikola and will engineer and manufacture its Badger electric-pickup model.", "269", ["33", "Comments"]], ["Technology stocks are sinking again as investors question whether valuations have reached extremes. Follow our live coverage from 9-10a ET.", "491", ["104", "Comments"]], ["A new experimental Covid-19 vaccine originating from the University of Oxford has begun human trials in Australia.", "170", ["21", "Comments"]], ["Xi Jinping handed out medals to citizens who played instrumental roles in China’s fight against the coronavirus.", "899", ["214", "Comments"]], ["After Donald Trump’s planned trip to a French cemetery for fallen Marines was canceled in November 2018, the U.S. leader had some time on his hands in a mansion filled with artwork. The next day, he went art shopping — or the presidential equivalent. Trump fancied several of the pieces in the U.S. ambassador’s historic residence in Paris, where he was staying, and on a whim had them removed and loaded onto Air Force One, according to people familiar with the matter. After Don...ald Trump’s planned trip to a French cemetery for fallen Marines was canceled in November 2018, the U.S. leader had some time on his hands in a mansion filled with artwork. The next day, he went art shopping — or the presidential equivalent. Trump fancied several of the pieces in the U.S. ambassador’s historic residence in Paris, where he was staying, and on a whim had them removed and loaded onto Air Force One, according to people familiar with the matter. But there’s a twist: when White House curators examined the pieces Trump brought home, they realized they were fakes. Link in bio for more. See More", "335", ["125", "Comments"]], ["The whales and turtles are back. Now Thailand plans to shut its national parks for several months each year to reduce environmental damage at popular tourist spots. https://trib.al/InuAhJk", "1.2K", ["30", "Comments"]], ["Suddenly, the idea of cheaper flights to space is closer to becoming a reality.", "1.2K", ["176", "Comments"]], ["The world needs a lot of safety reassurances to stop the pandemic.", "58", ["15", "Comments"]], ["Hot, dry winds are expected to threaten the region.", "115", ["13", "Comments"]], ["Check out this week's most compelling political images.", "34", ["6", "Comments"]], ["Here's how Angela Merkel could show her anger.", "709", ["119", "Comments"]], ["Finally an explanation for Big Tech's rip-roaring rally: a visionary whale who hails from Japan and has a hankering for stock options.", "1.6K", ["15", "Comments"]], ["“Why should I go to that cemetery? It’s filled with losers,” Trump said, according to The Atlantic.", "424", ["256", "Comments"]], ["A new class of medicines help people lose weight and control diabetes — which are also risk factors in severe Covid-19 cases.", "61", ["10", "Comments"]], ["Stocks are fluctuating and tech is underperforming for another session as traders digest a jobs report that showed a bigger-than-forecast drop in unemployment. Follow our live coverage from 9-10a ET.", "285", ["42", "Comments"]], ["Was Steve Madden's rise luck, accident, or genius?", "31", ["7", "Comments"]], ["The whales and turtles are back. Now Thailand plans to shut its national parks for several months each year to reduce environmental damage at popular tourist spots. https://trib.al/ZHRaDdt", "3.9K", ["113", "Comments"]], ["LIVE: Here's how Asia-Pacific markets are moving after the Nasdaq's tumble wiped $44 billion from the wealth of tech's richest https://trib.al/JzcbpMM", "519", ["52", "Comments"]], ["Stocks are sliding with the high-flying big tech stocks facing another round of selling. Follow out live coverage from 9-10a ET.", "318", ["95", "Comments"]], ["The dollar’s weakness threatens to incite a full-blown currency war that could derail the post-pandemic recovery.", "126", ["31", "Comments"]], ["He called them “anarchist jurisdictions” and said they should be disfavored for federal money.", "433", ["211", "Comments"]], ["A spokesman for Donald Trump’s re-election campaign said Wednesday he doesn’t know whether the president will practice debating Joe Biden.", "310", ["105", "Comments"]], ["Last week’s cancellation of sports competition was a watershed event in America.", "40", ["14", "Comments"]], ["Stocks are higher as investors anticipated positive reports on the economy in Washington amid dovish comments from monetary officials. Follow our live coverage from 9-10a ET.", "340", ["79", "Comments"]], ["Singapore PM Lee Hsien Loong speaks in Parliament about the economy and Covid-19 after the city entered a technical recession https://trib.al/s8W5PPU", "677", ["32", "Comments"]], ["Li Ka-shing, the tycoon who built some of Hong Kong's most iconic skyscrapers, first invested in the video app in 2013 — and the stake is now worth $11 billion.", "1K", ["23", "Comments"]], ["Biden and the DNC will report raising more than $350 million in August, a record-setting monthly amount.", "2.4K", ["587", "Comments"]], ["Tech stocks are looking to extend their winning streak with the Nasdaq 100 on the brink of doubling in under 2 years. Follow our live coverage from 9-10a ET.", "536", ["63", "Comments"]], ["Obese and overweight people are at high risk of suffering severe cases of Covid-19, according to a French study that sheds light on the pandemic’s burden.", "490", ["6", "Comments"]], ["The president said a plane loaded with “thugs” was headed for the Republican National Convention last week “to do big damage.” He provided few details.", "325", ["148", "Comments"]], ["LIVE: What’s next for biotech after the pandemic? Experts including the CEO of CanSino Biologics, maker of an experimental Covid-19 vaccine, discuss at HKEX summit https://trib.al/9U1olPI", "109", ["4", "Comments"]], ["We're LIVE from the Hong Kong Exchange's Biotech Summit 2020, where CEOs and executives from pharma giant AstraZeneca, Covid-19 experimental-vaccine maker CanSino Biologics and investment firm Hillhouse Capital are talking about a post-pandemic future https://trib.al/9U1olPI", "124", ["9", "Comments"]], ["AstraZeneca has begun a large-scale human trial of its coronavirus vaccine.", "195", ["14", "Comments"]], ["LATEST: Online trading platforms including Robinhood, Schwab and Vanguard are all experiencing technical issues", "126", ["15", "Comments"]], ["The S&P 500 is poised for its 5th consecutive month of gains as stocks hit fresh record highs. Follow our live coverage from 9-10a ET.", "501", ["75", "Comments"]], ["There are multiple names in the mix, including Shinzo Abe's right-hand man.", "107", ["3", "Comments"]], ["BREAKING: President Trump took to Twitter to highlight the identity of the supporter who was shot in Portland Saturday night. The individual was trending on social media.", "861", ["592", "Comments"]], ["Is big oil still a big deal?", "109", ["8", "Comments"]]]