[["When pressed over and over again, Republican Sen. Martha McSally of Arizona would not say whether she was proud of her support of President Donald J. Trump", "178", ["48", "Comments"]], ["They are used to threats from the outside — the Cuban Missile Crisis, 9/11 and constant threats to the President's safety — but now the people who make the White House function face a threat coming from inside the executive mansion with President Donald J. Trump and first lady Melania Trump both battling Covid-19", "592", ["398", "Comments"]], ["Searing heat in Europe, Australia, the Middle East and several other pockets of the world made last month the hottest September ever", "388", ["339", "Comments"]], ["Stocks are headed for a higher open following Tuesday's market slide. The market gave up all its gains yesterday and plunged after President Trump declared an end to stimulus talks until after the election. But Trump later backtracked a bit, suggesting on Twitter that he'd be willing to do separate stand-alone deals to provide more stimulus checks to consumers as well as support for struggling airlines and small businesses. That news is helping to lift stocks Wednesday morning.", "260", ["446", "Comments"]], ["White House staff remain \"nervous,\" and there is \"concern\" for their safety and well-being, according to a source familiar with the residence staff, and has dwindled to \"extremely essential\" workers.", "1.5K", ["1K", "Comments"]], ["With less than 4 weeks to the election, what could one of the vice-presidential candidates say to win or change your vote? Pence and Harris face off in the only #VPDebate of 2020, special live coverage starts tonight at 7 p.m. ET", "2.4K", ["1.3K", "Comments"]], ["The Health Insurance Portability and Accountability Act of 1996 protects patients from having their medical records disclosed without their consent. Does it apply to President Donald J. Trump?", "244", ["456", "Comments"]], ["Go There heads to the Black Sea, where the number of unsafe interceptions between military jets from Russia and the US has risen in recent months. NATO forces believe that Russia is growing its influence in and around the Crimean Peninsula, and the US has vowed to continue operating in the region despite Russian provocations. CNN's Fred Pleitgen gains exclusive access to a US Navy surveillance mission inside a high-tech jet as it tracks Russian airplanes and warships.", "1K", ["246", "Comments"]], ["The scene at the Great Wall of China this past week would have been unthinkable just months ago.", "2.5K", ["907", "Comments"]], ["Although QAnon began life as a uniquely American phenomenon, CNN has been tracking the movement's explosive growth internationally.  Here's how the virtual cult is increasingly creating a dilemma for platforms such as Facebook and Twitter.", "2.1K", ["2.3K", "Comments"]], ["JUST IN: Hurricane Delta has made landfall roughly halfway between the Mexican resort towns of Cancun and Playa del Carmen in the town of Puerto Morelos, according to NOAA NWS National Hurricane Center.", "1.3K", ["463", "Comments"]], ["Leaders of Greek neo-Nazi party Golden Dawn are guilty of running a criminal organization, an Athens court ruled in a landmark verdict.", "5.2K", ["779", "Comments"]], ["Top officials in the US Justice Department were the \"driving force\" behind President Donald Trump's controversial zero tolerance immigration policy that separated thousands of migrant children from their families, according to a draft of Justice Department Inspector General Michael Horowitz's investigation report reviewed by The New York Times.", "6.5K", ["3K", "Comments"]], ["JUST IN: Two women share the 2020 Nobel Prize in Chemistry for work in genome editing, a technique described as \"rewriting the code of life.\"", "21K", ["1.2K", "Comments"]], ["As the music world mourns his death, it's an apt moment to revisit some lesser-known Van Halen facts.", "4.1K", ["179", "Comments"]], ["All eyes may be on coronavirus test results in Washington, but Mike Pompeo is staying focused on China, writes CNN's James Griffiths", "589", ["475", "Comments"]], ["The Seattle Storm won the 2020 WNBA Finals, sweeping the Las Vegas Aces in the best-of-five series with a dominant 92-59 win on Tuesday in Game 3.", "660", ["144", "Comments"]], ["A toothless, two-fingered dinosaur was able to thrive more than 68 million years ago due to the parrot-like species' remarkable ability to adapt, scientists have discovered.", "640", ["579", "Comments"]], ["A defiant President Donald Trump is chasing his own political goals while ignoring the human and economic toll of the pandemic, with his super spreader White House in chaos and top Pentagon generals in quarantine, writes CNN's Stephen Collinson.", "5K", ["4K", "Comments"]], ["Thinking of moving?", "456", ["142", "Comments"]], ["Most patients hospitalized with Covid-19 have neurological symptoms, a new study suggests", "1.1K", ["579", "Comments"]], ["Wildfires have gotten so extreme in recent years that experts have had to coin new terms", "2.6K", ["789", "Comments"]], ["Some companies are increasing their offerings to help their workers stay healthy amid so much uncertainty", "412", ["217", "Comments"]], ["Maybe reconsider posting those exotic vacation pics and flattering selfies", "562", ["317", "Comments"]], ["Kristyn Owens traveled from Los Angeles to Cancun to celebrate her 30th birthday in what was supposed to be a Covid-safe way in a country that allowed Americans. But Hurricane Delta had other plans.", "478", ["311", "Comments"]], ["It's the first major pet products chain to pull the items from its stores and online", "3.3K", ["957", "Comments"]], ["House Speaker Nancy Pelosi and Dr. Anthony Fauci are getting the action figure treatment", "5.1K", ["1.1K", "Comments"]], ["Another round of checks. Boost to unemployment benefits.  This is what was under consideration for more stimulus funding before Trump ended negotiations.", "2.9K", ["3K", "Comments"]], ["A 16-month congressional investigation into Amazon, Apple, Google and Facebook has found that the tech giants hold \"monopoly power\" in key business segments and have abused their dominance in the marketplace", "1.6K", ["609", "Comments"]], ["Patricia and Mark McCloskey, the St. Louis homeowners who pointed guns at protesters, have been indicted on weapons and tampering with evidence charges, their attorney said", "28K", ["5K", "Comments"]], ["Rick Bright, who filed an extensive whistleblower complaint this spring alleging that his early warnings about the coronavirus were ignored, is exiting the federal government altogether after being \"sidelined\" at the National Institutes of Health, his attorneys said", "6.2K", ["918", "Comments"]], ["Johnny Nash, best known for his 1972 hit \"I Can See Clearly Now,\" has died. He was 80 years old.", "7.6K", ["541", "Comments"]], ["The move would make it difficult, if not impossible, for any vaccine maker to apply for emergency use authorization by Election Day", "6.4K", ["1.4K", "Comments"]], ["\"I think if he still has Covid, we shouldn't have a debate,\" Biden told reporters. \"I think we're gonna have to follow very strict guidelines. Too many people have been infected and it's a very serious problem.\"", "25K", ["6.2K", "Comments"]], ["President Donald J. Trump is no longer winning on his signature issue", "15K", ["4.7K", "Comments"]], ["While Joe Biden is doing better with pretty much all groups compared with 2016 Democratic nominee Hillary Clinton in new polls, one group jumps out", "19K", ["3.5K", "Comments"]], ["Elegant? ✅ Intelligent? ✅ And influential? ✅ Find out how Jackie Kennedy strengthened foreign diplomacy around the world this Sunday at 10 p.m. ET/PT in an all-new episode of the CNN Original Series #FirstLadies", "1.5K", ["592", "Comments"]], ["The vice president's team had objected to the planned use of plexiglass barriers at the debate. Kamala Harris and the debate moderator will be permitted to erect dividers separating them from Pence.", "15K", ["4.5K", "Comments"]], ["Miller is the latest official caught up in an outbreak at the White House that has seen at least 10 others test positive", "27K", ["7.1K", "Comments"]], ["Covid-19 has killed more people in eight months than the flu did in the last five flu seasons combined", "11K", ["4.5K", "Comments"]], ["Facebook says it will ban any pages, groups and Instagram accounts representing QAnon from its platform. The move comes three years after the far-right conspiracy theory began.", "31K", ["5.3K", "Comments"]], ["Three prominent Black female authors in science fiction, young adult literature and essay writing are among the 21 winners of this year's MacArthur Foundation \"genius grants\"", "1.9K", ["426", "Comments"]], ["“I believe in law and order. I’ve never supported defunding the police, but I also believe injustice is real,” says Joe Biden. “I do not believe we have to choose between law and order and racial justice in America.”", "1.1K", ["999", "Comments"]], ["A former Georgia police officer who choked a onetime NFL prospect during a 2017 arrest will never work in law enforcement again after pleading guilty to battery.  But Desmond Marrow's life remains a wreck.", "1.3K", ["415", "Comments"]], ["Even before his diagnosis, President Donald J. Trump had taken to calling drug companies to check on their vaccine trials, asking how much longer they'll take and ginning up the pressure around his desire for a vaccine before Election Day", "5.2K", ["2.3K", "Comments"]], ["JUST IN: Eddie Van Halen, the renowned lead guitarist of iconic rock group Van Halen, has died, according to a social media post by his son. He was 65.", "15K", ["948", "Comments"]], ["\"How do you say that? My father is gone.\" A President Donald J. Trump tweet left many friends and families of coronavirus victims disgusted and angered.", "9.4K", ["3.4K", "Comments"]], ["President Donald J. Trump is once again warning voters that Democrats would \"shut our economy and jobs down\" if they win in November. Goldman Sachs is telling its clients the exact opposite.", "21K", ["4.4K", "Comments"]], ["While faces are hugely important for visual communication in humans, the same can't be said for our canine companions, according to a new study", "542", ["183", "Comments"]], ["JUST IN: President Donald J. Trump has ordered his negotiators to halt talks over a new stimulus package", "58K", ["22K", "Comments"]], ["Singapore will offer a one-time payment to aspiring parents during the coronavirus pandemic", "937", ["460", "Comments"]], ["There just aren't all that many persuadable voters out there | Analysis by Chris Cillizza", "13K", ["4.6K", "Comments"]], ["Alexanda Kotey and El Shafee Elsheikh, dubbed \"the Beatles\" because of their British accents, were part of an ISIS execution cell that has been accused by the State Department of \"holding captive and beheading approximately two dozen hostages.\"", "695", ["582", "Comments"]], ["Justices Clarence Thomas and Samuel Alito's harsh words for the Obergefell v. Hodges decision legalizing same-sex marriage are an ominous signal to states to challenge the case before a court where its outcome could be much more vulnerable, writes Law professor Tim Holbrook for CNN Opinion", "9.1K", ["2.5K", "Comments"]], ["For Barrett's supporters and detractors alike, it's clear that her confirmation would cement a conservative majority on the Supreme Court to limit abortion access", "4.5K", ["3.1K", "Comments"]], ["Go There heads to the Black Sea, where the number of unsafe interceptions between military jets from Russia and the US has risen in recent months. NATO forces believe that Russia is growing its influence in and around the Crimean Peninsula, and the US has vowed to continue operating in the region despite Russian provocations. CNN's Fred Pleitgen gains exclusive access to a US Navy surveillance mission inside a high-tech jet as it tracks Russian airplanes and warships.", "1.8K", ["518", "Comments"]], ["\"Sometimes we eat, sometimes we don't.\" Rose Rodriguez is struggling to feed her three girls after losing her job to the pandemic. They shouldn't have to worry about food, she says. \"I should be working and they should be... worried about school and their future. It just hurts\" https://cnn.it/3liVfzM", "575", ["535", "Comments"]], ["Watch the Vice Presidential Debate, special coverage Wednesday starting at 7 p.m. ET on CNN #VPDebate", "2K", ["711", "Comments"]], ["JUST IN: The top US general, Gen. Mark Milley, and several members of the Joint Chiefs of Staff are quarantining after a top Coast Guard official tested positive for coronavirus, several US defense officials tell CNN", "11K", ["2.6K", "Comments"]], ["Health officials are imploring Americans to answer their phones. The caller may be a disease tracker trying to save you from the deadly coronavirus.", "786", ["559", "Comments"]], ["If she can do it, she says, so can you", "18K", ["690", "Comments"]], ["Facebook has removed a post from President Donald J. Trump in which he falsely claimed that Covid-19 is less deadly than the seasonal flu", "86K", ["11K", "Comments"]], ["\"If you think things cannot possibly get worse, trust me, they can; and they will if we don't make a change in this election.\" The former first lady does not hold back in her criticism of President Donald J. Trump, slamming him for his \"incompetence\" in his pandemic response and for stoking fear and racism to divide the country.", "79K", ["13K", "Comments"]], ["Eating when feeling stressed has become a reality for many of us during these unsettling days", "416", ["245", "Comments"]], ["Not even a global pandemic could stop her from voting in this one.", "3.8K", ["729", "Comments"]], ["Futures are pointing to a mixed open Tuesday following Monday's strong rally. The Dow and S&P 500 are expected to rise slightly but the tech-laden Nasdaq is a smidge lower in premarket action. Investors continue to wait for more news about another stimulus plan as House Speaker Nancy Pelosi and Treasury Secretary Steven Mnuchin plan more talks.", "192", ["255", "Comments"]], ["\"We need to flood the system with testing,\" Fauci said.", "1.8K", ["1.2K", "Comments"]], ["The White House has declined offers from the CDC to help investigate the outbreak surrounding President Donald J. Trump's Covid-19 diagnosis, according to a federal health official.", "20K", ["5.4K", "Comments"]], ["The novel coronavirus may have infected about one in 10 people globally, meaning the majority of the world remains vulnerable to Covid-19, a World Health Organization official has said.", "1K", ["771", "Comments"]], ["With less than 4 weeks to the election, what could one of the vice-presidential candidates say to win or change your vote? Pence and Harris face off in the only #VPDebate of 2020, special live coverage starts Wednesday at 7 p.m. ET", "3.7K", ["2.7K", "Comments"]], ["Civil rights attorney Lee Merritt said Jonathan Price had intervened in a domestic dispute before he was shot.", "8K", ["2.5K", "Comments"]], ["Among likely voters, 57% say they back Democratic nominee Joe Biden and 41% President Donald J. Trump, according to a new nationwide CNN Poll conducted by SSRS entirely after the first debate and mostly after the President's coronavirus infection was made public.", "36K", ["8.7K", "Comments"]], ["Instead of a bustling hive of pre-election activity, the West Wing has become a breeding ground for viral contagion, write CNN's Kevin Liptak, Kaitlan Collins and Jeff Zeleny.", "2K", ["1.6K", "Comments"]], ["JUST IN: The 2020 Nobel Prize in Physics goes to three scientists for pioneering work on black holes, described by the award organizers as the \"darkest secrets of the universe.\"", "21K", ["1K", "Comments"]], ["The professor has now apologized.", "6K", ["4.1K", "Comments"]], ["TikTok averted a ban in the United States last week when a federal judge ruled that Washington couldn't block it from app stores just yet. The short-form video app is still accessible, but its fate in the country is far from certain.", "409", ["240", "Comments"]], ["This high-tech suitcase uses artificial intelligence to map the environment around it, plan a route, and direct its user through vibrations in the handle. It also features facial recognition technology, and can flag shops and other places of interest.", "462", ["208", "Comments"]], ["\"When Secret Service agents and officers are exposed to this virus, whether caused by their protectees or predicated on the environment that they are operating in, the risks are not solely assumed by them but expand to their families, friends, and anyone they may come in contact with,\" Jonathan Wackrow writes for CNN Opinion.", "1.3K", ["1.2K", "Comments"]], ["A strongly medicated President Donald Trump bolted from his VIP hospital bubble Monday, staging a bizarre White House comeback that included an irresponsible mask removal and a reckless pronouncement there is nothing to fear from Covid-19, which has already killed 210,000 Americans, writes CNN's Stephen Collinson.", "11K", ["6.6K", "Comments"]], ["Only about half of Americans said they would try to get a Covid-19 vaccine once one is available, according to a new CNN Poll conducted by SSRS, and that percentage appears to have dropped since May.", "640", ["723", "Comments"]], ["That's more than 35 times as much plastic than is believed to be floating on the surface, the study suggests.", "1.8K", ["425", "Comments"]], ["\"It's not a safe place to work and hasn't been in a long time,\" one reporter said", "11K", ["3.4K", "Comments"]], ["Mars will be visible at night throughout October, rising the highest in the sky around midnight each evening", "24K", ["871", "Comments"]], ["Police officials in Long Beach, California, said they removed an \"unauthorized\" \"Make America Great Again\" flag supporting President Donald Trump after it was seen flying outside of their station this weekend.", "2.9K", ["1.3K", "Comments"]], ["Sen. Ron Johnson, a Wisconsin Republican who recently tested positive for Covid-19, says he will do everything he can to vote for President Trump's Supreme Court nominee, Amy Coney Barrett. \"If we have to go in and vote, I have already told leadership, I'll go in a moon suit.\" Johnson said.", "7.1K", ["2.3K", "Comments"]], ["It could cost an extra $1 million per mile, the US Customs and Border Protection said", "9K", ["2.4K", "Comments"]], ["What questions do you have about the vice presidential debate on Wednesday? Post your questions in the comments and CNN's Chris Cillizza will answer them in a special YouTube live stream before the debate airs.", "808", ["1.5K", "Comments"]], ["The US Supreme Court has reinstated South Carolina's requirement that absentee ballots have a witness' signature", "6.6K", ["1.5K", "Comments"]], ["\"Anybody who contracts the virus by essentially saying, 'masks don't matter, social distancing doesn't matter,' I think is responsible for what happens to them,\" Biden said", "30K", ["5.5K", "Comments"]], ["Vice President Mike Pence and Democratic vice presidential nominee Kamala Harris will be separated by plexiglass at Wednesday night's debate, a source familiar with the preparations tells CNN, as the White House continues to be gripped by a coronavirus outbreak.", "10K", ["2.6K", "Comments"]], ["If you think smoking or ingesting weed helps control pain of all types, think again. Using marijuana before entering the hospital for a surgical procedure can make your pain during recovery significantly worse, according to research presented Monday.", "2.1K", ["1.5K", "Comments"]], ["It's the 100th anniversary of the 19th amendment and Mattel released a new Barbie to celebrate it", "23K", ["1.4K", "Comments"]], ["JUST IN: President Trump has returned to the White House after spending three nights at Walter Reed Medical Center for coronavirus treatment. After exiting Marine One, Trump walked up a set of stairs, took off his mask and posed for photographs on a balcony. https://cnn.it/2GIX3De", "46K", ["29K", "Comments"]], ["In a year of increasingly bleak headlines, here's one uplifting piece of news", "641", ["540", "Comments"]], ["Go There heads to Wisconsin, where a recent surge in coronavirus cases has led to record deaths and hospitalizations – all while President Trump was planning to hold two campaign rallies in the pivotal swing state until he tested positive for Covid-19. CNN’s Adrienne Broaddus speaks to locals about the election and the pandemic in Janesville, Wisconsin, where one of the rallies was supposed to take place.", "1.6K", ["1.4K", "Comments"]], ["Absolute best story of the day!", "9.7K", ["2.2K", "Comments"]], ["If you get sick with Covid-19, don't expect to get the same treatment as President Donald J. Trump", "7.2K", ["4.3K", "Comments"]], ["When President Trump returns to the White House this evening, his working spaces will be contained inside the executive mansion in temporary offices set up on the basement level adjacent to the White House medical suite, according to a person familiar with the plans.", "2.7K", ["2.6K", "Comments"]], ["A third-grade teacher died in North Carolina days after testing positive for Covid-19 and while her students were quarantined as a result of the exposure.  \"Students absolutely loved being taught by Mrs. Davis,\" the school district said.", "67K", ["7.9K", "Comments"]], ["As states begin to mail ballots to voters, on-time delivery of first-class mail is plummeting across the US, according to new Postal Service documents submitted to a federal court", "3.1K", ["1K", "Comments"]], ["Two-thirds of Americans say President Donald J. Trump handled the risk of coronavirus infection to others around him irresponsibly, a new CNN poll shows", "17K", ["5.7K", "Comments"]], ["Researchers working in the waters off Nova Scotia, Canada, have found a huge great white shark that weighs 3,541 pounds and measures 17 feet 2 inches in length", "50K", ["1.9K", "Comments"]], ["The US Centers for Disease Control and Prevention has again updated its guidance about how Covid-19 spreads to include information about potential for airborne transmission", "1.9K", ["1.2K", "Comments"]], ["It's one of the few formal public remembrances of coronavirus victims in the US since the pandemic began", "15K", ["2.8K", "Comments"]], ["JUST IN: President Donald J. Trump tweets that he will be leaving Walter Reed Medical Center at 6:30 p.m. ET Monday following a three-day stay for Covid-19 treatment", "10K", ["8.1K", "Comments"]], ["The brain cells of a young man who died almost 2,000 years ago in the eruption of Mount Vesuvius have been found intact by a team of researchers in Italy", "46K", ["1.8K", "Comments"]], ["Jackie Kennedy transformed not only her husband’s presidency, but also the way his story is remembered. See how she did it in an all-new episode of the CNN Original Series #FirstLadies Sunday at 10 p.m. ET/PT", "2K", ["1.3K", "Comments"]], ["This is only the second time the Greek letter Delta has been used for a named storm", "1.6K", ["176", "Comments"]], ["Thomas wrote that the decision, Obergefell v. Hodges, \"enables courts and governments to brand religious adherents who believe that marriage is between one man and one woman as bigots, making their religious liberty concerns that much easier to dismiss.\"", "6.5K", ["3.2K", "Comments"]], ["President Donald J. Trump received a high dose of an experimental antibody cocktail from Regeneron as part of his Covid-19 treatment. Now the drugmaker's stock is up sharply — and questions are swirling about the president's ties to Regeneron's billionaire CEO.", "8.6K", ["3.6K", "Comments"]], ["The drive-by aptly summed up his presidency to date, writes Chris Cillizza: \"An entirely self-focused political (and PR) stunt with little regard for the impacts on people other than himself.\" | Analysis", "26K", ["7.3K", "Comments"]], ["A motorist died in August after faulty airbag inflators in their 2002 Honda Civic ruptured, Honda confirms. It's the 17th death in the US caused by a Takata airbag that has been recalled.", "644", ["297", "Comments"]], ["What questions do you have about President Trump’s health and his Covid-19 diagnosis? Ask away in the comments and questions will be answered during today’s Anderson Cooper Full Circle, live at 6pm ET at CNN.com/FullCircle", "1.8K", ["8.4K", "Comments"]], ["On Monday, a short-handed Supreme Court, still reeling from the death of Justice Ruth Bader Ginsburg, begin a new term in the shadow of a bitter confirmation fight that is set to take place weeks before the presidential election", "879", ["878", "Comments"]], ["JUST IN: White House press secretary Kayleigh McEnany tweeted that she tested positive for coronavirus Monday morning. She says she is experiencing no symptoms.", "60K", ["14K", "Comments"]], ["There are now 4.5 million such people looking for work", "3.7K", ["1.9K", "Comments"]], ["New Jersey Gov. Phil Murphy calls for federal cooperation on contact tracing after President Trump’s fundraiser. “The staff all live in New Jersey even though the attendees were from around the country,” he said. “It’s an all-in moment...we need everyone to punch at their weight here” https://cnn.it/33x1xpd", "475", ["282", "Comments"]], ["It's all coming to a head with early voting already underway and Election Day about four weeks away", "1.3K", ["773", "Comments"]], ["What unfolds over the days and weeks can't be controlled by a master political tactician like Senate Majority Leader Mitch McConnell or last-minute procedural hurdles unfurled by Minority Leader Chuck Schumer", "5.1K", ["1.6K", "Comments"]], ["\"This is a busy White House,\" President Donald J. Trump explained in March. \"We've got a lot of things happening. And then this came up.\"", "3K", ["1.5K", "Comments"]], ["With less than 5 weeks to the election, what could one of the vice-presidential candidates say to win or change your vote? Pence and Harris face off in the only #VPDebate of 2020, special live coverage starts Wednesday at 7 p.m. ET", "1K", ["867", "Comments"]], ["Stocks are looking to bounce back from Friday's losses after President Trump appears to be responding well to treatments for Covid-19. But investors are likely to remain on edge given continued questions about the president's health — as well as worries about the lack of a new economic stimulus plan and jitters about the rapidly approaching election.", "382", ["339", "Comments"]], ["\"Melania is aware of the dangers of Covid-19,\" the official says. \"Potentially exposing others is not a risk she would take.\"", "11K", ["2.2K", "Comments"]], ["Some Secret Service members are troubled by President Donald J. Trump's willingness to put staff at risk for Covid-19. Sunday's drive outside Walter Reed hospital \"should never have happened,\" one says.", "13K", ["5.7K", "Comments"]], ["With a smart approach to these cold-weather months, researchers say you can defy their grim projections.", "1.8K", ["1.1K", "Comments"]], ["Amid a global pandemic, teachers have become even more vital, as they navigate how to help students adjust to distance learning and adapt to Covid-19 safety guidelines in their classrooms.", "1.4K", ["367", "Comments"]], ["Jordan Josey, 29, and his internist aren't sure whether the virus was never fully defeated or whether he may have gotten reinfected. Whatever the underlying cause, Covid-19 rocked his world.", "1.2K", ["600", "Comments"]], ["These people in President Donald J. Trump's family, the US government and circle of advisers, and recent contacts have tested positive for Covid-19.", "1.1K", ["1.1K", "Comments"]], ["Global markets and US stock futures are rising after Trump's physicians said that the president could be discharged from Walter Reed National Medical Center as early as Monday.", "3.6K", ["2.8K", "Comments"]], ["JUST IN: The 2020 Nobel Prize in Medicine goes to a trio of scientists for the discovery of the Hepatitis C virus, a major global health challenge", "12K", ["1.1K", "Comments"]], ["A senior administration official told CNN that the cluster of coronavirus cases among top Republican officials probably began at President Donald Trump's Rose Garden event announcing the nomination of Judge Amy Coney Barrett to the Supreme Court.", "3.6K", ["2.1K", "Comments"]], ["President Trump's physicians are giving him several different treatments -- including investigational drugs -- in the hope of relieving his Covid-19 symptoms and possibly shorten his course of illness.", "1.8K", ["2.1K", "Comments"]], ["A senior adviser to President Donald Trump's reelection campaign said there won't be any additional safety protocols for upcoming rallies following the President's hospitalization after contracting Covid-19.", "9.4K", ["3.2K", "Comments"]], ["\"A veteran, a businessman and a sportsman, Gov. Mike Foster was a true Louisianan who served his country, his state and his community with honor throughout his life,\" a statement from Gov. John Bel Edwards read.", "867", ["131", "Comments"]], ["The Proud Boys hashtag, which members of the far-right group have been using, was trending Sunday after gay men on Twitter hijacked it and flooded the feed with photos of their loved ones and families and with memes.", "153K", ["9.7K", "Comments"]], ["In the midst of an aggressive course of treatment, Trump left Walter Reed with his security detail so he could take a brief ride in an SUV past supporters cheering him on, writes CNN's Maeve Reston", "4.1K", ["2.8K", "Comments"]], ["Trump staged an extraordinary drive-by photo-op Sunday in front of supporters outside Walter Reed National Military Medical Center.  The stunt, which risked exposing Secret Service agents riding in his armored SUV, amounted to a familiar flouting of government recommendations to stop the spread of the virus, writes CNN's Stephen Collinson.", "17K", ["9.9K", "Comments"]], ["\"Rewilding\" -- restoring an ecosystem to its natural state -- turned a struggling British farm into a haven for wild pigs, cattle and deer. And this conservation success story could change the way we think about agriculture. #CallToEarth", "991", ["187", "Comments"]], ["Five parrots have been removed from public view at a British wildlife park after they started swearing at customers. \"It just went ballistic, they were all swearing,\" the venue's chief executive Steve Nichols said. \"We were a little concerned about the children.\"", "3.4K", ["725", "Comments"]], ["Two years ago, scientists detected what looked like a salty lake under the surface of Mars' southern ice cap. Now, new research has found more evidence of the lake, and also revealed a number of smaller salty \"ponds\" nearby -- raising the possibility there may be life on the Red Planet.", "1.5K", ["421", "Comments"]], ["A college freshman at Stephen F. Austin State University in Texas was sound asleep when campus police entered her room last month at 3 a.m., with one officer's gun drawn, her lawyer and university officials say.", "1.7K", ["893", "Comments"]], ["One of the children died", "2.1K", ["464", "Comments"]], ["Cuba has issued a hurricane watch as a storm system brews south of Jamaica, with forecasters expecting it to gain strength as it moves northwest towards the Gulf of Mexico.", "461", ["208", "Comments"]], ["Barr has received four negative Covid-19 tests since Friday morning, a spokesman for The United States Department of Justice says. He is self-quarantining but anticipates returning to work this week.", "3.7K", ["1.6K", "Comments"]], ["Tofino is still the crunchiest place in Canada", "398", ["159", "Comments"]], ["A group in Florida has raced to pay off fines and fees of former felons, which would make them eligible to vote in November's election.", "8.5K", ["3.1K", "Comments"]], ["While the moon won't actually look blue, the second full moon in one month is usually referred to as a blue moon.  This happens every 2.5 to three years, or \"once in a blue moon.\"", "1.9K", ["412", "Comments"]], ["President Donald J. Trump is being given dexamethasone, one of the physicians treating Trump says. It's an indication his condition is worrying, as the drug shouldn't be given to anyone who isn't ill enough to justify the downsides of taking steroids, doctors say.", "4.8K", ["4.9K", "Comments"]], ["The PlayStation 5, with its emphasis on digital games, poses a challenge for GameStop, a cornerstone of video game retail. Here's why.", "1.4K", ["445", "Comments"]], ["Pope Francis disparaged so-called trickle-down economic theory, saying the pandemic has shown that free-market policies cannot solve all of humanity's most dire needs.", "19K", ["3.3K", "Comments"]], ["President Trump, wearing a mask and waving, made a surprise drive-by for the crowd outside Walter Reed National Military Medical Center. He is now back inside the hospital. CNN's Jeremy Diamond reports. https://cnn.it/2GsrAFt", "1.5K", ["2.3K", "Comments"]], ["A senior adviser to President Donald J. Trump reelection campaign claimed that Democratic presidential nominee Joe Biden uses face masks as a \"prop,\" two days after Trump was hospitalized after contracting the coronavirus.", "24K", ["8.5K", "Comments"]], ["President Donald J. Trump, wearing a mask and waving, made a surprise drive-by for the crowd outside Walter Reed. He is now back inside the medical center.", "27K", ["15K", "Comments"]], ["\"It wasn't just sort of conveying an 'upbeat attitude.' It was purposefully misleading yesterday about a very basic issue, which is whether or not [President Trump] had been on supplemental oxygen... that's important.\" - Dr. Sanjay Gupta on misleading medical briefings. https://cnn.it/2Sqs7Kr", "690", ["905", "Comments"]], ["\"While we've come to expect misinformation Trump, the White House press secretary and other paid operatives of the administration, it's unsettling to hear it from a medical doctor,\" Chris Cillizza writes. \"Even one who works for the President.\"", "4.4K", ["3K", "Comments"]], ["The absence of a robust contact tracing effort is emblematic of the White House's relaxed approach to preventing the spread of the virus among its ranks", "4.8K", ["1.8K", "Comments"]], ["CNN’s Jake Tapper: “Sick and in isolation, Mr. President, you have become a symbol of your own failures. Failures of recklessness, ignorance, arrogance. The same failures you have been inflicting on the rest of us ... Get well and get it together.\"", "781", ["612", "Comments"]], ["Mayor Bill de Blasio proposes closing schools and non-essential businesses in some neighborhoods because of higher positive coronavirus test rates", "3.9K", ["938", "Comments"]], ["Ohio Gov. Mike DeWine tells CNN's Jake Tapper that he has not been contacted by the White House about potential Covid-19 exposure in his state after President Trump tested positive for the virus days after his Cleveland debate. https://cnn.it/3nk3gGa", "581", ["388", "Comments"]], ["Paris-based Japanese designer Kenzo Takada, famous for creating the international luxury fashion house Kenzo, has died due to Covid-19 related complications, a spokesman for his K-3 brand said in a statement.", "5.6K", ["619", "Comments"]], ["Following two briefings from President Donald J. Trump's doctors over the weekend, more details about the course of his Covid-19 illness are emerging — but many questions still remain.", "3.2K", ["3.7K", "Comments"]], ["Ohio Governor Mike DeWine says the White House didn't contact him about potential Covid-19 exposure in his state after Tuesday's debate in Cleveland", "5.9K", ["1.7K", "Comments"]], ["Audio secret grand jury proceedings released Friday offers a glimpse into the confusion that reigned during the final moments of Breonna Taylor's life", "524", ["1K", "Comments"]], ["President Donald J. Trump was reluctant to go to the hospital, multiple sources said. Though he had developed symptoms and was on experimental drugs, he didn't want to be \"hospitalized,\" he said.", "1.9K", ["1.7K", "Comments"]], ["The President had two episodes of drops in oxygen levels but is continuing \"to improve,\" says Dr. Sean Conley, Trump’s physician. He says the President was given supplemental oxygen and has also been treated with the steroid dexamethasone.", "5.9K", ["3.7K", "Comments"]], ["The President is furious with chief of staff Mark Meadows after the top West Wing official contradicted the White House physician's assessment Saturday of Trump's health, two sources with knowledge of the situation say.", "8.5K", ["3.3K", "Comments"]], ["President Donald J. Trump's positive coronavirus diagnosis has raised questions about the health of those around him", "3.5K", ["2.5K", "Comments"]], ["After multiple GOP officials have tested positive for Covid-19, a senior administration official says the virus was likely spread at last week's White House Rose Garden event where President Donald J. Trump nominated Judge Amy Coney Barrett to the Supreme Court.", "6.2K", ["2.5K", "Comments"]], ["\"The nation is now facing a grave governing crisis with its commander in chief hospitalized as the White House events of the past week serve as a textbook example of how not to handle a deadly virus,\" Maeve Reston writes.", "6.5K", ["4.4K", "Comments"]], ["Nicholas Luna, one of the White House aides who works closest to President Donald J. Trump, has tested positive for coronavirus, a White House official says.", "13K", ["4.6K", "Comments"]], ["Ethiopian Shura Kitata secures an unlikely victory in the London Marathon as world record holder and pre-race favorite Eliud Kipchoge fades in the closing stages", "4.1K", ["321", "Comments"]], ["The human tendency to believe change is temporary and that the future will again resemble the past is called \"normalcy bias.\" Eventually, however, people need to adapt to change, psychologists say.", "6.7K", ["2.3K", "Comments"]], ["Fast-fashion retailer H&M is closing 250 stores, about 5% of its worldwide total, next year as people are increasingly shopping online.", "2.1K", ["685", "Comments"]], ["“They give me 30 days. I’m just thinking about my kids. Where do I go with my kids?” Tenants in Columbus, Ohio, are facing eviction as they struggle to pay rent during the pandemic. CNN's Kyung Lah explains why this is happening despite a national moratorium on evictions. https://cnn.it/3nkiBqC", "3.2K", ["1.6K", "Comments"]], ["The Louisville police officer who fatally shot Breonna Taylor is currently raising money to fund his retirement. Detective Myles Cosgrove was one of three Louisville officers who fired shots into Taylor's apartment last March after breaking in to serve a search warrant related to Taylor's ex-boyfriend.", "6.9K", ["3.7K", "Comments"]], ["21 affordable finds on Amazon.com: (via CNN Underscored)", "166", ["305", "Comments"]], ["Go There heads to Portland, Oregon, to report on the protests that have been going on for months as part of an anti-police movement that shows no signs of stopping. Rallies have also been held by far-right groups including the Proud Boys, who were mentioned in a heated moment earlier this week at the first presidential debate. We follow CNN’s Elle Reeve, who spent a month speaking to activists and attendees at these events as tensions remained high.", "983", ["1.6K", "Comments"]], ["An intense argument recorded and posted in a WhatsApp group has led to a death penalty sentence and a family torn apart over allegations of insulting Prophet Mohammed, according to lawyers for the defendant.", "540", ["916", "Comments"]], ["While the moon won't actually look blue, the second full moon in one month is usually referred to as a blue moon.  This happens every 2.5 to three years, or \"once in a blue moon.\"", "17K", ["990", "Comments"]], ["Two-thirds of parents also don't believe getting a flu shot for their child is more important this year", "2.4K", ["1.8K", "Comments"]], ["These companies are hiring:", "415", ["648", "Comments"]], ["It's a myth that women lose interest in sex as they enter midlife and beyond, according to new research.", "2K", ["1.7K", "Comments"]], ["The colors in our clothing often leave a toxic trail of environmental damage that has killed some rivers and rendered water undrinkable. CNN Style", "1.1K", ["347", "Comments"]], ["“This is five years straight we’ve had terrible fires, and it's a real scary thing. This is the new normal.” California residents grapple with losing their homes and belongings in devastating wildfires. Five of the state's most destructive wildfires have taken place in California's Wine Country over the past few years, CNN's Dan Simon reports. https://cnn.it/2GB5kc0 This originally aired Aug. 26, 2020.", "1.4K", ["600", "Comments"]], ["According to a CNN review, 45 states and the District of Columbia allow you to track your ballot just like an Amazon package or food delivery.", "5.8K", ["839", "Comments"]], ["Grocery stores are stocking up to avoid another pandemic shortage", "1.2K", ["864", "Comments"]], ["The four progressive Democratic congresswomen known as \"The Squad\" expressed surprise when Twitter posted about its policy against wishing harm or death to someone in light of President Donald J. Trump 's Covid-19 diagnosis. \"Seriously though, this is messed up. The death threats towards us should have been taking more seriously by [Twitter],\" Rep. Rashida Tlaib tweeted in response.", "71K", ["9K", "Comments"]], ["President Donald J. Trump's big-dollar fundraiser at his New Jersey golf club went on as planned Thursday night despite the President and staff knowing he had been exposed to coronavirus.", "14K", ["4.9K", "Comments"]], ["Voters in Geneva, Switzerland, have agreed to introduce a minimum wage that is the equivalent of $25 an hour.", "110K", ["8.2K", "Comments"]], ["“It was a tragic moment in our nation’s history, because he has now become a symbol for what we are all suffering — the failure of our federal government’s response to Covid this year.” - Historian Douglas Brinkley on President Trump’s hospitalization at Walter Reed following his coronavirus diagnosis https://cnn.it/3cUhWqQ", "1K", ["1.5K", "Comments"]], ["As a Georgia state trooper, Jacob Thompson was representative of the sort of trooper the agency coveted. Just last year, he was given a \"Trooper Of The Year\" award. On August 7, Thompson shot and killed Julian Lewis, a 60-year-old Black man, following a chase in the quiet town of Sylvania. He was fired a week later.", "1.4K", ["743", "Comments"]], ["CNN’s Dr. Sanjay Gupta explains typically how long it takes to develop symptoms and test positive for coronavirus after being exposed. https://cnn.it/2GuRecq", "302", ["407", "Comments"]], ["Attorney General William Barr is choosing not to quarantine after recently coming in close contact with members of President Donald J. Trump's inner circle who have tested positive for Covid-19, including former White House counselor Kellyanne Conway.", "37K", ["12K", "Comments"]], ["The next 48 hours will be critical for President Donald J. Trump as he fights Covid-19, a source familiar with the President's health tells reporters. https://cnn.it/3iq3IPx", "295", ["536", "Comments"]], ["One month before Election Day, Michigan voters dropping off their ballots react to President Donald J. Trump testing positive for coronavirus. https://cnn.it/3jt8bT7", "277", ["281", "Comments"]], ["Dr. Sean Conley, President Trump’s physician, says Trump is “doing very well.”  “At this time, the team and I are extremely happy with the progress the President has made.” https://cnn.it/33rIFrR", "628", ["880", "Comments"]], ["Before the event announcing President Trump's SCOTUS nominee, guests stopped in a small room in the White House basement. So began what many White House officials believe was a nexus for contagion that resulted in the positive tests of at least 7 attendees", "16K", ["3.3K", "Comments"]], ["The next 48 hours will be critical for President Donald J. Trump as he fights Covid-19, a source familiar with the President's health told reporters. https://cnn.it/3l9nNLL", "5.9K", ["5.1K", "Comments"]], ["Former New Jersey Gov. Chris Christie, who helped President Donald J. Trump prepare for the first presidential debate earlier this week, has tested positive for Covid-19, he announced on Twitter", "27K", ["5.1K", "Comments"]], ["Republican Sen. Ron Johnson of Wisconsin has tested positive for coronavirus after being exposed to someone with the virus earlier this week, according to his communications director, making him the third GOP senator to test positive in 24 hours.", "7.3K", ["2.2K", "Comments"]], ["Texas Gov. Greg Abbott is facing two separate federal lawsuits over his executive order that restricts ballot boxes to one per county in the sprawling state, a move opponents argue harms the nation's most vulnerable voters during the coronavirus pandemic and suppresses the vote.", "9.4K", ["1.2K", "Comments"]], ["For would-be voters in a handful of states, you'll need access to a printer to register to vote — a frustrating hurdle made more complicated by the pandemic. If you're printer-less and still hoping to vote, here's what to do.", "672", ["255", "Comments"]], ["Vice President Mike Pence and second lady Karen Pence tested negative for coronavirus Saturday morning, an administration official confirmed. President Trump and Pence will continue to be in touch by phone today, like any other day, the vice president’s office said.", "2.5K", ["1.4K", "Comments"]], ["Vice President Mike Pence and second lady Karen Pence tested negative for coronavirus Saturday morning, an administration official confirmed.  Pence is still planning to travel to Salt Lake City on Monday as planned, the official said.", "621", ["340", "Comments"]], ["Experts fear the infection potentially puts at risk hundreds of people who travel on, operate and maintain \"the flying White House\" — threatening not only a highly recognizable icon of America, but also the smooth operation of a key national security tool used to evacuate the president in a crisis.", "3.4K", ["1.6K", "Comments"]], ["Republican Sen. Ron Johnson of Wisconsin has tested positive for coronavirus after being exposed to someone with the virus earlier this week, according to his communications director, making him the third GOP senator to test positive in 24 hours.", "10K", ["3K", "Comments"]], ["A mask can say a lot about who wears it, and who doesn’t. Please wear a mask. #FactsFirst", "5.7K", ["1.3K", "Comments"]], ["The new James Bond film \"No Time to Die\" has been delayed a second time because of the coronavirus and will now be released almost a year behind schedule, delivering another big blow to Hollywood.", "2.6K", ["426", "Comments"]], ["It remains extremely rare for a president to stay overnight at a hospital, given the extensive medical facilities available at the White House. But Trump isn't the first president to do so, for a variety of reasons.", "1.3K", ["3.1K", "Comments"]], ["President Trump, first lady Melania Trump, top aide Hope Hicks, former White House counselor Kellyanne Conway, Trump campaign manager Bill Stepien, and Republican Sens. Thom Tillis and Mike Lee have all tested positive.", "4K", ["2.8K", "Comments"]], ["President Trump's campaign manager Bill Stepien has tested positive for coronavirus, according to a senior official -- becoming the latest figure in the President's inner circle to be infected with Covid-19.", "8.3K", ["2.7K", "Comments"]], ["President Trump remains in the hospital after announcing he tested positive for Covid-19. Here's what we know.", "2K", ["3K", "Comments"]], ["The Michigan Supreme Court has ruled that Democratic Gov. Gretchen Whitmer had no authority to issue or renew executive orders relating to Covid-19 beyond April 30", "9.8K", ["3.3K", "Comments"]], ["Republican Sens. Mike Lee and Thom Tillis both sit on the Senate panel overseeing hearings on Judge Amy Coney Barrett's nomination to the Supreme Court", "6.9K", ["2.4K", "Comments"]], ["President Donald J. Trump's campaign manager Bill Stepien has tested positive for coronavirus, according to a senior official, becoming the latest figure in the President's inner circle to be diagnosed with Covid-19", "35K", ["9.1K", "Comments"]], ["The decision comes after Joe Biden's campaign raised health concerns about the initial seven-feet distance planned at the seated vice presidential debate. Pence and Harris both tested negative for Covid-19 on Friday morning.", "5.6K", ["1.7K", "Comments"]], ["President Trump is now “in a race” against coronavirus, the CEO of biotechnology company Regeneron said after the drugmaker provided a dose of its experimental antibody treatment to the President on Friday", "7.7K", ["3.6K", "Comments"]], ["JUST IN: Former White House adviser Kellyanne Conway says she has tested positive for Covid-19", "83K", ["17K", "Comments"]], ["The New York-based biotech company has confirmed that it provided an experimental antibody therapy to treat President Trump", "2.3K", ["2.1K", "Comments"]], ["Military leaders moved quickly to reassure the American public following President Trump's Covid-19 diagnosis, making it clear there was no indication of an immediate threat to the US homeland from a foreign adversary", "2.2K", ["3.1K", "Comments"]], ["Former President Obama wished President Trump and first lady Melania Trump good care and \"a speedy recovery\" on Friday after they were diagnosed with Covid-19", "26K", ["4.6K", "Comments"]], ["President Trump is currently at Walter Reed National Military Medical Center after announcing that he had tested positive for Covid-19. If you're just reading in now, here's a recap of the latest developments.", "1.1K", ["1.9K", "Comments"]], ["National Security Council staff are now required to wear masks in all White House common areas and \"to avoid unnecessary visits\" to the West Wing, according to an email sent to all NSC staff", "12K", ["3.7K", "Comments"]], ["\"I want to thank everybody for the tremendous support.\" In his first tweet since announcing he had tested positive for Covid-19, President Trump shared words of thanks and encouragement during a short 18-second video. https://cnn.it/36sutkj", "3.6K", ["3K", "Comments"]], ["President Trump boarded Marine One to travel to Walter Reed hospital after being diagnosed with Covid-19. He walked out of the residence of the White House wearing a mask and a suit. He waved to the media but did not stop to talk. https://cnn.it/2GzXNdO", "5.7K", ["4.6K", "Comments"]], ["This is a mask, not a political statement. Please wear a mask. #FactsFirst", "19K", ["1.7K", "Comments"]], ["Joe Biden's campaign is pulling all negative ads Friday following President Trump's diagnosis with Covid-19, a campaign aide says", "68K", ["13K", "Comments"]], ["BREAKING: President Trump is headed to Walter Reed hospital after being diagnosed with Covid-19, according to the White House", "33K", ["14K", "Comments"]], ["Go There heads to Portland, Oregon, to report on the protests that have been going on for months as part of an anti-police movement that shows no signs of stopping. Rallies have also been held by far-right groups including the Proud Boys, who were mentioned in a heated moment earlier this week at the first presidential debate. We follow CNN’s Elle Reeve, who spent a month speaking to activists and attendees at these events as tensions remained high.", "1.7K", ["1.6K", "Comments"]], ["At least three journalists who work at the White House have tested positive for coronavirus, according to the White House Correspondents Association", "28K", ["4.9K", "Comments"]], ["Senate Judiciary Chairman Lindsey Graham says President Trump is \"very focused\" on getting Amy Coney Barrett onto the Supreme Court and said that confirmation hearings remain \"on track\" after the news of the President's coronavirus diagnosis.", "5.5K", ["2.2K", "Comments"]], ["First lady Melania Trump says she is experiencing \"mild symptoms\" but is \"looking forward to a speedy recovery\" following her Covid-19 diagnosis", "5.1K", ["3.3K", "Comments"]], ["The first image of a black hole, captured in 2019, has revealed more support for Albert Einstein's theory of general relativity. The new finding has suggested his theory is now 500 times harder to beat.", "10K", ["1.1K", "Comments"]], ["JUST IN: The highly anticipated audio recordings of the secret grand jury proceedings in the Breonna Taylor case have been submitted to a Kentucky court and made public following a two-day delay.", "3.5K", ["1.6K", "Comments"]], ["First lady Melania Trump confirms that she also has mild symptoms of coronavirus, but added she is “overall feeling good.”  \"Thank you for the love you are sending our way. I have mild symptoms but overall feeling good. I am looking forward to a speedy recovery,\" she said.", "5.2K", ["3.1K", "Comments"]], ["JUST IN: Joe Biden and his wife, Dr. Jill Biden, have tested negative for coronavirus, according to the Bidens’ primary care physician. The Democratic nominee shared the debate stage with President Donald J. Trump on Tuesday.", "148K", ["9.3K", "Comments"]], ["Ronna McDaniel, the chairwoman of the Republican National Committee, has tested positive for coronavirus, an official told CNN Friday.", "8.8K", ["2.2K", "Comments"]], ["17 million followers and counting. She joined Twitter, then her husband followed her lead. How did Michelle Obama’s Twitter account transform the way the White House communicates to the world? Watch the series premiere of #FirstLadies, Sunday at 10 p.m. ET", "2.1K", ["834", "Comments"]], ["The White House says Trump has \"mild symptoms\" after testing positive for coronavirus, but here's what happens if he gets too sick to fulfill his role as President. | Analysis by Zachary B. Wolf", "3.2K", ["2.7K", "Comments"]], ["Russia's Vladimir Putin: \"I am sure that your inherent vitality, good spirits and optimism will help you cope with the dangerous virus.\" Germany's Angela Merkel: \"I send all my best wishes to Donald and Melania Trump. I hope that you will get over the #corona infection and will soon be completely healthy again. @POTUS @FLOTUS.\" Israel's Benjamin Netanyahu: \"Like millions of Israelis, Sara and I are thinking of President Donald Trump and First Lady Melania Trump and wish our friends a full and speedy recovery.\"", "8.2K", ["3.6K", "Comments"]], ["\"The most serious known threat to a commander-in-chief's health for decades calls for unity since it can bear on the security of the nation itself,\" CNN's Stephen Collinson writes.", "1.8K", ["1.7K", "Comments"]], ["President Trump's Supreme Court nominee Amy Coney Barrett tested negative for coronavirus on Friday, according to White House spokesperson Judd Deere. He added that Barrett, who is tested daily, is following CDC guidance and was last with the President on Saturday when she was officially nominated.", "3.9K", ["1.1K", "Comments"]], ["House Speaker Nancy Pelosi reacts to Preisdent Trump testing positive for coronavirus: “As sad as the diagnosis is that the President and first lady have, maybe it is the pivotal moment to take us to a different place as we fight this vicious virus based on science, not on politics.\" https://cnn.it/2Sjxs67", "22K", ["821", "Comments"]], ["President Trump and first lady Melania Trump have tested positive for Covid-19 and are now isolating. CNN’s John Harwood is live from the White House monitoring the latest developments. What questions do you have for him?", "5.8K", ["5.8K", "Comments"]], ["The White House is doing contact tracing on people who have been in touch with President Trump and Hope Hicks, a White House official tells CNN.", "3.4K", ["1.5K", "Comments"]], ["At least 11 people tested positive for coronavirus at a US Secret Service training center in Maryland in August, the New York Times reports.", "1K", ["371", "Comments"]], ["The Democratic presidential nominee is expected to get tested for coronavirus this morning, according to a source familiar with his plans. Trump and Biden shared the debate stage Tuesday night during the first presidential debate.", "4.4K", ["1.2K", "Comments"]], ["“I’m feeling fantastic,” he told reporters, adding that he had not interacted with President Donald Trump since September 15.", "2.3K", ["705", "Comments"]], ["The residence staff, who serve, cook and clean for the first family, is \"very careful, but there is concern,\" the source said.", "8K", ["3.5K", "Comments"]], ["Stocks are set to plunge at the opening bell Friday after President Trump disclosed that he and First Lady Melania Trump have tested positive for Covid-19. The news adds to the uncertainty about the election and the future of more economic stimulus. More financial aid is needed as the government reported Friday that fewer jobs were added in September than expected and that the unemployment rate, while down from August, remains at a historically elevated level of 7.9%.", "2.3K", ["2.5K", "Comments"]], ["JUST IN: The US added 661,000 jobs in September, and unemployment fell to 7.9%. The rate has never been this high going into an election.", "3.3K", ["1.8K", "Comments"]], ["“I am sure that your inherent vitality, good spirits and optimism will help you cope with the dangerous virus,” the Russian president said, according to a Kremlin readout of the telegram.", "14K", ["3.6K", "Comments"]], ["Former New Jersey Gov. Chris Christie, who helped President Trump with presidential debate prep, says \"no one was wearing masks\" as \"5 or 6 people\" helped him get ready for the contest. The former New Jersey governor says he will be tested this morning.", "5.6K", ["1.8K", "Comments"]], ["Donald Trump has several risk factors for more severe Covid-19 symptoms, including his age and body mass index.  Still, “the odds are very much in his favor. I don’t want to unsettle people too much with this. You know, greater than 90% - 95% chance that he will get through this, still,” said Dr. Sanjay Gupta.", "7.4K", ["4.2K", "Comments"]], ["\"Karen and I send our love and prayers to our dear friends President @realDonaldTrump and @FLOTUS Melania Trump. We join millions across America praying for their full and swift recovery,\" Pence tweeted.", "8.6K", ["4.1K", "Comments"]], ["JUST IN: Vice President Mike Pence and second lady Karen Pence tested negative for coronavirus Friday morning, according to a spokesman.", "4K", ["1.6K", "Comments"]], ["Democratic presidential nominee Joe Biden is expected to get tested for coronavirus this morning according to a source familiar with his plans. The former vice president shared the same stage as President Trump on Tuesday night for the first presidential debate. \"He does need to be immediately tested,\" CNN's Chief Medical Correspondent Dr. Sanjay Gupta said. \"He has come in proximity to someone that has Covid.\"", "13K", ["2.6K", "Comments"]], ["Only hours before announcing his diagnosis, Trump told a virtual audience the pandemic was nearing an end. \"I just want to say that the end of the pandemic is in sight, and next year will be one of the greatest years in the history of our country,\" Trump said during pre-recorded remarks.", "9.8K", ["3.8K", "Comments"]], ["\"On a tactical level... this is a moment of prime vulnerability. We know our adversaries, whether it be nation states or criminal actors look for vulnerabilities in the national security apparatus,\" CNN National Security Analyst Samantha Vinograd said.", "2.7K", ["2.2K", "Comments"]], ["He is in a high-risk group simply by virtue of his age -- he is 74 -- and is clinically obese, and another risk factor for a more severe form of the illness.", "16K", ["9K", "Comments"]], ["With less than 5 weeks to the election, what could one of the vice-presidential candidates say to win or change your vote? Pence and Harris face off in the only VP debate of 2020, special live coverage starts Wednesday at 7 p.m. ET", "1.1K", ["691", "Comments"]], ["The UK Prime Minister sent his \"best wishes\" to Donald and Melania Trump after the Presidential couple tested positive for Covid-19.  Johnson spent several days in an intensive care unit after being diagnosed with Covid-19 in April.", "3.8K", ["894", "Comments"]], ["• Hope Hicks, a close aide to Trump, tested positive for Covid-19. • A small group of White House officials knew by Thursday morning that Hicks had contracted Covid-19, according to CNN White House Correspondent Kaitlan Collins -- but Trump still took a trip to New Jersey for a fundraiser. • Midnight on Thursday: Trump confirms both he and Melania had tested positive.... •  Trump's physician's statement said, \"The President and First Lady are both well at this time, and they plan to remain at home within the White House during their convalescence.\" See More", "5.2K", ["2.9K", "Comments"]], ["A small group of White House officials knew by Thursday morning that Hicks had contracted Covid-19, according to CNN Correspondent Kaitlan Collins -- but Trump still took a trip to New Jersey for a fundraiser.", "13K", ["3.5K", "Comments"]], ["\"He does need to be immediately tested. He has come in proximity to someone that has Covid.\" Former US vice president and Democratic presidential nominee Joe Biden needs to be tested for Covid-19 after having been on the same stage as President Donald Trump on Tuesday night, said Dr. Sanjay Gupta.", "9.4K", ["3K", "Comments"]], ["There are many questions going forward -- including who else may have been exposed to the virus and what the President and the first lady will need to do now.", "1.9K", ["1.2K", "Comments"]], ["\"He is in an age group that does carry a risk for severe Covid.\" Epidemiologist Anne Rimoin describes US President Donald Trump's Covid-19 diagnosis as \"very concerning.\" https://cnn.it/36nFNhu", "3.9K", ["2.2K", "Comments"]], ["Removing gravity from the equation means that nothing functions in space the way it does on Earth, especially when it comes to toilets", "3.9K", ["225", "Comments"]], ["US stock futures plunged Friday after President Donald Trump said that he and First Lady Melania Trump have tested positive for coronavirus.", "3.8K", ["1.6K", "Comments"]], ["\"This evening I received confirmation that both President Trump and First Lady Melania Trump have tested positive for the SARS-CoV-2 virus,\" Sean P. Conley wrote. \"The President and First Lady are both well at this time, and they plan to remain at home within the White House during their convalescence.\"", "9.5K", ["5.1K", "Comments"]], ["The drones are being used to disinfect the seating bowl, handrails and glass partitions in the stadium after event", "627", ["145", "Comments"]], ["President Trump and first lady Melania Trump tested positive for coronavirus, the President announced early Friday morning, an extraordinary development coming months into a global pandemic and in the final stretch of his reelection campaign. cnn.it/3iiwMIJ", "3.1K", ["2.7K", "Comments"]], ["JUST IN: President Trump tweets that he and first lady Melania Trump have tested positive for the coronavirus. A White House official described President Trump's condition as having \"mild symptoms\" of the coronavirus.", "45K", ["14K", "Comments"]], ["The Commission on Presidential Debates did not specify what changes it would be making, but said it would be adding \"additional structure\" to the format of the debates \"to ensure a more orderly discussion of the issues\"", "2K", ["1K", "Comments"]], ["An analysis of decision-making and key advisory bodies from 87 countries found that over 85% contain mostly men and only 11% contain predominantly women", "1.3K", ["752", "Comments"]], ["Fox News paid the former assistant to ex-host Kimberly Guilfoyle upward of $4 million to avoid going to trial after the employee wrote a 2018 draft complaint detailing allegations of sexual harassment against her, The New Yorker reports", "6.7K", ["1.6K", "Comments"]], ["The first lady was secretly recorded in the summer of 2018 expressing her frustration at being criticized for the President's family separation policy", "28K", ["6.9K", "Comments"]], ["President Trump says he and first lady Melania Trump will begin the “quarantine process” after top aide Hope Hicks tests positive for Covid-19 cnn.it/33n9JbA", "960", ["822", "Comments"]], ["JUST IN: President Trump says he and the first lady will begin a \"quarantine process\" as they await test results after top aide Hope Hicks tested positive for Covid-19", "13K", ["2.7K", "Comments"]], ["Matthew Graham and his wife, Jessica, had taken their five kids to meet his brother's new puppy last month when a wildfire ripped through Walden, Washington, destroying their home and almost everything they owned. Two weeks later, all seven of them tested positive for Covid-19.", "6.8K", ["584", "Comments"]], ["The companies' names included Khaleesi LLC, Night's Watch LLC and White Walker LLC, the indictment alleges", "1.3K", ["287", "Comments"]], ["Experts say they think President Trump is increasing the risk of chaos on the ground through his constant attacks on the validity of the election", "2.9K", ["2.7K", "Comments"]], ["It's the first time the company has shed light on how its workforce has been impacted by Covid-19", "5.2K", ["765", "Comments"]], ["JUST IN: Hope Hicks, one of President Trump's top aides, has tested positive for coronavirus, sources say. She traveled with the President to the debate in Cleveland and was seen boarding Marine One on Wednesday.", "23K", ["7.8K", "Comments"]], ["Alrighty then", "37K", ["1.8K", "Comments"]], ["The House has approved a $2.2 trillion coronavirus stimulus proposal put forward by Democrats, yet there's no bipartisan deal in sight", "7.8K", ["3.3K", "Comments"]], ["The CDC recommends that you wash your hands with soap and water thoroughly after touching your pet or anything in its environment, and to keep pets out of the kitchen or in areas where you eat, store or prepare food", "1.2K", ["436", "Comments"]], ["Amazon.com has pulled merchandise featuring the words \"stand back\" and \"stand by,\" a phrase now associated with the Proud Boys, a far-right collective that the Southern Poverty Law Center says is a hate group. President Donald J. Trump said the words at Tuesday's debate when he refused to condemn White supremacists for inciting violence at anti-police brutality demonstrations across the country.", "27K", ["5.5K", "Comments"]], ["The revelations from the New York Times report raise a number of new questions about the President's finances — and leave some existing ones unanswered", "1.1K", ["1.8K", "Comments"]], ["\"It was frustrating for me because I tried hard to prepare for a serious debate, much more frustrating and more importantly for the American people because they didn't get the debate they wanted, that they deserved,\" the Fox News anchor said", "18K", ["6.4K", "Comments"]], ["President Trump did not condemn White supremacists during the presidential debate for inciting violence at anti-police brutality demonstrations across the US. CNN’s Elle Reeve goes to an event by Proud Boys, a far-right group praising Trump. https://cnn.it/3jl02A9", "23K", ["18K", "Comments"]], ["Go There takes a closer look at how the pandemic is continuing to impact different parts of the world. CNN's Matt Rivers reports from Mexico City, where some neighborhoods lack access to running water, making it difficult for residents to wash their hands and practice good hygiene. Meanwhile, CNN's Anna Stewart is in London to cover the latest on the new contact tracing app being used in England and Wales.", "1.2K", ["278", "Comments"]], ["Go There heads to Rome as Italy takes on new precautions to prevent getting hit with a second wave of coronavirus. Schools have reopened with masks, temperature checks, and staggered entrance times, while Rome’s main airport has implemented rapid testing for passengers. We follow CNN’s Delia Gallagher as she takes a closer look at the new steps being taken to protect Italy amid the pandemic.", "765", ["177", "Comments"]], ["It's the clearest sign yet that President Trump's nominee for the Supreme Court, Judge Amy Coney Barrett, may have questioned Roe v. Wade as a law professor before she took the bench", "6.5K", ["2.7K", "Comments"]], ["Facebook is pushing groups further into the spotlight, while also introducing new tools to help tamp down unsavory content.", "202", ["231", "Comments"]], ["\"We are finally cleaning up some of the inequities of the past by pardoning 2,732 convictions for Coloradans who simply had an ounce of marijuana or less,\" Colorado Gov. Jared Polis said", "27K", ["1.1K", "Comments"]], ["CDC experts believe that social distancing, mask-wearing and school closures might have critically crippled flu season in Southern Hemisphere countries. They hope similar efforts will have the same impact in the Northern Hemisphere.", "1.6K", ["510", "Comments"]], ["🔊Sound On🔊 The most influential women in the world are coming to CNN. Get ready for the new CNN Original Series #FirstLadies. Premieres Sunday at 10 p.m. ET", "608", ["441", "Comments"]], ["According to a CNN review, 45 states and the District of Columbia allow you to track your ballot just like an Amazon package or food delivery.", "5.5K", ["1.2K", "Comments"]], ["Critical race theory is a concept that seeks to understand inequality and racism in the US. To get a deeper understanding of what the theory is — and isn't — we talked to one of the scholars behind it.", "572", ["1.2K", "Comments"]], ["The U.S. Army has seen a worrisome increase in soldier deaths by suicide since March, raising questions about whether troops feeling isolated due to the coronavirus pandemic may be a contributing factor.", "3.1K", ["844", "Comments"]], ["The proposal for fiscal year 2021 allows 3,000 fewer refugees than in the last fiscal year", "3.2K", ["1.8K", "Comments"]], ["\"The fatal flaw in the Trump-Biden debate was not giving the moderator, Chris Wallace, the power to compel the candidates to follow the rules they'd agreed to,\" Errol Louis writes for CNN Opinion.", "725", ["1.5K", "Comments"]], ["The West Wing wanted to \"portray confidence and make the public believe there was absolutely nothing to worry about,\" one administration official said, revealing the image-conscious reason for the White House's opposition to masks.", "2.3K", ["1.2K", "Comments"]], ["It's clear Joe Biden and Kamala Harris want to avoid making Supreme Court changes, including expanding the current nine-justice bench, a topic of discussion before the election and instead focus on what the SCOTUS fight could mean for the future of the Affordable Care Act.", "1.9K", ["1.9K", "Comments"]], ["GOP Sen. John Barrasso says President Trump should condemn White supremacist groups.  “I think we should hear [those words] from the President and from every American. I certainly condemn what we’ve been seeing in terms of White supremacy, in terms of racism, anti-Semitism,” he says. https://cnn.it/3l52Ce0", "394", ["749", "Comments"]], ["While life has largely returned to normal in recent months, the upcoming \"Golden Week\" holiday will be an ambitious test of China's success in taming the virus", "745", ["658", "Comments"]], ["\"The word that perhaps best describes the President Donald J. Trump's debate style — emotional — is almost totally absent from the coverage of the event because the candidates are both men, and the term typically reserved for women,\" Jill Filipovic writes for CNN Opinion.", "4.2K", ["3K", "Comments"]], ["American and United Airlines are cutting 32,000 jobs as federal aid plans stall.  “I don't know if I’m going to be able to find a new job soon with the job market that we're working with. I'm going to be losing my health care,” flight attendant Angela Frid told CNN’s Pete Muntean. https://cnn.it/3l51Mhm", "123", ["150", "Comments"]], ["Fast-fashion retailer H&M is closing 250 stores, about 5% of its worldwide total, next year as people are increasingly shopping online.", "3.7K", ["594", "Comments"]], ["President Donald J. Trump lied about a wide variety of topics — including health care, the economy and the coronavirus pandemic — during Tuesday's presidential debate. But he was especially dishonest on the subject of voting by mail.", "8.3K", ["6.4K", "Comments"]], ["A small, secretive group of experts studies vaccine data before anyone else does. The Data and Safety Monitoring Board can advise companies to apply for an FDA review or halt a trial. Dr. Sanjay Gupta looks at the board’s process as it oversees Covid-19 vaccine trials. https://cnn.it/36mbM1u", "244", ["174", "Comments"]], ["California Gov. Gavin Newsom has signed a bill establishing a task force to study and make recommendations on reparations for slavery", "5.4K", ["3.1K", "Comments"]], ["Stocks are set to kick off the month of October and the fourth quarter with gains. Stocks plummeted in September but still posted solid returns for the third quarter overall. Investors continue to express hopes that Congress and the White House can come to an agreement on more stimulus for consumers, especially after 837,000 more people filed for unemployment claims last week. That's still a highly elevated number but it's lower than what Wall Street expected and also below last week's total. In corporate news, consumers still appear to be shopping at the grocery store. Pepsi, ConAgra and Corona owner Constellation Brands all reported earnings and sales that topped forecasts.", "2.3K", ["2K", "Comments"]], ["A 22-year-old woman died of severe injuries in India after being allegedly gang raped on Tuesday, according to authorities — the same day another 19-year-old woman died from a separate gang rape incident.", "2.7K", ["759", "Comments"]], ["JUST IN: Another 837,000 Americans filed for first-time unemployment benefits last week, on a seasonally adjusted basis, as America's jobs recovery continues, albeit at a slow pace.", "7.3K", ["3.4K", "Comments"]], ["“They give me 30 days. I’m just thinking about my kids. Where do I go with my kids?” Tenants in Columbus, Ohio, are facing eviction as they struggle to pay rent during the pandemic. CNN's Kyung Lah explains why this is happening despite a national moratorium on evictions. https://cnn.it/3iohv9o", "138", ["139", "Comments"]], ["Are you having trouble voting by mail or in person? Have you received disinformation?", "277", ["509", "Comments"]], ["Did she have the right to bare arms? See how Michelle Obama changed the conversation about the First Lady’s appearance just by going sleeveless. Watch the series premiere of #FirstLadies, Sunday at 10 p.m. ET", "1.6K", ["864", "Comments"]], ["A college freshman at Stephen F. Austin State University in Texas was sound asleep when campus police entered her room last month at 3 a.m., with one officer's gun drawn, her lawyer and university officials say.", "17K", ["3.5K", "Comments"]], ["Go There heads to Santa Rosa, California, where massive wildfires have been tearing through the West Coast at a rate of one acre every five seconds. Thousands of people have evacuated as experts continue to warn of the serious implications of global climate change on the region. We follow CNN’s Josh Campbell as he walks us through a neighborhood destroyed.", "1.2K", ["419", "Comments"]], ["The Glass and Zogg fires in California have killed four people and torn through more than 100,000 acres in a matter of days", "886", ["304", "Comments"]], ["Economists expect an unemployment rate of 8.2% — only slightly less than in August — in Friday's jobs report. It would be the highest jobless rate on record (going back to World War II) as Americans head to the polls.", "2.9K", ["2.4K", "Comments"]], ["The new clusters are a \"stark reminder\" that the state is still not out of the woods when it comes to the pandemic, Gov. Andrew Cuomo says.", "1.1K", ["352", "Comments"]], ["In the wake of the US Presidential Debate on Tuesday night, Google searches for \"move to New Zealand\" from US users jumped, even before Prime Minister Jacinda Ardern and opposition leader Judith Collins took the stage in Auckland a few hours later, writes CNN's Ben Westcott", "3.3K", ["1K", "Comments"]], ["Children can spread coronavirus among themselves efficiently, but young adults are the primary source of coronavirus spread, according to a study published Wednesday.", "673", ["296", "Comments"]], ["While the moon won't actually look blue, the second full moon in one month is usually referred to as a blue moon.  This happens every 2.5 to three years, or \"once in a blue moon.\"", "100K", ["2.4K", "Comments"]], ["President Donald Trump's failure yet again to unequivocally condemn White supremacy Wednesday -- to clear up a chilling moment from his debate clash with Democratic nominee Joe Biden -- shows how he may find it impossible to reboot for their next crucial contest, writes CNN's Stephen Collinson.", "2.8K", ["5.8K", "Comments"]], ["\"On this darkest of days, we will grieve, we will cry our eyes out. But we will hug and love each other harder and get through it.\" Chrissy Teigen and John Legend have lost their child following pregnancy complications, the couple announced.", "144K", ["12K", "Comments"]], ["For years, conservationists struggled to save endangered puffins -- until they used fake birds to encourage real ones to nest: https://cnn.it/3jeAHHX #CallToEarth #PerpetualPlanet", "1.5K", ["153", "Comments"]], ["More Than a Vote -- a voting rights organization led by NBA star LeBron James -- reached a major milestone this week in its effort to combat systemic, racist voter suppression.", "15K", ["1.9K", "Comments"]], ["The settlement will be divided among more than 4,000 claimants in the class action suit", "2.1K", ["503", "Comments"]], ["Starting next year, public companies headquartered in California will be legally required to diversify their boards racially, ethnically and in terms of sexual and gender identity", "8.1K", ["3.1K", "Comments"]], ["\"The Electoral College never fully operated as intended — undergoing significant revision early in US history and continuing to evolve over time,\" Robert Alexander writes for CNN Opinion. \"Today's version bears little resemblance to the Founders' vision.\"", "1.7K", ["1.9K", "Comments"]], ["Brad Parscale has stepped down from his role as a senior adviser to President Trump's campaign, sources say", "4.1K", ["1.6K", "Comments"]], ["Facebook says it will not accept ads that seek to delegitimize the results of the 2020 US election or that speculate voting will lead to illegitimate outcomes", "3.2K", ["1.1K", "Comments"]], ["The malaria drug hydroxychloroquine — which President Trump said he took in the hope of warding off Covid-19 — was found not to prevent infections among volunteers, according to a new study", "6.3K", ["3.3K", "Comments"]], ["In addition to American, United Airlines has warned 12,000 employees that they are at risk of job losses. Some 17,000 other employees throughout the US airline industry have been notified their jobs are also at risk.", "2.2K", ["634", "Comments"]], ["\"The debate will be remembered not for the policies debated, but rather for the President of the [US] acting like an angry, out of control toddler whenever any attention was directed toward his calm and dignified opponent,\" writes Paul Callan for CNN Opinion", "1.3K", ["914", "Comments"]], ["\"Trump's default setting is chaos, and he believes that by creating it he can 'win,'\" writes CNN's Chris Cillizza. \"There are no rules that can be made to prevail in that case.\"", "974", ["1.1K", "Comments"]], ["Some of the President's allies say they believe he crashed and burned on a night that mattered to his re-election", "7.4K", ["3.3K", "Comments"]], ["\"The day after the debate debacle, and the question tonight really is 'now what?' 73 million people witnessed last night's so-called debate and it's pretty clear this is the way it's going to be.\" On the future of the 2020 presidential election, Anderson Cooper is #KeepingThemHonest.", "481", ["497", "Comments"]], ["The far-right group’s leader believes the President was telling them they should just keep doing what they’re doing", "10K", ["5.2K", "Comments"]], ["They stood beside the most powerful man in the world, but they were second to none. Learn the journeys of six former #FirstLadies in a brand-new CNN Original Series, starting Sunday at 10 p.m. ET", "4.7K", ["2.2K", "Comments"]], ["A federal judge in Montana has rejected the Trump campaign's effort to stop an expansion of mail-in voting in the state", "5.9K", ["1.2K", "Comments"]], ["Brazil's President Jair Bolsonaro has slammed US presidential candidate Joe Biden for his remarks about the Amazon rainforest during Tuesday's presidential debate, saying it was \"difficult to understand such a disastrous and unnecessary declaration\"", "5.9K", ["3.2K", "Comments"]], ["But by funding the government only until mid-December, the legislation still sets up the possibility of a funding fight and potential shutdown after the election and just before the start of a new Congress", "866", ["579", "Comments"]], ["\"By saying unequivocally, that he has paid 'millions of dollars' in federal income taxes, Trump is directly disputing the Times report,\" writes CNN's Chris Cillizza. \"But here's the thing: The Times has the receipts. Literally.\"", "793", ["928", "Comments"]], ["House Democrats will hold off on a planned vote on their $2.2 trillion stimulus proposal to allow more time for bipartisan negotiations in an attempt to reach a deal", "2.5K", ["1.6K", "Comments"]], ["Initial reports suggest three rockets struck a base where US troops are located in Iraq, a US defense official says. There are no reports of US injuries or damage so far.", "2.1K", ["1.4K", "Comments"]], ["Texas officials say it could take months to disinfect the brain-eating amoeba contaminated water that claimed the life of a 6-year-old boy", "5.7K", ["1.4K", "Comments"]], ["Go There heads to Santa Rosa, California, where massive wildfires have been tearing through the West Coast at a rate of one acre every five seconds. Thousands of people have evacuated as experts continue to warn of the serious implications of global climate change on the region. We follow CNN’s Josh Campbell as he walks us through a neighborhood destroyed.", "3K", ["1K", "Comments"]], ["Clare Bronfman, heiress to the Seagram liquor fortune, was sentenced to nearly seven years in prison on charges stemming from her involvement with the cult-like group Nxivm", "1.8K", ["435", "Comments"]], ["The Commission on Presidential Debates says it will be making changes to the format of the remaining presidential debates after the first debate between Democratic nominee Joe Biden and President Trump devolved into a chaotic disaster.", "7.9K", ["4K", "Comments"]], ["\"Both were despicable! It was disgusting and shameful. No winners!\" one viewer said. \"I am embarrassed to be an American citizen today,\" another viewer admitted.", "3.8K", ["5.4K", "Comments"]], ["The melting today on Greenland's ice sheet is roughly equal to the greatest rates of ice loss in the last 12,000 years, a new study shows. But if greenhouse gas emissions are not curbed, the ice sheet could see unprecedented levels of melting later this century at almost six times what they are today.", "2K", ["1K", "Comments"]], ["The Louisville police officer who fatally shot Breonna Taylor is currently raising money to fund his retirement. Detective Myles Cosgrove was one of three Louisville officers who fired shots into Taylor's apartment last March after breaking in to serve a search warrant related to Taylor's ex-boyfriend.", "17K", ["5.6K", "Comments"]], ["After a five-month battle with leukemia, the first known person to be cured of HIV has died of cancer, according to the International AIDS Society. Timothy Ray Brown, also known as \"the Berlin patient,\" was 54.", "6.1K", ["850", "Comments"]], ["The release of grand jury recordings in the Breonna Taylor case will be delayed until noon Friday, according to a judge's order.", "7.4K", ["2.1K", "Comments"]], ["With less than 5 weeks to the election, what could one of the vice-presidential candidates say to win or change your vote? Pence and Harris face off in the only VP debate of 2020, special live coverage starts Wednesday, October 7th at 7 p.m. ET", "37K", ["9K", "Comments"]], ["Previous research in 2016 showed that 20% of plant species were under threat, but the \"State of the World's Plants and Fungi 2020\" report draws on the work of 210 scientists from 42 countries to reveal the scale of the problem, using improved data and methodology.", "2K", ["521", "Comments"]], ["The agreement, once it is signed into law, will take the threat of a shutdown prior to the November presidential election off the table, even as it sets up the possibility of a funding fight and potential shutdown after the election and just before the start of a new Congress.", "495", ["251", "Comments"]], ["Chad Wolf's nomination to be Department of Homeland Security secretary has moved ahead following a party-line vote by the Senate Homeland Security Committee", "1.3K", ["433", "Comments"]], ["Six in 10 debate watchers say Democratic nominee Joe Biden did the best job in Tuesday's debate, and just 28% say President Donald J. Trump did, according to a CNN Poll of debate watchers conducted by SSRS.", "22K", ["8.1K", "Comments"]], ["In the 2020 fiscal year, which ends Wednesday, 21 people died in ICE custody, according to a CNN tally of data released by the agency. That's more than double the number of deaths in fiscal year 2019 — and the highest annual death toll since 2005.", "5.5K", ["1.1K", "Comments"]], ["“Does your president understand at all what you’re going through? … I think he basically looks down on us,” Joe Biden says as he sets off on a campaign train tour after last night’s debate with President Trump. https://cnn.it/34cFjYL", "540", ["563", "Comments"]], ["\"This was the worst presidential debate in history,\" Todd Graham writes for CNN Opinion. \"Though moderator Chris Wallace, President Trump and Joe Biden were bad, they don't share equal responsibility. And they're not the only ones to blame.\"", "3.5K", ["2.3K", "Comments"]], ["“It was like watching my own children having a disagreement at home.” “President Trump clearly has control issues. He couldn’t stop his anger.” Undecided Ohio voters discuss the first presidential debate.... https://cnn.it/2GiD3aa See More", "441", ["610", "Comments"]], ["President Donald J. Trump turned his first debate with Democratic rival Joe Biden into a chaotic disaster. Biden largely responded to Trump’s obfuscations and interruptions with eye rolls, head shakes, chuckles and “C’mon, man” comments. But Biden made it clear how little he thinks of Trump when he responded to a series of interruptions by saying: “Will you shut up, man?” https://cnn.it/30nJnnX", "14K", ["5.1K", "Comments"]], ["\"This was an awful debate that did absolutely nothing to educate the public about the two candidates and what they would do if given four years to serve as president of the US,\" Chris Cillizza writes.", "1.4K", ["1.8K", "Comments"]], ["Stocks are set to fall slightly at the open Wednesday as investors analyze what was a highly contentious debate between President Trump and Joe Biden. Trump’s refusal to agree that he would concede in a timely fashion if the results show he lost are fueling more worries about how long the post-election drama will last. In economic news, payroll processor ADP said 749,000 private sector jobs were added in September, more than expected. That may raise hopes for a solid jobs report from the government Friday — the last monthly jobs report before the election. But layoffs are still mounting. Disney announced 28,000 job cuts late Tuesday, as the company’s theme parks business has been hit hard by the Covid-19 pandemic.", "2.8K", ["3.1K", "Comments"]], ["The Merriam-Webster Dictionary said terms like white supremacist, antifa, fascism and racism were all trending after the debate.", "1K", ["1.6K", "Comments"]], ["Joe Biden's campaign broke its single-hour fundraising record during the debate, raising $3.8 million between 10 p.m. and 11 p.m., the campaign says.", "95K", ["10K", "Comments"]], ["\"Trump basically moderated the debate -- and Biden took full advantage of his behavior and used it as an argument to end Trump's presidency,\" writes CNN's Brian Stelter.  \"Biden occasionally reminded me of Jim Halpert on \"The Office,\" peering into the camera as if to say, \"can you believe this guy is the boss?\"\"", "38K", ["13K", "Comments"]], ["The human tendency to believe change is temporary and that the future will again resemble the past is called \"normalcy bias.\" Eventually, however, people need to adapt to change, psychologists say.", "8.4K", ["2.3K", "Comments"]], ["Williams was bidding to win a record-equaling 24th grand slam title at Roland Garros", "2.3K", ["349", "Comments"]], ["President Donald Trump offered Judge Amy Coney Barrett the Supreme Court nomination on the same day he met with her, less than 72 hours after the death of Justice Ruth Bader Ginsburg, according to Barrett's Senate questionnaire", "8.2K", ["3.3K", "Comments"]], ["Any room in the middle? #CNNElection", "1.5K", ["424", "Comments"]], ["Serena Williams has pulled out of the French Open with an Achilles injury ahead of her scheduled second-round match against Tsvetana Pironkova", "650", ["192", "Comments"]], ["A 29-year-old man is facing attempted murder charges, authorities announced", "1.3K", ["1K", "Comments"]], ["This firefighter was driving home after a 60-hour shift with the San Jose Fire Department when his girlfriend called to tell him that a wildfire was threatening her parents' home.", "2.8K", ["434", "Comments"]], ["“We had an avalanche of lying from President Trump.\" CNN’s Daniel Dale breaks down the fact check of the first presidential debate of the 2020 election between President Trump and Democratic candidate Joe Biden. https://cnn.it/36icxIU", "7.7K", ["4.4K", "Comments"]], ["A group of students started a new tradition at their medical school by creating a more inclusive Hippocratic Oath to acknowledge racism, the coronavirus pandemic and the killing of Breonna Taylor.", "691", ["382", "Comments"]], ["\"Their decision making ... is more about 'what's in the moment, what am I missing out on, what is the thing that would make me happiest in this moment?'\" Ben Locke, the senior director for Counseling & Psychological Services at Pennsylvania State University said.", "964", ["360", "Comments"]], ["Conservative Christians are thrilled about Amy Coney Barrett's nomination and the prospect it raises for them of overturning Roe v. Wade, but their views don't align with the reality of what many American Christians believe, writes Guthrie Graves-Fitzsimmons via CNN Opinion", "1K", ["1.8K", "Comments"]], ["It was easily the worst and most rancorous presidential debate in history. But it still left the country with its starkest election choice in many generations, writes CNN's Stephen Collinson.", "5.3K", ["3.6K", "Comments"]], ["It was hard to watch Tuesday's debate and think anything has progressed in four years, writes CNN's James Griffiths.  Chinese state media coverage noted the ugly tone, with China Daily saying \"the debate seemed to reveal a genuine dislike between the two men, with no pretense of decorum.\"", "2.3K", ["2.7K", "Comments"]], ["\"Who would you like me to condemn?\" President Trump asked moderator Chris Wallace. Joe Biden could be heard twice saying, \"Proud Boys.\" Trump continued: \"Proud Boys — stand back and stand by.\"", "32K", ["17K", "Comments"]], ["Tuesday night's debate devolved into chaos and an unrelenting volley of personal attacks as President Trump derailed the night by repeatedly talking over former Vice President Joe Biden, who responded with jabs at the President", "5K", ["3.1K", "Comments"]], ["In a rancorous and chaotic debate — during which President Trump tried to bulldoze challenger Joe Biden with insults, slashing interruptions and callous attacks on Biden's family — the President questioned the legitimacy of the November election, refused to say whether he would concede should he lose and refused to condemn White supremacists", "1.4K", ["999", "Comments"]], ["Tuesday night's presidential debate featured an avalanche of lies from President Trump — while Democratic presidential nominee Joe Biden was largely accurate in his statements, though he did make some false or misleading claims", "7K", ["3.1K", "Comments"]], ["President Trump turned his first debate with Democratic rival Joe Biden into a chaotic disaster. Here are six takeaways.", "1.6K", ["1.6K", "Comments"]], ["\"It's about equity and equality. It's about decency,\" Joe Biden says on dealing with issues of race in the US. \"And we have never walked away from trying to require equity for everyone, equality for the whole of America. But we've never accomplished it.\" https://cnn.it/2S92xcz", "10K", ["4.2K", "Comments"]], ["President Trump offered a frank defense when questioned about new reporting on the minimal amount in income tax he’s paid: “I don’t want to pay tax” https://cnn.it/3kWNkb5", "18K", ["7.6K", "Comments"]], ["CNN's Daniel Dale says while Joe Biden was \"largely accurate\" during tonight's presidential debate, \"we had an avalanche of lying from President Trump.\" He says at points during the debate, \"almost every single thing (Trump) said ... was inaccurate.\" https://cnn.it/34btW3b", "24K", ["8.5K", "Comments"]], ["President Trump said he would not “go along” with conceding the election if he believes the results have been “manipulated,” continuing to press unfounded conspiracy theories about voters casting ballots by mail.", "3.7K", ["2.3K", "Comments"]], ["Tonight’s presidential debate made for a chaotic first foray between Joe Biden and Donald Trump since the start of the general election race. In case you missed the debate, here are four key moments.", "2K", ["3.2K", "Comments"]], ["President Trump refused to call out white supremacists for inciting violence at anti-police brutality demonstrations across the country, saying during Tuesday’s debate that the violence wasn’t an issue caused by the right", "59K", ["23K", "Comments"]], ["President Trump offered a frank defense when questioned about new reporting on the minimal amount in income tax he’s paid: “I don’t want to pay tax” https://cnn.it/3kWNkb5", "18K", ["10K", "Comments"]], ["\"The President has no plan,\" says Joe Biden on President Trump's handling of the Covid-19 pandemic. \"He hasn't laid out anything.\" https://cnn.it/2SbXS9S", "70K", ["21K", "Comments"]], ["“He still hasn’t even acknowledged that he knew this was happening, knew how dangerous it was going to be back in February, and he didn’t even tell you,\" Biden said directly to the camera during the first presidential debate", "13K", ["3.9K", "Comments"]], ["Commerce Secretary Wilbur Ross' surprise decision to end 2020 census counting on October 5 risks an incomplete tally of as many as 10 states, including Florida and Georgia, according to Census Bureau officials.", "761", ["328", "Comments"]], ["In 2016, Donald J. Trump's campaign targeted 3.5 million Black Americans with negative ads about Hillary Clinton to try and deter them from voting in the last presidential election, according to a new report from the UK's Channel 4 News.", "3.7K", ["2.5K", "Comments"]], ["CNN’s John King takes a closer look at the path to 270 electoral votes ahead of the first presidential debate. https://cnn.it/2HI9dg1 #Debates2020", "812", ["1K", "Comments"]], ["Biotechnology company Regeneron released some early results of tests using its antibody cocktail in coronavirus patients, and said it seemed to reduce levels of the virus and improve symptoms in patients.", "1K", ["288", "Comments"]], ["About 800,000 of those ballots cast come from eight of CNN's most competitive-rated states. In North Carolina and Wisconsin alone, more than 500,000 ballots have already been cast — roughly a quarter of ballots requested.", "4.4K", ["1.5K", "Comments"]], ["Ahead of tonight's debate, here's a look at 10 attacks President Trump and Joe Biden have previously made about each other that are false, misleading or require some context", "812", ["1.6K", "Comments"]], ["Overall frequency of alcohol consumption increased by about 14% from 2019, the researchers reported in the journal JAMA Network Open. That increase averages out to about one additional drinking day per month by 75% of adults.", "978", ["814", "Comments"]], ["A misprint by a third-party vendor caused nearly 100,000 Brooklyn voters to receive absentee ballot return envelopes with the wrong address and names printed on them, the New York City Board of Elections said, and voters will be sent new ballots.", "6.3K", ["2.6K", "Comments"]], ["Five parrots have been removed from public view at a British wildlife park after they started swearing at customers. \"It just went ballistic, they were all swearing,\" the venue's chief executive Steve Nichols said. \"We were a little concerned about the children.\"", "42K", ["4.5K", "Comments"]], ["A staggering 77% of business leaders polled by Yale University say they plan to vote for Joe Biden over President Donald J. Trump in the November election.", "31K", ["7.7K", "Comments"]], ["JUST IN: Disney is laying off 28,000 US employees at its theme parks as the coronavirus pandemic hammers its theme park business.", "39K", ["5.3K", "Comments"]], ["Joe Biden released his 2019 tax returns, which show he and his wife, Jill, paid nearly $300,000 in federal income tax last year and had an adjusted gross income of about $985,000.", "25K", ["9.5K", "Comments"]], ["Three Tennessee Titans players have tested positive for Covid-19, forcing that NFL team and the Minnesota Vikings, who played the Titans on Sunday, to suspend in-person activities, according to the NFL", "653", ["418", "Comments"]], ["Watch the First Presidential Debate, special coverage tonight starting at 7 p.m. ET", "3.1K", ["1.7K", "Comments"]], ["Justice Ruth Bader Ginsburg was laid to rest morning in a private ceremony at Arlington National Cemetery. An Army escort carried her remains under \"dependent honors\" for the burial of dependents of military personnel, according to cemetery spokeswoman Barbara Lewandrowski. Ginsburg's late husband, Marty, was an Army officer.", "35K", ["2.4K", "Comments"]], ["Hear how Joe Biden and President Donald J. Trump would tackle the following in their own words: • The pandemic • Health care • The economy • Police reform... • Gun violence • Immigration • Education • Foreign relations • Climate crisis See More", "760", ["1.7K", "Comments"]], ["• Get your flu shot • Stay warm outside • You don't always have to wear a mask outside (but you definitely should wear a mask around others) • If you take a risk to travel, cut down on exposure • Create alternate holiday plans", "2.9K", ["1.1K", "Comments"]], ["\"I think there are still people walking around the White House today who don't actually believe this virus is real.\" Former Vice President Pence aide Olivia Troye says the White House pressured the CDC to change guidelines and tried to manipulate data to downplay Covid-19's impact in the US. https://cnn.it/3jfDctt", "1.5K", ["856", "Comments"]], ["First she got coronavirus, now she's facing eviction. A CNN analysis foresees a growing trend of evictions in hard-hit communities.", "1K", ["701", "Comments"]], ["Donald Trump and Joe Biden are about to go head-to-head for the first time. What questions do you want to hear them debate? CNN special coverage of the most anticipated event of the election starts tonight at 7 p.m. ET", "808", ["1K", "Comments"]], ["United flight attendants who are set to be furloughed soon say they feel abandoned by Congress. “We’re essential workers,” flight attendant Amanda Steinbrunn says. \"... We’ve shown up with the uncertainty of possibly catching Covid ourselves. And we expect Congress to do their jobs.” https://cnn.it/2EIuIvY", "254", ["149", "Comments"]], ["\"The Apprentice\" didn't just give Donald J. Trump a platform. It threw him a financial \"lifeline,\" the New York Times reports.", "2.6K", ["1.8K", "Comments"]], ["Donald J. Trump could face the most direct challenge of his presidency to his handling of the pandemic, the economy and his personal conduct in his first debate against Democratic nominee Joe Biden", "2.6K", ["2.6K", "Comments"]], ["Sienna Miller called the late Chadwick Boseman's gesture \"astounding.\"", "18K", ["540", "Comments"]], ["California Governor Gavin Newsom declared a state of emergency Monday night after wildfires tore through Napa, Sonoma and Shasta counties, killing at least three people and forcing tens of thousands of people to evacuate.", "9.6K", ["1.7K", "Comments"]], ["Judge Amy Coney Barrett is meeting with Republican senators throughout Tuesday on Capitol Hill", "4.2K", ["2.4K", "Comments"]], ["Tonight is the first presidential debate of the 2020 election cycle where President Donald Trump will face Democratic nominee Joe Biden. CNN's Jessica Dean is live in Cleveland, Ohio, where the socially distanced debate will take place. What do you want to know about this unprecedented debate night?", "3.3K", ["3.8K", "Comments"]], ["The Emir of Kuwait, Sheikh Sabah Al-Ahmad Al-Jaber Al-Sabah, has died at the age of 91 after ruling the Gulf state for 14 years, officials say.", "1.7K", ["581", "Comments"]], ["Wildfires across the West Coast of the US have burned a record-breaking 3.7 million acres so far this season. Our map shows fire updates as they happen as well as the quality of air in the region.", "686", ["326", "Comments"]], ["An intense argument recorded and posted in a WhatsApp group has led to a death penalty sentence and a family torn apart over allegations of insulting Prophet Mohammed, according to lawyers for the defendant.", "691", ["1K", "Comments"]], ["\"This is an egregious and shameful act by the Indian Government, which forces us to cease the crucial human rights work of Amnesty International India for now,\" said Julie Verhaar, Acting Secretary General of Amnesty International, in a statement.", "838", ["246", "Comments"]], ["Futures are pointing to a mostly flat open Tuesday on Wall Street following solid gains Monday. Is it the calm before the storm? Investors are eagerly awaiting the first debate between President Trump and Joe Biden on Tuesday night. Traders are also watching the continued negotiations between leading House Democrats and the White House regarding another stimulus package. In corporate news, Big Data firm Palantir will list its shares directly on the New York Stock Exchange later Tuesday. It's the latest high-profile tech firm to make its debut on Wall Street. https://cnn.it/30hAMTA", "2.5K", ["9.2K", "Comments"]], ["The US Centers for Disease Control and Prevention was pushed to play down the risks of the coronavirus pandemic in reopening schools for in-person classes, Olivia Troye, a former top adviser to Vice President Mike Pence, confirmed to CNN", "8.4K", ["2.3K", "Comments"]], ["Agencies from Arizona to Florida reported outages that typically lasted about 30 minutes before being restored.", "599", ["316", "Comments"]], ["Shingles, maskne, migraines and quarantine fatigue: The stress of the pandemic has manifested in a variety of physical ailments.  The latest evidence of this is a rise in cracked teeth", "1.9K", ["698", "Comments"]], ["Donald Trump and Joe Biden are about to go head-to-head for the first time. What questions do you want to hear them debate? CNN special coverage of the most anticipated event of the election starts tonight at 7 p.m. ET", "8.5K", ["5.5K", "Comments"]], ["\"A vulnerability could be exploited by an adversary,\" Robert Cardillo -- a former top intelligence official in both the Obama and Trump administrations -- told CNN.", "4.6K", ["3.7K", "Comments"]], ["\"At first it looked like someone's toupee... I could hear it landing on my car.\"", "987", ["322", "Comments"]], ["Go There heads to Rome as Italy takes on new precautions to prevent getting hit with a second wave of coronavirus. Schools have reopened with masks, temperature checks, and staggered entrance times, while Rome’s main airport has implemented rapid testing for passengers. We follow CNN’s Delia Gallagher as she takes a closer look at the new steps being taken to protect Italy amid the pandemic.", "1K", ["199", "Comments"]], ["One of the children died.", "11K", ["1.2K", "Comments"]], ["✋✋✋", "2.9K", ["852", "Comments"]], ["The global Covid-19 death toll has crossed one million -- and the United States accounts for more than 20%.", "14K", ["5.4K", "Comments"]], ["The colors in our clothing often leave a toxic trail of environmental damage that has killed some rivers and rendered water undrinkable.", "1K", ["274", "Comments"]], ["Japan Airlines will be dropping \"ladies and gentlemen\" in favor of more inclusive greetings like \"attention all passengers\" and \"welcome, everyone\"", "4.8K", ["1.3K", "Comments"]], ["Days before Thomas Faleskie's 84th birthday, the detectives gave him a special surprise.  They presented Faleskie, who served from 1958 to 1982, with a shadowbox displaying replacements for all the military service medals, ribbons and pilot's wings that were taken from him.", "4K", ["251", "Comments"]], ["Two years ago, scientists detected what looked like a salty lake under the surface of Mars' southern ice cap. Now, new research has found more evidence of the lake, and also revealed a number of smaller salty \"ponds\" nearby -- raising the possibility there may be life on the Red Planet.", "14K", ["1.1K", "Comments"]], ["Microsoft 365 was hit with a significant outage late Monday that affected users' access to multiple services, including Outlook.", "814", ["185", "Comments"]], ["A trained hostage negotiator was on scene and attempted to speak with the suspect over the phone but \"shots were fired,\" officials said.", "3.8K", ["1.4K", "Comments"]], ["President Donald Trump heads into Tuesday's first crucial debate with Joe Biden recommitting to the failed strategy that ensured the Covid-19 disaster will be the defining legacy feature of his term, writes CNN's Stephen Collinson.", "4.7K", ["4.7K", "Comments"]], ["A bombshell New York Times investigation has offered the most conclusive proof yet that US President Donald Trump's business empire is nowhere near as successful as he claims.", "25K", ["14K", "Comments"]], ["The planet is considered to be one of the hottest and most extreme exoplanets ever discovered", "9.4K", ["478", "Comments"]], ["Amazon-owned home security company Ring has unveiled a drone prototype intended to fly around in your house and stream video to your smartphone https://cnn.it/33aZeIa", "956", ["332", "Comments"]], ["One of the great frustrations about US tax law is that everyday wage earners can often pay a higher tax rate than billionaire real estate investors", "5K", ["2.8K", "Comments"]], ["Heading into this year's inaugural general election showdown, President Trump has written off formal preparations as unnecessary given the daily demands of the job and instead hopes his brawling instincts and an unguarded embrace of personal attacks will carry him through", "2.7K", ["2.4K", "Comments"]], ["A 6-year-old boy in Lake Jackson, Texas, died earlier this month from an infection caused by a brain-eating amoeba that was found in the water of a splash fountain the boy had played in", "23K", ["1.7K", "Comments"]], ["Commerce Secretary Wilbur Ross says he intends to conclude the 2020 census on October 5, more than three weeks earlier than expected after a federal judge reinstated the October 31 end date", "2.5K", ["527", "Comments"]], ["An unidentified grand juror has filed a motion requesting that any and all recordings, transcripts, and reports of the grand jury relating to the Breonna Taylor case be released to the public, according to court documents", "9.9K", ["2.3K", "Comments"]], ["House Speaker Nancy Pelosi and House Democrats now say they are prepared to move forward with a scaled-down $2.2 trillion package. But that price tag is still too high for Senate Republicans and the White House.", "4.2K", ["2.2K", "Comments"]], ["In eight months, coronavirus has killed more than 1 million people, exposed failures of governance, worsened health care inequality and inflamed a long-waged war on the truth", "5.2K", ["2.6K", "Comments"]], ["JUST IN: More than 1 million people have died from the coronavirus worldwide, according to data from Johns Hopkins University", "21K", ["8.4K", "Comments"]], ["CNN's Poppy Harlow presses White House official Brian Morgenstern on President Trump's federal income tax payments:  “You can put the entire thing to bed if the President would release the records and show the American people what he says is true. Why will he not do that?”", "533", ["759", "Comments"]], ["The fight over working class, primarily non-college educated voters could be determinative in a place like Michigan, a state synonymous with union voters", "924", ["1.4K", "Comments"]], ["Body camera footage obtained by Vice News purportedly shows what happened after police raided Taylor’s home and fatally shot her", "3.9K", ["2.7K", "Comments"]], ["Eric Garner's mother has won her bid for an investigation into New York City's handling of the arrest of her son, the disciplining of officers involved in his 2014 death and the lack of medical care he was given by police officers, a state judge rules", "11K", ["1.2K", "Comments"]], ["Go There heads to Rome as Italy takes on new precautions to prevent getting hit with a second wave of coronavirus. Schools have reopened with masks, temperature checks, and staggered entrance times, while Rome’s main airport has implemented rapid testing for passengers. We follow CNN’s Delia Gallagher as she takes a closer look at the new steps being taken to protect Italy amid the pandemic.", "2.8K", ["606", "Comments"]], ["\"Like father, like son, like son-in-law, like daughter; the Trumps are aggressive tax avoiders at best,\" writes Ed McCaffery for CNN Opinion", "29K", ["17K", "Comments"]], ["The President's budget director warns federal workers could be punished for conducting training Trump doesn't like, including on unconscious bias", "8.8K", ["2.5K", "Comments"]], ["Wilhelmina Reuben-Cooke was one of the \"First Five\" undergraduate Black students to enroll at Duke in 1963. Now, she is the first Black woman to have a campus building named for her, according to the university.", "12K", ["1.1K", "Comments"]], ["President Trump has announced a plan to send 150 million rapid coronavirus tests around the country to help with school reopening efforts", "6.3K", ["5.1K", "Comments"]], ["There's another massive revelation contained in The New York Times' tax returns story that isn't getting nearly enough attention: Trump wrote off $26 million in unexplained \"consulting fees\" between 2010 and 2018, with almost $750,000 apparently going to his daughter, Ivanka, in one disclosure | Analysis by CNN's Chris Cillizza", "27K", ["9.8K", "Comments"]], ["\"No, I pay tax,\" Trump said in 2011 when asked whether he paid taxes. \"I pay a lot of tax. I just signed a big fat check recently for a lot of tax. I paid literally— I paid a lot of tax and you know, look, I don't mind. I'm proud to pay it up. If I owe it, I pay it.\"", "12K", ["5.6K", "Comments"]], ["Serena Williams began her search for her record-equaling 24th Grand Slam with a challenging win over fellow American Kristie Ahn in the first round of the French Open.", "849", ["185", "Comments"]], ["Donald Trump and Joe Biden are about to go head-to-head for the first time. What questions do you want to hear them debate? CNN special coverage of the most anticipated event of the election starts Tuesday at 7 p.m. ET", "1K", ["1.8K", "Comments"]], ["The space-voting process works like this: The county clerk's office in Harris County, Texas, uploads a secure electronic ballot to NASA's Johnson Space Center Mission Control Center. NASA astronauts, using specific credentials, access their ballot and cast their vote, which is delivered back to the county clerk's office by email.", "1.3K", ["545", "Comments"]], ["Prime Day, which normally takes place in mid-July, had been postponed because of the pandemic. The event is Amazon's version of Christmas in the summer, and sales routinely outpace Black Friday.", "1.4K", ["478", "Comments"]], ["A high school athlete in Tennessee was disqualified from a volleyball match for wearing a hijab, prompting calls for a statewide rule change. \"I don't see why I need approval to wear my hijab when it is a part of my religion,\" Najah Aqeel said.", "11K", ["4.1K", "Comments"]], ["Taylor Swift's latest, \"Folklore,\" has sat on top for seven non-consecutive weeks, giving her a total of 47 weeks, one more than Whitney Houston. Houston hit No. 1 with her \"Whitney Houston\" debut in 1986, and then with \"Whitney,\" \"The Bodyguard\" soundtrack and \"I Look to You.\"", "10K", ["1K", "Comments"]], ["\"Running for president was one of the last cards Trump had to play,\" CNN's Chris Cillizza writes. \"His candidacy was borne of desperation, not of a desire to serve. We kind of always knew this, but the tax revelations allow us to say so definitively.\"", "7.6K", ["4.7K", "Comments"]], ["The dispute over Nagorno-Karabakh has run hot and cold since the 1994 ceasefire -- one of several \"frozen conflicts\" that blight the post-Soviet world.  Yet this weekend's clashes mark a new height in rhetoric and signs of intent, writes CNN's Nick Paton Walsh.", "1.3K", ["2.1K", "Comments"]], ["A bombshell New York Times investigation has offered the most conclusive proof yet that President Donald J. Trump's business empire is nowhere near as successful as he claims", "20K", ["10K", "Comments"]], ["Two albums in one year?", "340", ["292", "Comments"]], ["How did Michelle Obama take on the big issues facing the country while still being “politically correct”? Watch the season premiere of #FirstLadies, Sunday at 10 p.m. ET", "2K", ["1.1K", "Comments"]], ["Stock futures are set to pop at the open Monday although there is no clear catalyst for the rally. Investors might be holding out hope that Democrat leaders in the House will come to an agreement with the White House on more stimulus from Congress following comments from House Speaker Nancy Pelosi. In corporate news, shares of Uber are rallying after the ridesharing giant received an 18-month license to resume services in London. But drug company Inovio is plunging after announcing that the FDA is forcing it to pause a clinical trial for its coronavirus vaccine. https://cnn.it/2Hv66rw", "3K", ["2.4K", "Comments"]], ["Fat Bear Week -- the one time a year where you can openly and proudly cheer for your favorite chubby bear -- is back.", "9.1K", ["738", "Comments"]], ["President Donald J. Trump floated his daughter Ivanka Trump as a vice-presidential running mate during the 2016 election, The Washington Post reports. \"She's bright, she's smart, she's beautiful, and the people would love her!\" he said, according to the newspaper.", "11K", ["3.6K", "Comments"]], ["President Trump paid just $750 in federal income taxes in both the year he won the presidency and his first year in the White House, the New York Times reports. Trump was struggling to keep his businesses afloat and was reporting millions in losses even as he was campaigning for President and boasting about his financial success, the Times further reports. https://cnn.it/3jdOvCo", "881", ["1.1K", "Comments"]], ["The law — which includes items such as cups, plates, carryout containers and trays — affects food service as well as other businesses and institutions that use these products, such as schools.", "20K", ["915", "Comments"]], ["A Kentucky grand jury's decision to charge only one officer in connection with Breonna Taylor's killing fanned the nation's simmering outrage over racial injustice, with demonstrators taking their anger to the streets over the weekend.", "1K", ["1.3K", "Comments"]], ["It's a myth that women lose interest in sex as they enter midlife and beyond, according to new research.", "2.8K", ["1.6K", "Comments"]], ["New York had boasted a test positivity rate of less than 1% for more than a month. That rate broke 1% on Saturday as Andrew Cuomo reminded New Yorkers \"we cannot drop our guard.\"", "3.5K", ["1.1K", "Comments"]], ["After being confronted by law enforcement over the first gathering, he then held a second party with more than 50 people, according to prosecutors.", "9.8K", ["2.7K", "Comments"]], ["Two-thirds of parents also don't believe getting a flu shot for their child is more important this year", "3.7K", ["2.4K", "Comments"]], ["There have been more than 8,100 wildfires in the state this year and firefighters continue to fight 25 major blazes, CalFire said", "2.6K", ["671", "Comments"]], ["The only other country to report more cases is the United States, which now has more than 7.1 million infections, according to Johns Hopkins University.", "1.8K", ["989", "Comments"]], ["\"... as a registered Independent for years now with centrist ideologies, I do feel that Vice President Biden and Senator Harris are the best choice to lead our country, and I am endorsing them to become President, and Vice President, of our United States,\" Johnson said", "53K", ["7.8K", "Comments"]], ["In 2016 and 2017 each, Trump paid just $750 in federal income taxes -- far less than many Americans who are working hard amid a deep recession to stay afloat, writes CNN's Stephen Collinson.", "18K", ["13K", "Comments"]], ["President Donald Trump's former campaign manager Brad Parscale was hospitalized Sunday following reports of a suicide attempt at his Florida home, CNN has learned.", "9.1K", ["4.2K", "Comments"]], ["Before calling the movers, here are four questions you'll want answers to from your HR and benefits department as well as from a professional tax adviser", "239", ["97", "Comments"]], ["Only one person was pulled out alive by rescuers and they are in critical condition in hospital, according to state-run media.", "3.8K", ["706", "Comments"]], ["Donald Trump and Joe Biden are about to go head-to-head for the first time. What questions do you want to hear them debate? CNN special coverage of the most anticipated event of the election starts Tuesday at 7 p.m. ET", "7.5K", ["5.4K", "Comments"]], ["Donald Trump and Joe Biden are about to go head-to-head for the first time. What questions do you want to hear them debate? CNN special coverage of the most anticipated event of the election starts Tuesday at 7 p.m. ET", "1.7K", ["1.7K", "Comments"]], ["Her home had electrical issues and no proper running water, but she couldn't afford repairs. So this electrician got to work, for free -- and sparked a movement https://cnn.it/2S0OfuK", "2.2K", ["443", "Comments"]], ["Written by Mrs. Roosevelt and carried out by many First Ladies who followed. Learn how six former #FirstLadies did things they thought they could not do in a brand-new CNN Original Series. Premieres Sunday, October 4th at 10 p.m. ET", "1.9K", ["798", "Comments"]], ["Thousands of protests. 45 arrests. 33 years in Congress. Witness the story of a civil rights giant. CNN Films presents John Lewis: Good Trouble. Tonight at 9 p.m. ET  #JohnLewisIsGoodTrouble", "6K", ["1K", "Comments"]], ["\"I was really upset as I managed to catch the biggest waves of my life on this board,\" the surfer wrote on August 17. \"[That's] why it meant so much to me.\"", "4.7K", ["528", "Comments"]], ["There has been a disproportionate shift toward Joe Biden among White voters without a college degree, writes Harry Enten.", "25K", ["6.7K", "Comments"]], ["Be inspired tonight as CNN points the spotlight on people who are creating positive changes in the world. Champions for Change, hosted by Alisyn Camerota and John Berman, tonight at 10 p.m. ET", "241", ["562", "Comments"]], ["Go There takes a closer look at the historic deal that took place at the White House on September 15, as President Donald Trump hosted Prime Minister Benjamin Netanyahu of Israel and the foreign ministers of the United Arab Emirates and Bahrain to sign normalization agreements – bringing relationships that had long been behind the scenes out into the open. CNN’s Oren Liebermann and Sam Kiley report from Jerusalem and Abu Dhabi.", "746", ["500", "Comments"]], ["President Donald J. Trump intends to choose Amy Coney Barrett to be the new Supreme Court justice, according to multiple senior Republican sources with knowledge of the process. All sources cautioned that until it is announced by the President, there is always the possibility that Trump makes a last-minute change but the expectation is Barrett is the choice.", "25K", ["8K", "Comments"]], ["What questions do you have about the first presidential debate on Tuesday? Post your questions in the comments and CNN's Chris Cillizza will answer them on Monday's episode of The Point. https://cnn.it/3j4Rhdk", "382", ["2.3K", "Comments"]], ["Stock market futures are pointing to a mixed open Friday, with the Dow and S&P 500 headed for slight drops and the Nasdaq inching a bit higher. This caps a volatile week for Wall Street, as investors grapple with concerns about a potential second wave of coronavirus and worry about the lack of any new fiscal stimulus from Washington. In corporate news, shares of Costco were down a bit despite reporting earnings and sales that topped forecasts. And biotech Novavax was set to pop after announcing plans to conduct a phase 3 trial for its Covid-19 vaccine candidate in the UK.", "1.2K", ["578", "Comments"]], ["Be inspired this Saturday night as CNN points the spotlight on people who are creating positive changes in the world. Champions for Change, hosted by Alisyn Camerota and John Berman, Saturday at 10 p.m. ET", "232", ["206", "Comments"]], ["Detainees \"often do not receive critical treatment or face delays,\" the inquiry found. Additionally, the review found that many of the for-profit facilities lack sufficient medical staff and failed to provide necessary care for chronic medical conditions.", "4.6K", ["2K", "Comments"]], ["What questions do you have about Covid-19 and vaccines? Johnson & Johnson announced Wednesday its one-dose vaccine has entered phase 3 of its trial. Also, Dr Sanjay Gupta spoke to Dr. Anthony Fauci today about vaccine approval, who said interference from sources outside of science is \"troublesome.\" Leave your questions in the comments.", "2.1K", ["1.4K", "Comments"]], ["Racial inequality is holding back America's economy", "6.1K", ["3.8K", "Comments"]], ["The crowd boos and chants as President Trump and first lady Melania Trump pay respects to the late Justice Ruth Bader Ginsburg at the Supreme Court. https://cnn.it/30mdUTl", "20K", ["6.4K", "Comments"]], ["“I think they’ve rushed the process, they’ve politicized the process... I don’t trust it right now so I won’t take it.” Regardless of who they’ll vote for, these voters say they won’t take the coronavirus vaccine if it was made available this year. https://cnn.it/2RSVvbN", "632", ["569", "Comments"]], ["Dr. Sanjay Gupta debunks some misconceptions about Covid-19. Here are the facts: - Masks work. - Covid-19 affects people of all ages. - You can be infected by symptomatic and asymptomatic people. - There is no data to prove that everyone can get vaccines by this November.... https://cnn.it/2HpOAoB See More", "1.7K", ["685", "Comments"]], ["They stood beside the most powerful man in the world, but they were second to none. Learn the journeys of six former #FirstLadies in a brand-new CNN Original Series. Premieres Sunday, October 4th at 10 p.m. ET", "3.3K", ["2.8K", "Comments"]], ["Rikien Wilder saw a man putting debris on a subway track, causing a derailment, New York's Metropolitan Transportation Authority said. He chased the suspect down as he attempted to flee and held him until authorities arrived.", "3.7K", ["802", "Comments"]], ["In so-called \"challenge trials,\" researchers give study subjects an experimental vaccine and then intentionally expose them to coronavirus to see if the vaccine works. Such trials were used in early research with smallpox, yellow fever and malaria.", "748", ["385", "Comments"]], ["The legislative proposals are a roadmap for what Democrats may do next year if former Vice President Joe Biden wins the White House", "3.8K", ["2.1K", "Comments"]], ["Go There boards a Turkish coast guard ship with CNN’s Jomana Karadsheh to observe search-and-rescue efforts along the north Aegean Sea, where Turkish officials say 6,600 migrants and refugees have been rescued from the water since February. The asylum-seekers are alleging that masked men are rounding them up at shore, taking their money and pushing them back out to sea. The Greek government has repeatedly denied any involvement.", "500", ["146", "Comments"]], ["CNN’s Jessica Schneider is outside the Unites States Supreme Court where mourners are gathering to pay their respects to Justice Ginsburg as she lies in repose today and tomorrow. On Friday, her body will be moved to the US Capitol building, and she will become the first woman to lie in state there. Ginsburg died last Friday at the age of 87 due to complications of pancreatic cancer. She served on the court for more than 27 years. Leave your questions for our reporter below. Follow for live updates: https://cnn.it/3kNiFwZ", "5.2K", ["1.3K", "Comments"]], ["Razor blades — 41 of them — were found at a playground in Eaton Rapids, prompting officials to canvass parks in the Michigan city out of caution", "1.7K", ["387", "Comments"]], ["She is now one of the more than 200,000 Americans who have died due to Covid-19", "20K", ["2.3K", "Comments"]], ["President Donald J. Trump's former top Russia adviser says the United States is increasingly seen as \"an object of pity\" and its standing on the world stage is eroding", "9.4K", ["4.2K", "Comments"]], ["Go There heads to Houston, Texas to look at the impact Covid-19 is having on those facing evictions in the United States. CNN’s Kyung Lah follows a Texas sheriff issuing orders to evict, and interviews individuals suffering the loss of their homes – just before the CDC issued an order on September 2 to halt evictions across the country until the end of 2020.", "1.5K", ["448", "Comments"]], ["We’re at a pop-up voter registration event in DC as part of #NationalVoterRegistrationDay, a nonpartisan holiday designed to encourage and empower citizens across the country to register to vote. CNN’s Kristen Holmes is talking to voters and organizers of the event about the importance of this year’s election and answering any questions you may have about the voting process. Leave your questions below. Follow here for more election updates: https://cnn.it/2HkzBMF", "2K", ["1.4K", "Comments"]], ["Donald Trump and Joe Biden are about to go head-to-head for the first time. What questions do you want to hear them debate? CNN special coverage of the most anticipated event of the election starts Tuesday, September 29th at 7 p.m. ET", "18K", ["12K", "Comments"]], ["Actor Chris Evans says voter turnout is “depressingly low.” So he launched A Starting Point to create engagement. “I thought that a lot of people turn away from politics because it’s confusing, a little overwhelming, and this is designed to demystify some of the issues.” https://cnn.it/32S1LqN", "2.9K", ["475", "Comments"]], ["Today, Go There heads to mainland China and Hong Kong to compare how each has handled the impact of coronavirus. CNN’s David Culver reports from Shanghai and Beijing on China’s efforts to fight the virus with QR codes and mass testing, while Selina Wang covers Hong Kong’s success in keeping case numbers relatively low without enacting extreme lockdown measures.", "409", ["177", "Comments"]], ["The reality of Joe Biden's policy proposals stands in sharp contrast to a campaign that has positioned him as a centrist Democrat. His platform reflects the triumph of the progressive left, writes Lanhee Chen for CNN Opinion", "3K", ["2.4K", "Comments"]], ["Justice Ruth Bader Ginsburg will lie in repose at the Supreme Court on Wednesday and Thursday so that members of the public can pay their respects", "23K", ["2.4K", "Comments"]], ["JUST IN: President Donald J. Trump says his Supreme Court pick will likely be named on Friday or Saturday and that he's down to four or five people", "43K", ["16K", "Comments"]], ["Thousands of protests. 45 arrests. 33 years in Congress. Witness the story of a civil rights giant. CNN Films presents John Lewis: Good Trouble. Sunday at 9 p.m. ET  #JohnLewisIsGoodTrouble", "5.8K", ["799", "Comments"]], ["On Sunday, the Australian state of Victoria recorded just 11 new coronavirus cases, down from over 670 at the height of the most recent outbreak last month.", "3.4K", ["1.8K", "Comments"]], ["The Bobcat Fire is now one of the largest wildfires in Los Angeles County history. It is one of at least 27 wildfires currently burning in California", "3.5K", ["607", "Comments"]], ["The Emmys went on as scheduled, with Jimmy Kimmel noting that an awards show might \"seem frivolous and unnecessary\" in the middle of a pandemic. But the host also pointed out that \"right now, we need fun.\"", "2.3K", ["529", "Comments"]], ["They stood beside the most powerful man in the world, but they were second to none. Learn the journeys of six former #FirstLadies in a brand-new CNN Original Series, starting Sunday October 4th at 10 p.m. ET", "8.8K", ["4.5K", "Comments"]], ["The coronavirus pandemic has upended the traditional runway format, and in its place will be a mix of virtual and physical shows with limited audiences. Here are some of the highlights. CNN Style", "505", ["134", "Comments"]], ["While thriving Indian communities span the United States, those truly in the know about good food head to New Jersey, a magnet for Indian cuisine and celebrations. CNN Travel", "695", ["304", "Comments"]], ["At least four GOP senators have said they will oppose a vote for a new justice before the election. Here’s why “several Republicans who are on the ballot could be excused from voting for this nominee,” Larry Sabato, director of the University of Virginia Center for Politics, explains to Michael Smerconish. https://cnn.it/2FRioKc", "2.2K", ["922", "Comments"]], ["As colleges and high schools across the US struggle with reopening, many sports programs have been hit with budget cuts and cancelled seasons, leaving student athletes in tough positions. For high school students working to get recruited, being social media savvy has become the way to secure a college spot. For athletes arriving on campus, college is nothing like they expected", "301", ["188", "Comments"]], ["Thousands of protests. 45 arrests. 33 years in Congress. Witness the story of a civil rights giant. CNN Films presents John Lewis: Good Trouble. Sunday, September 27th at 9 p.m. ET  #JohnLewisIsGoodTrouble", "10K", ["1.2K", "Comments"]], ["Be inspired this Saturday night as CNN points the spotlight on people who are creating positive changes in the world. Champions for Change, hosted by Alisyn Camerota and John Berman, Saturday at 10 p.m. ET", "181", ["180", "Comments"]], ["The 72-year-old activist who has fought to protect the pristine Opal Creek Wilderness was last seen on September 7 before the Beachie Creek Fire exploded overnight last week.", "1.7K", ["208", "Comments"]], ["They were an unlikely pair, and their relationship would affect the history of American politics. Eisenhower and Nixon team up on the next #RaceForWH, Sunday at 10 p.m. ET/PT", "452", ["192", "Comments"]], ["TGIF for investors! Stocks are pointing to a higher open Friday following Thursday's modest losses. Investors will be keeping a particularly close eye on tech stocks after the US government announced restrictions on Chinese owned social media apps WeChat and TikTok. The move comes despite the fact that the US is reviewing a plan for software giant Oracle to partner with TikTok to keep the app running in America. https://cnn.it/2NiR5IW", "2.4K", ["1.8K", "Comments"]], ["A federal judge has issued a historic decision to temporarily block the US Postal Service and Postmaster General Louis DeJoy from changing a wide swath of USPS policies or protocols ahead of November's presidential election", "10K", ["1.2K", "Comments"]], ["A class assignment at a Dallas high school asking students to potentially defend the suspected Kenosha, Wisconsin, shooter as a hero is drawing complaints from students and parents. The others on the list were Mahatma Gandhi, Cesar Chavez, Malcolm X, George Floyd and Joseph Rosenbaum, one of the victims of the Kenosha shooting.", "2.4K", ["2K", "Comments"]], ["As schools around the country reopen remotely, the gap between low-income and high-income education is becoming more apparent with experts saying students who don't have access to technology and high speed internet could be hurt for decades. CNN speaks to two public school students, a RAND policy expert, and visits private school that is able to afford the equipment necessary to begin in-person classes.", "579", ["243", "Comments"]], ["Join former Vice President, Joe Biden, in a CNN Presidential Town Hall. Coverage begins tonight at 8 p.m. ET #BidenTownHall", "3.1K", ["1.7K", "Comments"]], ["Looking for answers from Joe Biden? Join the former Vice President in a CNN Presidential Town Hall, live from Pennsylvania, with Anderson Cooper moderating. Tonight at 8 p.m. ET #BidenTownHall", "7.3K", ["3.3K", "Comments"]], ["Get the facts on where things stand with the coronavirus pandemic and a race for a vaccine. Dr. Sanjay Gupta is here to answer your questions. What would you like to know?", "3.6K", ["1.6K", "Comments"]], ["Jenny Durkan said a report that Attorney General William Barr suggested prosecutors consider filing charges against her is \"chilling and the latest abuse of power from the Trump administration.\"", "6K", ["3K", "Comments"]], ["Singapore announced that it would reward residents with hundreds of dollars if they use a new health app designed for the Apple Watch.", "2.4K", ["319", "Comments"]], ["Narendra Modi is seen by many as a \"national messiah\" who is working on a grander agenda to reshape the Indian nation along Hindu lines, and is not accountable for day-to-day government failures, say analysts.", "1.9K", ["1K", "Comments"]], ["Dwight D. Eisenhower and Adlai Stevenson may have been persuaded to run for president in 1952, but the gloves come off in a fierce battle for hearts and minds. #RaceForWH, Sunday at 10 p.m. ET/PT", "356", ["281", "Comments"]], ["Across the western US, at least 87 wildfires are burning, according to the National Interagency Fire Center. Since mid-August, these fires have devastated the West Coast, killing dozens of people and displacing thousands from their home. CNN's Martin Savidge is in Lyons, Oregon, a rural area being heavily impacted, what questions do you have for him?", "4.2K", ["1.5K", "Comments"]], ["This chorus of senior citizens isn’t letting the coronavirus pandemic stop them from sharing their joy of music with others. The group of 75-92 year-olds have embraced Zoom to keep spirits high. As part of CNN's Champions For Change series, chorus director Bob Cilman is here with CNN's John Berman to show a virtual performance and take your questions. What would you like to ask?", "2K", ["1.3K", "Comments"]], ["When asked why he downplayed the coronavirus, President Donald Trump responded, \"Well, I didn't downplay it. I actually — in many ways I up-played it in terms of action.\" Facts First: This is a ridiculous spin.", "36K", ["16K", "Comments"]], ["Many teachers say they feel their designation by the White House as \"essential workers\" is now forcing them to choose between their lives and their livelihoods. As one educator told us: “I’m dying to teach, I just don’t want to die teaching.” Go There continues to focus on education this week by traveling to New Jersey, Tennessee, and New York to follow three teachers struggling to accommodate ever-changing Covid-19 rules – all while trying to connect with their incoming students.", "410", ["307", "Comments"]], ["Fox News has not confirmed any plans for a weekly segment", "2.5K", ["1.1K", "Comments"]], ["Since many Florida public schools opened about a month ago, the number of children under 18 who have contracted Covid-19 statewide has jumped 26%, according to state data. But the state has still not released specific school data, CNN's Rosa Flores reports. https://cnn.it/2FED2x3", "1.1K", ["776", "Comments"]], ["Stocks look set to rally again Tuesday, building on solid gains from Monday. Apple shares are rallying ahead of its product event later today. The company is expected to unveil updates for its Apple Watch and iPad -- but not a new iPhone. Tesla shares are up again following a nearly 13% spike Monday. Elon Musk's electric car maker has rebounded sharply in the past few days as rival Nikola plunges due to concerns about the electric truck company raised by a top short seller.", "253", ["295", "Comments"]], ["The world's worst humanitarian crisis is deepening in Yemen after its three major donors, the US, Saudi Arabia and the UAE, dramatically reduced aid to the country this year.  CNN's Nima Elbagir reports. https://cnn.it/35Cy0fb", "700", ["288", "Comments"]], ["Some of these weird and wonderful exoplanets are filled with things that are hard to imagine. Some are so hot that they host oceans of lava with sparkly silicate skies while others orbit two suns like planets from Star Wars.", "1.7K", ["277", "Comments"]], ["Nevada's Democratic Gov. Steve Sisolak skewered President Trump for hosting a large indoor campaign rally in his state with little social distancing, telling CNN's Erin Burnett that the President acted selfishly. https://cnn.it/3kkIkwO", "2.5K", ["1.5K", "Comments"]], ["Looking for answers from Joe Biden? Join the former Vice President in a CNN Presidential Town Hall, live from Pennsylvania, with Anderson Cooper moderating. Thursday at 8 p.m. ET", "4.3K", ["2.2K", "Comments"]], ["Colleges are fast becoming Covid hotspots around the country, with thousands of cases being traced to universities and leading many to shut down entirely and others to quarantine students on campus. In many cases, anxious and confused first-time students are still moving in with new restrictions in place. CNN heads to New York, DC, and Ohio to follow students as they struggle to adapt to unexpected rules and restrictions.", "2.2K", ["934", "Comments"]], ["\"This is climate change.” Los Angeles Mayor Eric Garcetti pushed back on President Trump's frequent characterization of wildfires, like those currently ravaging the West Coast, as simply a forest management issue. https://cnn.it/2ZynfXG", "1.4K", ["1K", "Comments"]], ["He went from underdog to front runner… but when it comes to politics, there is no victory without a brutal fight. Carter vs. Ford when #RaceForWH returns, tonight at 10 p.m. ET/PT", "435", ["738", "Comments"]], ["Looking for answers from Joe Biden? Join the former Vice President in a CNN Presidential Town Hall, live from Pennsylvania, with Anderson Cooper moderating. Thursday at 8 p.m. ET", "7.5K", ["3.2K", "Comments"]], ["Since 2016, at least 1,500 reviews have been written about more than 70 AmazonBasics products exploding, catching on fire, smoking, melting, causing electrical malfunctions or otherwise posing safety risks. In an exclusive new investigation, CNN exposes safety concerns that have been raised about these AmazonBasics products.", "450", ["267", "Comments"]], ["One of the four leading prosecutors chosen to be on President Donald J. Trump's law enforcement commission resigned last week after expressing \"serious\" concerns that the intention of the commission was not to bridge the gap between communities of color and law enforcement.", "18K", ["3.4K", "Comments"]], ["At school or at home, we’ve got you covered! Join Dr. Sanjay Gupta, Erica Hill and the Sesame Street crew for the ABC’s of Back to School. Today at 10 a.m. ET", "640", ["224", "Comments"]], ["At school or at home, we’ve got you covered! Join Dr. Sanjay Gupta, Erica Hill and the Sesame Street crew for the ABC’s of Back to School. Saturday morning at 10 a.m. ET", "333", ["178", "Comments"]], ["Go There travels to Alaska’s Arctic National Wildlife Refuge, one of the last untouched places on Earth. The Trump administration now plans to open 1.5 million acres of the refuge for oil drilling, sounding the alarm for environmental activists who say this could harm the environment and exacerbate the climate crisis. CNN’s Bill Weir reports on the intense legal battle that has now developed between Alaskan Native groups, environmentalists and others as they fight to protect this pristine land.", "3.8K", ["745", "Comments"]], ["Looking for answers from Joe Biden? Join the former Vice President in a CNN Democratic Presidential Town Hall, live from Pennsylvania, with Anderson Cooper moderating. Thursday at 8 p.m. ET", "6.2K", ["2.9K", "Comments"]], ["Stocks are set to open higher Friday, closing out a short and volatile week of trading on Wall Street. Consumer prices rose more than expected in August, news that might raise some inflation alarm bells. Peloton is soaring after the company reported its first quarterly profit and strong sales of its high-end exercise bikes. Supermarket chain Kroger also reported healthy earnings as consumers continue to hunker down at home and buy more food during the pandemic.", "226", ["215", "Comments"]], ["\"It feels a little like doomsday... You'd think that you were in a fireplace.\"", "11K", ["1K", "Comments"]], ["President Donald Trump was asked directly on Thursday why he lied to the American people about the coronavirus pandemic. The beginning of Trump's response: \"I didn't lie.\"", "24K", ["13K", "Comments"]], ["President Trump held a campaign rally in Michigan last night — where many people didn’t wear masks or practice social distancing — despite revelations that he admitted to downplaying the true threat of coronavirus. “It is deeply frustrated watch him consistently disregard the information he now knows and understands,” Michigan epidemiologist Dr. Abdul El-Sayed says. https://cnn.it/3bVhl80", "1.5K", ["1.5K", "Comments"]], ["The 13 unopened coffins, which were found piled on top of each other in a well nearly 40 feet (12 meters) deep are so well preserved that the original detailed designs and colors are clearly visible, according to Egypt's Ministry of Tourism and Antiquities", "3.3K", ["733", "Comments"]], ["NFL wide receiver Joshua Bellamy is facing a slate of fraud charges for allegedly participating in a scheme to use coronavirus relief funds for personal use, the Justice Department said", "485", ["382", "Comments"]], ["This is the ninth record low since March", "953", ["338", "Comments"]], ["US e-cigarette sales rose by nearly 300% between November 2016 and August 2019, says a new report from the Centers for Disease Control and Prevention", "672", ["352", "Comments"]], ["What questions do you have about the coronavirus pandemic? Leave your questions in the comments below and we will feature some during a one-hour special tonight at 8 p.m. ET.", "212", ["452", "Comments"]], ["As coronavirus clusters accumulate on campuses, experts are warning of a resurgence of Covid-19 cases across the country, in addition to flu season. CNN's Dr. Sanjay Gupta discusses the implications of these clusters as well as his conversation about testing with Adm. Brett Giroir, a physician and the assistant secretary for health at the US Department of Health and Human Services. What questions do you have for him?", "2.6K", ["1.6K", "Comments"]], ["Democratic Presidential Nominee Joe Biden talks with Jake Tapper in an exclusive interview. The Lead with Jake Tapper, today at 4 p.m. ET", "1.8K", ["1.4K", "Comments"]], ["What are your concerns over coronavirus and kids returning to school? NIH Director Dr. Francis Collins joins Anderson Cooper and Dr. Sanjay Gupta for Coronavirus: Facts and Fears tonight at 8 p.m. ET", "440", ["239", "Comments"]], ["At school or at home, we’ve got you covered! Join Dr. Sanjay Gupta, Erica Hill and the Sesame Street crew for the ABC’s of Back to School. Saturday morning at 10 a.m. ET", "233", ["118", "Comments"]], ["Once the world’s largest landfill, Fresh Kills in Staten Island, New York, serves as a burial ground for 1.8 tons million tons of rubble from the 9/11 attacks.  A study by the city’s health department published earlier this year found somewhat elevated bladder and thyroid cancer rates around the landfill in recent years, but concluded there was little evidence of an association between living close to the former landfill and cancer.  CNN interviews public health officials, legal experts, community leaders, and cancer patients to explain why some members of New York’s “forgotten borough” are demanding further investigation.", "769", ["175", "Comments"]], ["Deep channels discovered under the Antarctic's so-called \"Doomsday glacier\" may be allowing warm ocean water to melt the underside of ice, according to scientists collecting data from an area crucial to understanding sea-level rise.", "3.2K", ["375", "Comments"]], ["Dara Khosrowshahi, Uber CEO, says the company plans to operate an all-electric global fleet by 2040. He says support from private markets, car manufacturers, and governments is needed to make the transition happen. https://cnn.it/2DHAHk6", "63", ["127", "Comments"]], ["Exclusive. Democratic Presidential Nominee Joe Biden talks with Jake Tapper about his strategy to win the White House. The Lead with Jake Tapper, Thursday at 4 p.m. ET", "2.2K", ["1.5K", "Comments"]], ["He went from underdog to front runner… but when it comes to politics, there is no victory without a brutal fight. Carter vs. Ford when #RaceForWH returns, Sunday at 10 p.m. ET/PT", "285", ["386", "Comments"]], ["Before each US Open match, Osaka has donned a face mask with the name of a different Black person whose death has sparked calls for racial justice.", "5.3K", ["2.1K", "Comments"]], ["Go There heads to Portland, Oregon, and Kenosha, Wisconsin, to check in on the ongoing protests which began after George Floyd’s death and have found new energy after the police shooting of Jacob Blake. CNN’s Josh Campbell and Lucy Kafanov report on the violent clashes between protesters and Trump supporters in Portland, while Omar Jimenez joins from Kenosha.", "824", ["944", "Comments"]], ["\"I don't know the answer to 99% of what my six-year-old asks me,\" one mother said. \"Thank goodness for YouTube, Alexa, and Google.\"", "1.4K", ["722", "Comments"]], ["At least 22 large fires are burning in California", "5.6K", ["893", "Comments"]], ["The coronavirus pandemic has been disproportionately affecting the poorest and the hungriest across the globe. With aid organizations and governments overwhelmed, everyday citizens have been the ones stepping up and stepping in.  Join CNN’s Arwa Damon as she speaks with three individuals in Nigeria, Pakistan, and Ukraine to understand how they are getting food to others during the pandemic.", "770", ["261", "Comments"]], ["If all goes to plan, the performance will come to an end in 2640", "2.7K", ["364", "Comments"]], ["The reason is \"inconceivable\" to Texas Senator and Princess Bride superfan Ted Cruz", "4.5K", ["710", "Comments"]], ["\"He's got a lot of things going for him, but this is obviously a stain that he's not going to be able to erase, whether he likes it or not,\" John McEnroe added", "10K", ["2.6K", "Comments"]], ["What does it take to get to the Oval Office? Follow the two different journeys of two very different men in 2 CNN specials back-to-back. Fight for the White House, tonight starting at 8 p.m. ET", "1.4K", ["1.5K", "Comments"]], ["A portion of the profits will go towards educating inner-city kids and assisting elderly people in Black communities across the United States", "2.1K", ["1.2K", "Comments"]], ["$68 billion", "2.6K", ["1.1K", "Comments"]], ["Pope Francis has once again condemned gossip, describing it as a \"plague worse than Covid,\" during his Sunday prayers.", "5K", ["2K", "Comments"]], ["They’ve survived scandal, failed love affairs and tabloid obsession. #TheWindsorsCNN have even survived a months-long television hiatus. Now, the world’s most famous royal family returns with new episodes, tonight at 9 p.m. ET/PT", "641", ["235", "Comments"]], ["A dramatic temperature swing is on the way for a large portion of the country as many deal with record-breaking, triple-digit heat over Labor Day weekend.", "29K", ["2.4K", "Comments"]], ["What led to Joe Biden’s run for President? Explore his career in a new CNN Special Report. Fight for the White House: Joe Biden’s Long Journey, Monday at 8 p.m. ET", "3.3K", ["2.4K", "Comments"]], ["Democratic vice presidential nominee Kamala Harris strongly rebuked President Trump and Attorney General William Barr for denying there's systemic racism in the US justice system, saying they are \"spending full time in a different reality.\"", "12K", ["5.2K", "Comments"]], ["If you have to travel soon, make sure you are adequately prepared: (via CNN Underscored)", "319", ["181", "Comments"]], ["The Flying-V's unique design places the passenger cabin, the cargo hold and the fuel tanks in the wings, and experts hope that the plane's aerodynamic shape will cut fuel consumption by 20% compared to today's aircrafts.", "6.7K", ["653", "Comments"]], ["Hear the extraordinary stories of the 2020 presidential campaigns from the women who cover them. #OnTheTrail, from CNN Films and HBO Max, tonight at 8 p.m. ET", "287", ["220", "Comments"]], ["She’s the longest reigning monarch in British History. And Queen Elizabeth is still making her mark with a historic address during the pandemic. Go inside her world in the final episodes of #TheWindsorsCNN, Sunday at 9 p.m. ET/PT", "4.2K", ["679", "Comments"]], ["What does it take to get to the Oval Office? Follow the two different journeys of two very different men in 2 CNN specials back-to-back. Fight for the White House, Monday starting at 8 p.m. ET", "1.5K", ["1.5K", "Comments"]], ["\"He was a great coach but what he's done is even beyond coaching,\" President Trump said of the honor", "1.8K", ["855", "Comments"]], ["As coronavirus cases surge in Europe, Go There heads to three countries preparing to send students back to school after months of lockdown and closures due to Covid-19. CNN’s Scott McLean reports from a school in southern England on the very first day back, Atika Shubert covers private vs. public schools in Madrid ahead of reopening next week, and Melissa Bell speaks to three high schoolers in France who are keen to get back into the classroom.", "406", ["226", "Comments"]], ["Join Jake Tapper for a look at President Trump’s first term. CNN Special Report - Fight for the White House: Donald Trump’s Presidency. Monday at 10 p.m. ET", "1.3K", ["2.6K", "Comments"]], ["In the Phase 1 and 2 studies of the vaccine, which is named Sputnik V, all 76 study participants developed antibodies to the virus that causes Covid-19, according to Friday's report in The Lancet.", "6.5K", ["1.2K", "Comments"]], ["Stocks are pointing to a mixed open after the government reported solid jobs gains for August and a bigger than expected slide in the unemployment rate. The Dow was higher and the S&P 500 is flat. But the tech-heavy Nasdaq was lower again, as investors continue to sell off high-flying tech and momentum stocks like Apple, Netflix and Tesla. Investors are also preparing for a long weekend. The US stock market is closed Monday for the Labor Day holiday.", "241", ["166", "Comments"]], ["Wisconsin Gov. Tony Evers: “I don’t think candidate Trump coming to Kenosha and talking about the shooting of Jacob Blake as choking on a ‘three-foot putt’ compares to what happened here with Joe Biden and his ability to show empathy.” https://cnn.it/3hXFnkM", "1.5K", ["793", "Comments"]], ["This silver dollar is worth way more than its name suggests. The \"Flowing Hair\" dollar is more than 200 years old and a piece of American history.", "2.5K", ["234", "Comments"]], ["Trump has consistently pressed officials to speed up their timeline for developing a vaccine, administration officials said, saying the President appeared intent on being able to deliver at least the solid promise of an effective vaccine by the time he faces reelection", "4.7K", ["2.1K", "Comments"]], ["It's two-and-half-minutes of fast cars, beautiful people and scenes from around the globe", "3.8K", ["190", "Comments"]], ["Go There heads to Chicago, where a “perfect storm” of coronavirus, record unemployment, and financial and emotional strain have led to a spike in gun violence this summer. CNN’s Omar Jimenez speaks to a group working to prevent shootings by providing conflict mediators who deescalate disputes before they turn deadly.", "538", ["448", "Comments"]], ["Spirit says it will be the first airline in the US to allow domestic passengers to check bags without speaking to an agent", "466", ["328", "Comments"]], ["Hundreds of migrant children have been held in hotels and guarded by government contractors in recent months as part of a secretive new system that advocates warn puts kids in danger", "4.2K", ["2.5K", "Comments"]], ["For Trump, being president is an imposition | Analysis by Chris Cillizza", "235", ["486", "Comments"]], ["They’ve survived scandal, failed love affairs and tabloid obsession. #TheWindsorsCNN have even survived a months-long television hiatus. Now, the world’s most famous royal family returns with new episodes, Sunday at 9 p.m. ET/PT", "375", ["203", "Comments"]], ["What does it take to get to the Oval Office? Follow the two different journeys of two very different men in 2 CNN specials back-to-back. Fight for the White House, Monday starting at 8 p.m. ET", "1K", ["1.2K", "Comments"]], ["Eight of Louisiana's confirmed deaths have been due to carbon monoxide poisoning, according to the Louisiana Department of Health.", "2K", ["284", "Comments"]], ["President Donald Trump is the election meddler-in-chief, writes CNN's Stephen Collinson.", "6.7K", ["3.9K", "Comments"]], ["As families try to navigate school amid a deadly pandemic, Sesame Street and CNN are teaming up for a new town hall on \"The ABCs of Back to School,\" airing at 10 a.m. ET Saturday, September 12", "371", ["122", "Comments"]], ["Walmart is adding 100 Mamava lactation pods to stores across the US to give moms with toddlers a safe space to breastfeed their children, and the partnership is all thanks to a Walmart employee who advocated for its use.", "1.8K", ["543", "Comments"]], ["“I don’t think there are two justice systems,\" Attorney General William Barr says. “The narrative that the police are on some epidemic of shooting unarmed Black men is simply a false narrative,” says Barr, adding he does not think systemic racism exists in police departments. https://cnn.it/3jGDPvW", "2.7K", ["1.6K", "Comments"]], ["Over nine days, more than 150 peaceful protesters were arrested for violating curfew, but not a single pro-police demonstrator was arrested, the lawsuit alleges", "7.5K", ["4.5K", "Comments"]], ["After Memorial Day and the Fourth of July, the United States saw a surge in Covid-19 cases, worrying many that the same may happen again after the upcoming Labor Day weekend. CNN's Dr. Sanjay Gupta is live reminding us that the virus is still prevalent and offering ways to have a relaxing weekend, while also taking precautions. What questions do you have for him?", "2.6K", ["1.8K", "Comments"]], ["This is the earliest we’ve gotten to an “N” named storm", "2.6K", ["491", "Comments"]], ["Hear the extraordinary stories of the 2020 presidential campaigns from the women who cover them. #OnTheTrail, from CNN Films and HBO Max, Saturday at 8 p.m. ET", "288", ["166", "Comments"]], ["Many companies are giving their employees the day off to vote. But Old Navy is taking a different approach to get workers involved in the democratic process.", "33K", ["1.2K", "Comments"]], ["Go There travels to Europe, where several cities are working diligently to get ahead of a potential second wave of coronavirus infections. CNN’s Melissa Bell reports alongside police officers enforcing masks in Marseille, France, while Atika Shubert covers the implementation of mass testing locations in Madrid, Spain.", "655", ["339", "Comments"]], ["Such an approach -- similar to what was pursued in Sweden -- would mean that many people nationwide would have to get sick with the coronavirus in order to build up a natural immunity across communities. As the virus spreads and sickens people, many could die in the process.", "4.8K", ["1.7K", "Comments"]], ["Many Americans continue to patronize Tijuana’s bustling red light district despite Mexico's deepening Covid-19 crisis, which has so far killed more than 64,000 people and infected nearly 600,000. CNN’s Matt Rivers travels to Tijuana where he speaks with a sex worker, an American patron, and the owner of a strip club.", "835", ["377", "Comments"]], ["How do you create a college experience filled with discovery while keeping everyone apart? We asked health experts and those tasked with helping solve these problems to weigh in.", "210", ["337", "Comments"]], ["When Denzel Washington heard that nine students accepted into the British American Drama Academy’s Midsummer program couldn't afford to attend, Washington offered to help pay. One of those students was Chadwick Boseman.", "280K", ["3.2K", "Comments"]], ["\"These shoes give me life,\" Denver Nuggets guard Jamal Murray said. \"Even though these people are gone, they give me life. They help me find strength.\"", "2.2K", ["1K", "Comments"]], ["Facebook failed to take action against a self-styled militia group that was using the social media platform to encourage armed citizens to take to the streets of Kenosha, Wisconsin, on Tuesday night — despite at least one Facebook user reporting the group to the company, Facebook confirmed", "2.6K", ["2.1K", "Comments"]], ["\"Before I am an athlete, I am a black woman. And as a black woman I feel as though there are much more important matters at hand that need immediate attention, rather than watching me play tennis.\"", "5.8K", ["3K", "Comments"]], ["Join W. Kamau Bell for 2 all-new, back to back episodes of #UnitedShades tonight starting at 9p ET/PT", "840", ["466", "Comments"]], ["How do you think the perception of America has changed since 2016? Join Fareed Zakaria for the answer. How They See Us: A Global view of Trump’s America. Today at 10 a.m. ET", "794", ["1.7K", "Comments"]], ["How do you think the world sees the U.S. after almost four years of President Trump? Find out. A Fareed Zakaria GPS special - How They See Us: A Global View of Trump’s America. Sunday at 10 a.m. ET", "1.2K", ["2K", "Comments"]], ["These kids are amazing! Even during the lockdown, they are finding ways to ensure that senior citizens in their communities have necessities like sanitizer, wipes and tissues: https://cnn.it/2zDDN6n", "2.9K", ["392", "Comments"]], ["As conspiracy theories go mainstream, people can't tell what's real and what's fake. Find out how this hurts our democracy. CNN Films Presents #AfterTruth, tonight at 10 p.m. ET", "912", ["1.3K", "Comments"]], ["“Can civil unrest re-elect Donald Trump? Clearly he thinks so,” CNN’s  Michael Smerconish says. “From all indications, [the Trump campaign is] going to be playing up law and order as a path to victory.” https://cnn.it/31GFbRs", "906", ["1.4K", "Comments"]], ["Former Minneapolis police officer Derek Chauvin has asked a judge to dismiss murder charges against him in the death of George Floyd.", "53K", ["15K", "Comments"]], ["How are people using fake news, conspiracy theories, and disinformation as a political weapon intended to sow discord in democracy? CNN Films Presents #AfterTruth, tonight at 10 p.m. ET", "904", ["1.1K", "Comments"]], ["Go There visits Siberia, where wildfires are raging across the region following an extreme heat wave induced by climate change. More than 47 million acres in Russia have burned in 2020 so far, leading to air pollution that could further aggravate Covid-19 symptoms. CNN follows firefighters who are battling the flames, and speaks to a Greenpeace activist who has criticized the government’s response.", "892", ["203", "Comments"]], ["\"After Truth\" digs into how conspiracy theories and fake news start on the internet, make their way to mainstream, and then sow distrust and discord in our democracy. CNN Films Presents #AfterTruth, Saturday at 10 p.m. ET", "1.3K", ["980", "Comments"]], ["Jacob Blake’s father chokes up as he describes seeing his son in the hospital, saying he was “shackled to the bed.”  “His next question was, ‘Why did they shoot me so many times?’ And I said, ‘Baby, they weren't supposed to shoot you at all.’” https://cnn.it/2EsIjYm", "2.3K", ["2.1K", "Comments"]], ["\"At over 6 feet, the President is quite the imposing figure, thus we felt he was the perfect figure to remind our guests to take those selfies safely masked,\" a spokesperson said", "3.8K", ["826", "Comments"]], ["President Trump, speaking to a crowd of more than 1,000 supporters who weren't socially distancing and many not wearing masks, says his administration is focusing “on the science, the facts and the data” to combat Covid-19", "8.7K", ["3.7K", "Comments"]], ["In the wake of a strong speech by Biden at the Democratic National Convention last week, President Donald J. Trump appears to have swapped out the \"Biden's out of it!\" attack for one even more bizarre. | Analysis by Chris Cillizza", "3.3K", ["2.9K", "Comments"]], ["Go There heads to Kenya, Afghanistan, the UK, and Washington, D.C., to follow street artists from around the world as they take a stand against racism and police brutality. Inspired by the Black Lives Matter protests, these artists are using their work to heal, educate, and call out racial injustice in their communities", "1.1K", ["384", "Comments"]], ["Tune-in tonight to see President Trump speak at the Republican National Convention. Coverage begins at 7 p.m. ET", "9.1K", ["2.8K", "Comments"]], ["$200,000,000,000", "26K", ["6.7K", "Comments"]], ["Hurricane Laura roared across the Louisiana coastline early Thursday as a Category 4 storm, bringing 150-mph winds and devastating destruction. Authorities warn a “life-threatening” storm surge continues along much of the Louisiana coastline with the risk of strong winds, flooding and possible tornadoes. The damage is only beginning to come into full view as day breaks but some 600,000 people are already without power. CNN meteorologist Allison Chinchar has the latest forecast. Leave your questions for her below.", "3.4K", ["1.4K", "Comments"]], ["US stock futures are signaling a flat start to trading on Thursday. But any gains would mark new all-time highs for both the S&P 500 and Nasdaq. Investors are paying close attention to a major speech by Jerome Powell, who promised to double down on the Federal Reserve’s efforts to boost long-elusive inflation. Shares of Abbott Labs spiked 9% in premarket trading after the company received emergency approval from the FDA for a test that can detect Covid-19 in just 15 minutes.", "302", ["198", "Comments"]], ["How do you think President Trump’s 2020 nomination acceptance speech will be different from his 2016 speech? Join us for special coverage of the final night of the 2020 Republican National Convention, starting tonight at 7 p.m. ET", "3.3K", ["2.7K", "Comments"]], ["Yaser Abdel Said, who was placed on the list for the 2008 homicide of his daughters Amina and Sarah, has been taken into custody, according to the FBI Dallas Field Office", "4K", ["691", "Comments"]], ["Vice President Mike Pence delivered a pro-police \"law and order\" message during his Republican National Convention speech. \"Too many heroes have died defending our freedom to see Americans strike each other down. We will have law and order on the streets of this country for every American of every race and creed and color.\" https://cnn.it/2G2CIIz", "3K", ["1.6K", "Comments"]], ["Are you affected by Hurricane Laura? When it's safe, text, iMessage or WhatsApp your videos, photos and stories to CNN, +1 347-322-0415.  Latest updates: https://cnn.it/3jgXhiH", "348", ["455", "Comments"]], ["As conspiracy theories go mainstream, people can't tell what's real and what's fake. Find out how this hurts our democracy. CNN Films Presents #AfterTruth, Saturday at 10 p.m. ET", "868", ["1.1K", "Comments"]], ["\"One, two, three, four -- close the classrooms, close the doors!\" teachers said. \"Five, six, seven, eight -- we won't go until it's safe!\"", "3.5K", ["1.6K", "Comments"]], ["Why do people end up on skid-row? The reasons are as varied as the residents, but one thing is certain; the resources to help aren’t there. Join W. Kamau Bell, to find out what it’s like living on the streets of L.A. An all-new #UnitedShades, Sunday at 10 p.m. ET/PT", "296", ["293", "Comments"]], ["In a shift that perplexed some doctors, the US Centers for Disease Control and Prevention has changed its Covid-19 testing guidelines to say some people without symptoms may not need to be tested, even if they've been in close contact with someone known to have the virus. Dr. Sanjay Gupta is here to answer your questions about coronavirus. What would you like to ask?", "4.4K", ["2.8K", "Comments"]], ["Progressive Democrats are poised to claim a series of historic successes in congressional races decided during a nationwide uprising over racial injustice and inequality.", "11K", ["1.6K", "Comments"]], ["Join Jake Tapper for a new CNN Special Report – Trump & The Law – After Impeachment. Sunday at 10 p.m. ET", "832", ["1K", "Comments"]], ["Against epic odds, Dr. David Fajgenbaum found a drug that saved his own life. Then a global pandemic hit. Now his lab has devoted nearly all of its resources to aiding doctors fighting the novel coronavirus.", "1.9K", ["253", "Comments"]], ["At least 40,173 new cases were reported, according to a tally by Johns Hopkins University. The previous daily high was reported on Thursday.", "3.6K", ["1.3K", "Comments"]], ["The United Kingdom declared a \"major incident\" Thursday when thousands of visitors went to local beaches to escape the heat. The country is slowly easing coronavirus restrictions, but the number of beachgoers has cause a huge dilemma. CNN's Salma Abdelaziz is in Bournemouth, England where people are still filling the beach. What questions do you have?", "1.9K", ["1.2K", "Comments"]], ["Stocks are looking to end a choppy week on a negative note, with futures pointing to a drop at the open for the Dow, S&P 500 and Nasdaq. The US government reported that personal income fell last month but that spending increased more than expected in May. Big banks will be in focus after a strong rally Thursday. Shares of Goldman Sachs, JPMorgan Chase and other top Wall Street firms are likely to fall after the Federal Reserve announced the results of its latest bank stress tests and said banks should cap their quarterly dividend payout to shareholders and suspend stock buybacks due to the Covid-19 outbreak and economic uncertainty.", "835", ["991", "Comments"]], ["The risk of serious complications and death rises with age, the CDC says, although there's no clear age cutoff for higher or lower risk. People with diabetes, kidney disease, moderate to severe asthma, and obesity are also at higher risk.", "3K", ["974", "Comments"]], ["Join Jake Tapper for a new CNN Special Report – Trump & The Law – After Impeachment. Sunday at 10 p.m. ET", "557", ["423", "Comments"]], ["Inside Iceland’s borders, a rigorous tracing and tracking system has been largely successful in keeping the country’s death rate low despite a high infection rate. CNN’s Max Foster takes us around the island to show us how it has largely managed to avoid a coronavirus catastrophe and keep its death rate at just 10 as of June 25.", "1.6K", ["397", "Comments"]], ["\"The Saharan dust will overtake entire states,\" CNN meteorologist Tyler Mauldin says. \"Even southern Illinois and Ohio may get into the mix. That's how far north it could get pulled up.\"", "1.8K", ["481", "Comments"]], ["Join Jake Tapper for a new CNN Special Report – Trump & The Law – After Impeachment. Sunday at 10 p.m. ET", "631", ["861", "Comments"]], ["Florida, California and Texas are all seeing a surge in coronavirus cases, with record high number of new cases. CNN’s Dr. Sanjay Gupta is here to answer your questions about why this is happening and what you can do to minimize the spread. What questions do you have?", "3.3K", ["1.7K", "Comments"]], ["Stocks are headed toward another day of losses in early trading as concerns about an increase in Covid-19 cases and continued weak economic data derail some of the earlier hopes about America getting back to business as usual. The US government said Thursday that nearly 1.5 million more people filed for unemployment benefits last week. While that number was lower than a week ago, it was higher than forecasts. In corporate news, shares of Disney were down more than 2% after the entertainment giant said it was delaying plans to reopen its iconic Disneyland theme park in California. https://cnn.it/3ezZO5x", "1K", ["1.2K", "Comments"]], ["What do you think can be done to stop the spike in Coronavirus cases around the country? Bill Gates joins Anderson Cooper and Dr. Sanjay Gupta for a new CNN Global Town Hall - Coronavirus: Facts and Fears. Tonight at 8 p.m. ET", "936", ["834", "Comments"]], ["Pride is normally a time of celebration for the LGBTQ community. But this year, social distancing means that Pride parades and gatherings can’t happen in their traditional form: https://cnn.it/2YxR9Li Here’s what Pride means to LGBTQ people around the world – whether they’re together or apart.", "1.6K", ["786", "Comments"]], ["The world's most powerful nation lacks a coherent national strategy to meet another cresting viral crisis, the capacity or even the willingness to take steps that might stop it. It is also led by a man who is suggesting by his actions and attitudes that he doesn't care that much about the unfolding tragedy, writes Stephen Collinson", "5.6K", ["2.7K", "Comments"]], ["As protests over the killing of George Floyd continue in the US, the Black Lives Matter movement is also spreading across the globe. CNN heads to the UK, Australia, and France to see how people are storming the streets to end systemic racism and police brutality in their own countries.", "2K", ["1.2K", "Comments"]], ["Why do you think Coronavirus has recently surged in some states? Bill Gates joins Anderson Cooper and Dr. Sanjay Gupta for a new CNN Global Town Hall - Coronavirus: Facts and Fears. Thursday at 8 p.m. ET", "691", ["628", "Comments"]], ["Whole Foods Market's Starkey Spring Water had \"concerning levels of arsenic,\" amounting to three times the level of the chemical compared to other brands, the consumer watchdog group says.", "2.2K", ["331", "Comments"]], ["What do you think can be done to stop the spike in Coronavirus cases around the country? Bill Gates joins Anderson Cooper and Dr. Sanjay Gupta for a new CNN Global Town Hall - Coronavirus: Facts and Fears. Thursday at 8 p.m. ET", "1K", ["896", "Comments"]], ["Joe Biden is leading President Donald J. Trump by double-digits among registered voters, according to a new poll by The New York Times and Siena College.", "49K", ["11K", "Comments"]], ["Stocks are headed for a drop Wednesday morning as investors digest some of the market's big gains since March. Concerns about a rise in Covid-19 cases in some states is leading some to worry about a second wave of the novel coronavirus. In corporate news, RV maker Winnebago reported sales that topped forecasts as more people look to take road trips as vacations. But shares fell in early trading as the stock has already enjoyed a huge spike this year. https://cnn.it/31jaZvA", "1.1K", ["1.2K", "Comments"]], ["In the remote Peruvian village of Caimito, 80 percent of this Shipibo community have shown symptoms of coronavirus, according to local nurse Elias Magin. The nearest hospital is an eight-hour boat ride away.", "3.7K", ["486", "Comments"]], ["The current Saharan dust episode is leading to the worst dust storm in the Caribbean in decades. Soon the dust is forecast to move across the Gulf of Mexico toward Texas.", "1.7K", ["453", "Comments"]], ["Natalie White has been arrested and is facing charges of first-degree arson in connection with the Wendy's restaurant fire that broke out during the protests that followed Rayshard Brooks' death, authorities said.", "4.7K", ["1.8K", "Comments"]], ["Employees from a Southern California sheriff's and district attorney's office were among three people who were arrested after multiple people were caught on a security camera vandalizing a Black Lives Matter sign, authorities said.", "7.3K", ["2.5K", "Comments"]], ["Coronavirus concerns led Kentucky election officials to close most polling locations for today's primary, going from nearly 3,700 polling locations to just 170. This decision has led to nationwide outcry of voter suppression. The police killing of Breonna Taylor is also playing a big role in the primary, as voters are deciding who will take on Senate Majority Leader Mitch McConnell. CNN's Jeff Zeleny is in Louisville at a voting site where 527 precincts are located. What questions do you have?", "1.8K", ["1.1K", "Comments"]], ["Stocks are pointing to a higher open Tuesday morning following a volatile night of after-hours trading. Futures initially tanked after White House adviser Peter Navarro said in an interview that the US trade deal with China was \"over,\" but stocks recovered after President Trump then tweeted to say the agreement was \"fully intact.\" In corporate news, shares of Apple are up about 2% and poised to hit another new record high as analysts liked what they heard from the iPhone maker about the new iOS 14 and other updates from Apple's Worldwide Developers Conference on Monday. https://cnn.it/3euGlmT", "1K", ["843", "Comments"]], ["The US government is investing more than $3 billion to come up with a vaccine against the coronavirus", "3.2K", ["845", "Comments"]], ["As states reopen, many are facing a rise in coronavirus cases, but none as high as Florida which has tripled its cases. Gov. Ron DeSantis is warning that this uptick is particularly high amongst people in their 20s and 30s. CNN's Rosa Flores is in Miami Beach talking to people about the rise in cases, what questions do you have for her?", "1.6K", ["1.1K", "Comments"]], ["An unprecedented heatwave in one of the coldest places on Earth just reached a distressing milestone. Temperatures in the small Siberian town of Verkhoyansk hit 100.4 degrees Fahrenheit on Saturday. It's a record-high temperature in one of the fastest-warming places in the world.", "3.4K", ["679", "Comments"]], ["“We’re nowhere near... a surge that would truly challenge our hospital capacity, but we can’t wait until we get to those points to start being concerned,” Miami Beach Mayor Dan Gelber about the spike in Covid-19 cases. “We don’t want to get to the point where we were before.” https://cnn.it/3doTOuY", "801", ["525", "Comments"]], ["Investors seem concerned about the reopening of America and a potential second wave of Covid-19 cases. Stocks fell at the open Monday. In corporate news, shares of Virgin Galactic are surging after announcing a deal with NASA to train private astronauts for trips to the International Space Station. And all eyes will be on Apple as the iPhone maker is set to announce new products and services at a virtual Worldwide Developers Conference later this afternoon. https://cnn.it/37SD52o", "584", ["266", "Comments"]], ["One of two types of coronavirus test kits produced by the US Centers for Disease Control and Prevention in January were likely contaminated, US Health and Human Services confirmed.", "1.8K", ["512", "Comments"]], ["House Judiciary Chairman Jerry Nadler said he is confident Geoffrey Berman, the powerful US attorney who departed his post Saturday after a standoff with the Trump administration, will testify before his committee.", "5K", ["1K", "Comments"]], ["In a statement on its website, the company that owns Uncle Ben's wrote that \"now is the right time to evolve the Uncle Ben's brand, including its visual brand identity, which we will do.\"", "1.1K", ["1.1K", "Comments"]], ["\"This treatment of a crisis opens up a whole new dimension because you see every year at least 7 million people die from illnesses related to air pollution,\" said Thunberg, citing the World Health Organization.", "6.9K", ["1.6K", "Comments"]], ["\"I just feel like some of the system could look at us as individuals... and not just do us as if we are animals.\" Rayshard Brooks, who was killed by an ex-police officer, gave an interview in February to a company about the struggles after incarceration. This first aired June 18, 2020.... https://cnn.it/3hzakw1 See More", "2K", ["946", "Comments"]], ["Vice President Mike Pence declined to say the words \"Black lives matter\" during an interview with an ABC affiliate in Pennsylvania, instead saying that \"all lives matter.\"", "64K", ["27K", "Comments"]], ["He simply is incapable of letting the perception that he might be frail or weak stand | Analysis by Chris Cillizza", "3.5K", ["2.3K", "Comments"]], ["JUST IN: The US Navy will fire the captain of the USS Theodore Roosevelt aircraft carrier who warned about coronavirus on his ship, sources say. A preliminary investigation recommended he be reinstated.", "10K", ["1.7K", "Comments"]], ["How do you laugh in the face of Coronavirus and racism? Late night comic Trevor Noah shares his take in a special interview on Anderson Cooper 360 tonight at 9:30 p.m. ET", "2.7K", ["695", "Comments"]], ["Until last week, Beijing seemed to have all but moved on from the coronavirus pandemic. But that facade of normalcy was shattered last week.", "5.7K", ["822", "Comments"]], ["“[Trump] didn’t hire very well. He did not have experience at running government, and didn’t know how to put together a team that could work well with him,” former acting White House chief of staff Mick Mulvaney says about some of the President’s appointees who have spoken out against him. “The military personality is just not the type that works well with Donald Trump,\" Mulvaney added. https://cnn.it/2UU6T9t", "1K", ["791", "Comments"]], ["On this Juneteenth, the Black community of Tulsa, Oklahoma, is on edge as President Trump and thousands of his supporters head to town for the first campaign rally in months on Saturday. We tour the neighborhood once known as “Black Wall Street” to learn how the dark and largely forgotten 1921 Tulsa race massacre has contributed to today’s tension, and meet young leaders hoping to bring change to their beloved city.", "7.7K", ["2.4K", "Comments"]], ["\"Following discussions with the Secretary of Defense about shared concerns, the Secretary of the Air Force is conducting an investigation into the use of Air National Guard RC-26 aircraft to support civil authorities during recent protest activity in U.S. cities,\" an Air Force spokesperson said.", "1.6K", ["462", "Comments"]], ["Go There heads to an undisclosed location in Georgia to visit Freedom University, the nation’s only sanctuary campus for undocumented students. The community has been on edge while anxiously awaiting the Supreme Court's decision on whether to terminate the DACA program. On Thursday, it was announced that DACA participants would be able to remain in the US -- for now. We follow several students as they gather at this underground network to talk about their uncertain futures. Note: This episode was filmed in February before the coronavirus shutdown when classes at Freedom University were still in session.", "1.3K", ["337", "Comments"]], ["What questions do you have about the coronavirus pandemic? Reply in comments below and we will feature some during a new CNN Global Town Hall - Coronavirus: Facts and Fears with Anderson Cooper and Dr. Sanjay Gupta. Live tonight at 8 p.m. ET.", "630", ["1.3K", "Comments"]], ["The Supreme Court blocked the Trump administration's attempt to end DACA, an Obama-era program that protects hundreds of thousands of immigrants brought to the US as children from deportation. https://cnn.it/3hDTXOL", "15K", ["1.3K", "Comments"]], ["Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, tells CNN's Dr. Sanjay Gupta this morning that football may not happen at all this year. Dr. Gupta is here to answer your questions and discuss how football could look different going forward. What would you like to ask?", "2.9K", ["1.6K", "Comments"]], ["\"I just feel like some of the system could look at us as individuals... and not just do us as if we are animals.\" Rayshard Brooks, who was killed by an ex-police officer, gave an interview in February to a company about the struggles after incarceration. https://cnn.it/3hzakw1", "1.9K", ["1.4K", "Comments"]], ["CNN looks at Iceland’s testing and contact tracing strategy that has allowed it to restart its economy. https://cnn.it/3fA1bkT", "1.4K", ["293", "Comments"]], ["After standoffs between protesters and police in the neighborhood of Capitol Hill led to the police department vacating the local precinct, protestors occupied the six-block zone. CNN's Dan Simon goes inside the occupied area, which has now taken on a festival-like atmosphere.", "2.9K", ["1.6K", "Comments"]], ["\"It'd be one thing if you're fighting al Qaeda in the streets, but we're not,\" said an Army veteran. \"They're facing a peaceful crowd of folks exercising their constitutional rights. It's ridiculous.\"", "1.9K", ["524", "Comments"]], ["A judge has denied an emergency motion to stop President Donald J. Trump's campaign rally in Tulsa, Oklahoma, on Saturday", "8.6K", ["5.4K", "Comments"]], ["\"Standing there in front of those people, we knew we were pushing it.\" A group of 16 friends all tested positive for coronavirus after a night out at a recently reopened Florida bar.", "8.6K", ["3.1K", "Comments"]], ["\"Please, sir. They are kids,\" Shanelle Ladd shouted at the top of her voice, telling a Clayton County police officer. \"Why you got a gun out?\"", "10K", ["4.6K", "Comments"]], ["Here are some of the horrific acts behind the names on America's infamous monuments and tributes", "739", ["917", "Comments"]], ["President Trump signed an executive order on police reform on Tuesday, but states and localities around the country have been protesting and fighting for change for weeks now -- and winning. Go There heads to New York City with CNN’s Bill Weir to get a firsthand look into how New York became one of the first states to make major changes to police reform legislation.", "2.4K", ["915", "Comments"]], ["The department will compensate the officers in time off instead, LAPD told CNN. \"I recognize that you have worked tirelessly these past couple weeks,\" Police Chief Michel Moore said in the memo. \"Your dedication and commitment have not gone unnoticed.\"", "1.9K", ["975", "Comments"]], ["Atlanta police released a 911 call from the night Rayshard Brooks was killed. In the call, a Wendy’s employee told the operator she thought a man was intoxicated in his vehicle, which was parked in the restaurant’s drive-through. https://cnn.it/3ft1ONb", "812", ["1.2K", "Comments"]], ["A Minnesota police officer could have shot an armed teen early Monday, and though the officer would've been completely justified, he held his fire, St. Cloud Police Chief Blair Anderson said", "875", ["593", "Comments"]], ["The video footage of the incidents at West Point generated further questions about the physical well-being of the oldest first-term president in history", "2.8K", ["2.8K", "Comments"]], ["Rayshard Brooks, a 27-year old black man, was killed by Atlanta police on Friday by a white police officer after an altercation in a parking lot. Protests erupted across the city over the weekend and this morning protestors are taking their message to the state capitol in Atlanta. CNN's Boris Sanchez is there, what questions do you have for him?", "2.1K", ["2.8K", "Comments"]], ["Supreme Court says federal law protects LGBTQ workers from discrimination. \"The Supreme Court has spoken very clearly in this decision, 6-3, that it is now unlawful, under federal law, to fire someone simply because they are LGBT, ... and it's a big difference from how the law was a half an hour ago, the way it is today,\" says CNN legal analyst Jeffrey Toobin. https://cnn.it/2N1YGvo", "5.4K", ["736", "Comments"]], ["“The decision to shoot him in the back was one made out of maybe impatience or frustration or panic, but it was not one that justifies deadly force. It was murder.” Former Georgia gubernatorial nominee Stacey Abrams says about Rayshard Brooks’ death. https://cnn.it/2YAFbQ6", "1.5K", ["1.3K", "Comments"]], ["Here's a look inside an area in Seattle near a downtown police precinct that protesters have occupied and are referring to as the \"Capitol Hill Autonomous Zone.\" https://cnn.it/3hw2eUD", "1.6K", ["586", "Comments"]], ["\"There is one group of generals, however, that the President is standing firm with: dead racist losers — more specifically, the Confederate commanders after whom 10 Army bases are currently named,\" said CNN's Jake Tapper during his closing monologue on Sunday. Read his full remarks.", "9.3K", ["2.5K", "Comments"]], ["What fascinates you about bats? Meet scientists investigating these animals. CNN Special Report – Bats – The Mystery Behind Covid-19 airs tonight at 10 p.m. ET", "505", ["291", "Comments"]], ["RECALL ALERT: New Jersey company Lakeside Refrigerated Services is recalling nearly 43,000 pounds of raw ground beef products because they may be contaminated with E. coli, said the US Department of Agriculture's Food Safety and Inspection Service", "2.4K", ["502", "Comments"]], ["What do you think it takes to lead in times of crisis? Meet four of the nation’s top mayors to find out. Muriel Bowser, Keisha Lance Bottoms, Lori Lightfoot, and London Breed join Laura Coates for Mayors Who Matter: A CNN Town Hall on Race and Covid-19. Tonight at 9 p.m. ET", "2K", ["1.1K", "Comments"]], ["Four of the nation’s top mayors - Muriel Bowser, Keisha Lance Bottoms, Lori Lightfoot, and London Breed join Laura Coates for a new CNN town hall on Race and Covid-19. Mayors Who Matter. Tonight at 9 p.m. ET", "1.6K", ["837", "Comments"]], ["The wife of Li Wenliang, the Wuhan whistleblower doctor who died of coronavirus in February, has given birth to their son, according to the Chinese state-run Litchi News.", "7K", ["271", "Comments"]], ["Meet the scientists investigating the mysteries of bats. Anderson Cooper shares their discoveries in a new CNN documentary. CNN Special Report – Bats – The Mystery Behind Covid-19 airs Sunday at 10 p.m. ET", "580", ["315", "Comments"]], ["What do you think it takes to lead in times of crisis? Meet four of the nation’s top mayors to find out. Muriel Bowser, Keisha Lance Bottoms, Lori Lightfoot, and London Breed join Laura Coates for Mayors Who Matter: A CNN Town Hall on Race and Covid-19. Sunday at 9 p.m. ET", "1.4K", ["760", "Comments"]], ["Corporations from Starbucks to McDonald's face criticism for their reactions to Black Lives Matter protests. CNN's Michael Smerconish examines. https://cnn.it/3fjBG7m", "438", ["426", "Comments"]], ["What do you think it takes to lead in times of crisis? Meet four of the nation’s top mayors to find out. Muriel Bowser, Keisha Lance Bottoms, Lori Lightfoot, and London Breed join Laura Coates for Mayors Who Matter: A CNN Town Hall on Race and Covid-19. Sunday at 9 p.m. ET", "2.1K", ["1.2K", "Comments"]], ["The Sesame Street crew is back on CNN for a family town hall about Covid-19, featuring a new song by Elmo, and Dr. Sanjay Gupta on the accordion. Plus, Olympic gold medalists Simone Biles and Laurie Hernandez. The ABCs of Covid-19, today at 10 a.m. ET", "904", ["283", "Comments"]], ["Eleven billion metric tons. That's how much plastic is expected to accumulate in the environment by 2025, according to new research from a group of scientists.", "1K", ["167", "Comments"]], ["\"We know Covid-19 is still in our community, and we expect to see increased cases,\" the Arizona Department of Health Services tweeted", "2.6K", ["906", "Comments"]], ["“I look forward to... understanding why — after I was shot and lying on the ground — not a single officer rendered aid,” says LaToya Ratlieff, who was shot in the face with a foam bullet by the Fort Lauderdale police during a protest. https://cnn.it/2Ac0YoU", "1.8K", ["1.2K", "Comments"]], ["Band-Aid’s traditional soft-pink bandages have long been a point of contention among people of color who have questioned why white skin is the default shade for a range of flesh-toned products", "13K", ["2.6K", "Comments"]], ["The governors of Nigeria's 36 states have resolved to declare a state of emergency on rape following a spate of sexual violence against women, according to the Nigerian Governor's Forum", "3.2K", ["546", "Comments"]], ["The state is still struggling to process tens of thousands of unemployment applications amid a massive fraud attack, as well as a surge in filings triggered by the coronavirus pandemic", "1.1K", ["409", "Comments"]], ["Four of the nation’s top mayors - Muriel Bowser, Keisha Lance Bottoms, Lori Lightfoot, and London Breed join Laura Coates for a new CNN town hall on Race and Covid-19. Mayors Who Matter. Sunday at 9 p.m. ET", "2.5K", ["1.1K", "Comments"]], ["The Sesame Street crew is back on CNN for a family town hall about Covid-19, featuring a new song by Elmo, and Dr. Sanjay Gupta on the accordion. Plus, Olympic gold medalists Simone Biles and Laurie Hernandez. The ABCs of Covid-19, Saturday morning at 10 a.m. ET", "649", ["261", "Comments"]], ["What do you think it takes to lead in times of crisis? Meet four of the nation’s top mayors to find out. Muriel Bowser, Keisha Lance Bottoms, Lori Lightfoot, and London Breed join Laura Coates for Mayors Who Matter: A CNN Town Hall on Race and Covid-19. Sunday at 9 p.m. ET", "2.2K", ["1.1K", "Comments"]], ["The Pulse shooting is still the deadliest act of violence against LGBTQ people in the US", "3.8K", ["487", "Comments"]], ["South Carolina began reopening businesses in late April. Restaurants were able to serve patrons at limited capacities as of May 11th. Now, the state is facing a rising number of coronavirus cases. CNN’s Natasha Chen is in downtown Greenville, what questions do you have for her?", "2.5K", ["1.6K", "Comments"]], ["Meet the scientists investigating the mysteries of bats. Anderson Cooper shares their discoveries in a new CNN documentary. CNN Special Report – Bats – The Mystery Behind Covid-19 airs Sunday at 10 p.m. ET", "507", ["324", "Comments"]], ["Lonnie Walker IV of the San Antonio Spurs has revealed he was sexually abused when he was young.", "598", ["125", "Comments"]], ["The Tamagotchi is back", "6.2K", ["1.6K", "Comments"]], ["Nike is adding June 19, a holiday called Juneteenth, to its list of official, paid company holidays", "9.6K", ["966", "Comments"]], ["People around the world have been logging in and interacting at virtual bars, clubs, and concerts to maintain a sense of connection during the pandemic. We explore these new virtual worlds with players and creators who say they plan to keep the digital party going even as lockdowns begin to lift.", "837", ["296", "Comments"]], ["Meet the scientists investigating the mysteries of bats. Anderson Cooper shares their discoveries in a new CNN documentary. CNN Special Report – Bats – The Mystery Behind Covid-19 airs Sunday at 10 p.m. ET", "583", ["293", "Comments"]], ["The next time you try to share a link on Twitter, you might get asked if you would like to open it first. The social network plans to test the new feature with Android users in its latest move to combat the spread of misinformation on the platform.", "1.7K", ["206", "Comments"]], ["The Sesame Street crew is back on CNN for a family town hall about Covid-19, featuring a new song by Elmo, and Dr. Sanjay Gupta on the accordion. Plus, Olympic gold medalists Simone Biles and Laurie Hernandez. The ABCs of Covid-19, Saturday morning at 10 a.m. ET", "1.1K", ["257", "Comments"]], ["Martin Gugino is still hospitalized in severe pain almost a week after Buffalo officers pushed him to the ground, causing the elderly man's head to bleed. But after learning President Donald J. Trump tweeted a conspiracy theory, suggesting Gugino was an \"ANTIFA provocateur,\" the 75-year-old just laughed.", "4.3K", ["1.7K", "Comments"]], ["Five months from the election, President Donald J. Trump is in the deepest trouble of his political career | Analysis by Stephen Collinson", "2.6K", ["2.7K", "Comments"]], ["\"As we recognize the 76th anniversary of D-Day this month, the President and the Department of Veterans Affairs are using our veterans as guinea pigs to test Trump's disproven theory about the potentially dangerous drug,\" writes Paul Rieckhoff for CNN Opinion", "7K", ["2.1K", "Comments"]], ["This week a World Health Organization official said asymptomatic coronavirus spread “appears to be rare,” contradicting CDC guidance and prompting widespread confusion. The WHO clarified the comments, saying \"there's much unknown.\" CNN’s Dr. Sanjay Gupta is here to discuss and answer your questions. What would you like to ask?", "2.6K", ["1.3K", "Comments"]], ["Demonstrations supporting the Black Lives Matter movement have been taking place across the country since the death of George Floyd. There have since been increasing demands to remove the legacy of racism and colonialism from British institutions, including monuments of controversial historical figures. CNN’s Nic Robertson is at a protest in south London. What questions do you have for him?", "4.1K", ["2.3K", "Comments"]], ["The documents requested by the nonpartisan and nonprofit group Citizens for Responsibility and Ethics in Washington showed the United States Secret Service estimated Trump Jr.'s 8-day hunting trip racked up expenses totaling $76,859.36.", "41K", ["10K", "Comments"]], ["Many Americans are out of work due to the coronavirus pandemic but solo parents struggle alone. CNN follows three single mothers in Florida, Ohio, and Texas who are rethinking the futures for themselves and their families.", "2.5K", ["496", "Comments"]], ["\"What will be clear — the street name and on the streets of our city — is that message that now this city must fully, fully deeply feel and this nation must as well, that Black Lives Matter,\" de Blasio said", "7.8K", ["1.8K", "Comments"]], ["The longest economic expansion in American history is officially over", "1.4K", ["987", "Comments"]], ["• Buffalo officers push 75-year-old protester • 6 Atlanta officers charged for using excessive force on college students • Fort Lauderdale officer was confronted by a black colleague • Kansas City cops pepper-sprayed a man who was yelling • A Louisville officer fired pepper balls at a reporter... • Fairfax, Virginia, officer charged with assault over use of stun gun during arrest See More", "4.4K", ["1.9K", "Comments"]], ["George Floyd, who was killed last month by Minneapolis police officers, will be laid to rest tomorrow next to his mother in Houston after his final memorial service. Today, there is a public viewing at The Fountain of Praise Church where mourners have gathered to remember him. CNN's Sara Sidner is live out front of the church, what questions do you have?", "3.7K", ["1.6K", "Comments"]], ["After spending two weeks ripping at racial wounds and painting a picture of a nation under siege from looters, domestic terrorists and radicals, President Donald J. Trump has probably already missed his chance to call for unity | Analysis by Stephen Collinson", "1.9K", ["2K", "Comments"]], ["Finally", "4.1K", ["323", "Comments"]], ["Futures are pointing to a higher open Monday following a gigantic rally Friday on the back of the much better than expected jobs report. Investors are also eagerly awaiting the Federal Reserve meeting on Wednesday, The central bank is expected to leave interest rates near zero in order to try and help stimulate the economy.", "353", ["375", "Comments"]], ["More than 140 scientists who have received funding and support from Mark Zuckerberg's philanthropic organization wrote to the Facebook CEO on Saturday expressing concern about how he handled President Trump's posts on the platform.", "5.9K", ["1.1K", "Comments"]], ["The economy is reopening and life is slowly getting back on track, but it's not back to normal. High unemployment rates and the need to socially distance will have lasting effects on how and where we work.", "1.3K", ["623", "Comments"]], ["Elmo, Abby Cadabby, and Cookie Monster are helping kids stand up to racism. Join Sesame Street and CNN for Coming Together: Standing Up to Racism, a town hall for kids and families, today at 10 a.m. ET", "3.2K", ["493", "Comments"]], ["\"I could scream to the four walls here, but they don't listen very well.\" A rare glimpse inside a nursing home where Covid-19 has been spreading, from the perspective of a resident kept inside.", "1.1K", ["336", "Comments"]], ["Do your kids have questions about racism and the nationwide protests? Elmo and his dad Louie join CNN for Coming Together: Standing Up to Racism, a town hall for kids and families, Saturday morning at 10 a.m. ET", "1.1K", ["332", "Comments"]], ["A new CNN Poll of Polls shows 51% of registered voters nationwide back former Vice President Joe Biden, while 42% support President Donald Trump in the 2020 presidential race.", "15K", ["6.3K", "Comments"]], ["\"The protestors have been peaceful, and last night, the Metropolitan Police Department did not make a single arrest. Therefore, I am requesting that you withdraw all extraordinary law enforcement and military presence from Washington, DC,\" Mayor Bowser wrote in a letter to President Donald J. Trump", "10K", ["2.6K", "Comments"]], ["Elmo, Abby Cadabby, and Cookie Monster are helping kids stand up to racism. Join Sesame Street and CNN for Coming Together: Standing Up to Racism, a town hall for kids and families, Saturday morning at 10 a.m. ET Parents, submit your questions at https://cnn.it/3f5gcv1", "3.2K", ["273", "Comments"]], ["\"Based on the way the disease spreads, there is every reason to expect that we will see new clusters and potentially new outbreaks moving forward,\" US Surgeon General Dr. Jerome Adams warned", "2.4K", ["845", "Comments"]], ["Here's what we know about the four ex-police officers facing charges in George Floyd's death, their role in his arrest, and their lives before and while they were on the force, based on their personnel files.", "2.9K", ["1.6K", "Comments"]], ["President Donald J. Trump  is now a decided underdog to reach the 270 electoral votes he needs to win a second term, writes Chris Cillizza | Analysis", "42K", ["12K", "Comments"]], ["Parents, what questions do you have about talking to your kids about racism, embracing diversity and the current protests sweeping the nation? CNN's Van Jones and Erica Hill are teaming up with Big Bird on Saturday to host a CNN Sesame Street town hall for kids and families addressing racism. Leave your questions in the comments and Erica and Van will be live Friday at 1:30pm ET to answer them.", "2.2K", ["3.4K", "Comments"]], ["Elmo, Abby Cadabby, and Cookie Monster are helping kids stand up to racism. Join Sesame Street and CNN for Coming Together: Standing Up to Racism, a town hall for kids and families, Saturday morning at 10 a.m. ET Parents, submit your questions at https://cnn.it/2Y39QoJ", "3.3K", ["593", "Comments"]], ["Washington, DC, Mayor Muriel Bowser said she wants out-of-state military troops out of the nation's capital after they were called in to handle the protests over the death of George Floyd", "9.6K", ["2.5K", "Comments"]], ["Dwayne The Rock Johnson wrote in the caption, \"Maybe one day that galvanizing leader will emerge. Either way, the process to change has already begun.\"", "9.8K", ["1.4K", "Comments"]], ["“The backlash that he received was from people who felt like he took what is a very trying experience of being black in America and he made it about himself,” sports journalist Jemele Hill says about Drew Brees’ comments on kneeling during the national anthem. https://cnn.it/2Y22PVb", "967", ["713", "Comments"]], ["Thousands of people are gathering in Hong Kong to mark the 1989 Tiananmen Square massacre, despite authorities denying permission for the gathering. CNN's Ivan Watson is there. What questions do you have?", "3.4K", ["951", "Comments"]], ["The star made an emotional speech into a megaphone as thousands poured through Hyde Park, marching in solidarity with protesters in the US", "7.3K", ["1.3K", "Comments"]], ["George Floyd tested positive for the novel coronavirus in a test taken after his death, according to Hennepin County’s new autopsy report released earlier today.", "9K", ["4.4K", "Comments"]], ["JUST IN: All of the former Minneapolis Police officers charged in connection with the death of George Floyd are now in custody.", "37K", ["2.9K", "Comments"]], ["\"The cast and showrunner of 'Brooklyn 99' condemn the murder of George Floyd and support the many people who are protesting police brutality nationally,\" the co-creator of the show wrote in a statement", "16K", ["1.4K", "Comments"]], ["Minnesota AG Keith Ellison announced that former Minneapolis police officer Derek Chauvin will now be charged with murder in the second degree for the death of George Floyd. The other three officers involved will be charged with aiding and abetting second degree murder. CNN's Josh Campbell is live in Saint Paul, Minnesota. What questions do you have?", "4.5K", ["1.7K", "Comments"]], ["Elmo, Abby Cadabby, and Cookie Monster are helping kids stand up to racism. Join Sesame Street and CNN for Coming Together: Standing Up to Racism, a town hall for kids and families, Saturday morning at 10 a.m. ET Parents, submit your questions at https://cnn.it/3eNErO6", "10K", ["899", "Comments"]], ["What's justice? \"I can't answer it because we haven't got it,\" says a close friend of George Floyd and former NBA player. \"Anybody know the answer please tell me because I sure don't know.\"", "4.6K", ["531", "Comments"]], ["The world's biggest movie theater chain says it has \"substantial doubt\" it can remain in business after closing locations across the globe during the coronavirus pandemic", "3.5K", ["1.1K", "Comments"]], ["Latin America is emerging as the newest epicenter of the pandemic, reporting more new daily cases than the United States. Many parts of the region have been impacted by ineffective leadership, extreme poverty, and lack of access to healthcare. Go There with CNN as the residents of Brazil, Mexico, and Colombia try and manage the rapidly rising death count.", "4.3K", ["459", "Comments"]], ["We’re live in New York where CNN’s Shimon Prokupecz is talking to protesters as they march through the city. New York is extending its 8 p.m. curfew for the rest of the week after protests led to violence and looting last night. What questions do you have for Shimon?", "4.5K", ["1.7K", "Comments"]], ["\"We are witnessing a failure of presidential leadership at a time when this country, when we the people, need it more than ever perhaps in our lifetime.\" Anderson Cooper reflects on President Trump pledging to send active military troops into US cities \"to dominate\" demonstrators amid protests following the death of George Floyd. It \"would be comical if it wasn't so dangerous and so destructive,\" notes Cooper.... https://cnn.it/3eGA2MJ See More", "17K", ["5.6K", "Comments"]], ["\"I actually got hit 7 times with rubber bullets and many with batons. My boy has stitches.\" Actor Kendrick Sampson said he was shot seven times with rubber bullets by police in Los Angeles on Saturday during a protest over the death of George Floyd.", "1.8K", ["1K", "Comments"]], ["\"It's a movement — if you don't put it down it will get worse and worse,\" President Donald J. Trump told the nation's governors. \"The only time it's successful is when you're weak and most of you are weak.\"", "30K", ["13K", "Comments"]], ["CNN's Omar Jimenez is on the ground in Minneapolis, MN at the memorial site for George Floyd, where he is speaking with protestors and mourners as they begin to make plans to move forward as cities across the nation remain in distress.", "4.3K", ["1.5K", "Comments"]], ["\"President Donald J. Trump calling protesters 'thugs' was a response that might have appeared on the pages of China's own government-controlled newspapers about Hong Kong,\" James Griffiths writes.", "1.3K", ["866", "Comments"]], ["New York City Mayor Bill de Blasio's daughter was arrested during protests on Saturday night, according to police sources.", "5.5K", ["1K", "Comments"]], ["The company released six instruction manuals on how to build blanket forts using everyday household items — chairs, stools, books and, of course, blankets", "1.3K", ["297", "Comments"]], ["Join Don Lemon CNN for a special report “I Can’t Breathe - Black Men Living and Dying In America” tonight at 8 p.m. ET", "2.7K", ["1.7K", "Comments"]], ["Families share personal stories of their loved ones lost to coronavirus. Jake Tapper hosts We Remember - A National Memorial Honoring the Victims of Covid-19 today at noon.", "1.7K", ["320", "Comments"]], ["■ After a restaurant burned down, the family running it continued to stand in support of protesters. ■ A bookstore became a safe space. Its owner refused to allow officers to use the space as a staging ground. ■ A tattoo parlor's owner boarded up the shop and sprayed supportive messages across the storefront. This post has been updated to clarify that the family who ran the restaurant that burned down supported protesters both before and after the building burned.", "6.9K", ["1.6K", "Comments"]], ["Renowned photographer Mark Seliger is to auction off portraits of famous names such as Brad Pitt and Julia Louis-Dreyfus to raise money for the fight against coronavirus. CNN Style", "1.2K", ["178", "Comments"]]]