[["Pence's performance at the debate could very well determine the political fates of both him and President Trump.", "708", ["94", "Comments"]], ["Is this \"soft bigotry\"? #IamVotingfor", "422", ["140", "Comments"]], ["Biden doesn’t think there should be a second presidential debate if President Trump still has coronavirus.", "1.3K", ["629", "Comments"]], ["Things got tense.", "76", ["32", "Comments"]], ["Lockdowns are too much for some to bear.", "679", ["83", "Comments"]], ["\"They broke down our gate. They trespassed on our property. Not a single one of those people is now charged with anything,” Mark McCloskey reportedly said.", "2.1K", ["981", "Comments"]], ["Things got a little intense after one passenger refused to wear a face mask.", "192", ["207", "Comments"]], ["Science?", "10K", ["3.2K", "Comments"]], ["Tulsi issued an apology but also challenged Omar to support her bill, which intends to ban ballot harvesting.", "325", ["77", "Comments"]], ["Miller is latest person from Trump's WH to contract COVID.", "219", ["288", "Comments"]], ["The actress had some harsh words for the president.", "1.8K", ["1.7K", "Comments"]], ["It appears POTUS is on the path to recovery.", "3.8K", ["658", "Comments"]], ["A privately-owned White House-themed gift shop in Washington, D.C. is looking to make some money off Trump's bout with COVID.", "505", ["154", "Comments"]], ["America and Japan are looking to curb the threat of the Chinese government.", "1K", ["61", "Comments"]], ["The Texas police officer who allegedly shot and killed Jonathan Price outside a gas station was arrested and charged with murder Monday, according to prosecutors.", "56", ["92", "Comments"]], ["Misdemeanor cruelty charges were filed against two former employees of an Oklahoma County jail and their supervisor after an investigation revealed that they forced inmates to listen to the children’s song “Baby Shark” on repeat for several hours.", "1.7K", ["322", "Comments"]], ["Isn't that how it's supposed to work, through Congress?", "1.1K", ["463", "Comments"]], ["SNL became the first TV show in New York to have a live studio audience for its season 46 debut by “casting” and then paying members of the audience.", "232", ["144", "Comments"]], ["Is this too excessive?", "259", ["61", "Comments"]], ["Here we go...", "9.1K", ["1.4K", "Comments"]], ["She had strong criticism for Trump after the display.", "1.8K", ["1.3K", "Comments"]], ["The scandal may hurt his candidacy...", "578", ["137", "Comments"]], ["What in the world is going on in Portland?", "2.3K", ["1.1K", "Comments"]], ["\"The establishment’s willful blindness and dogmatic adherence to free trade with China has failed the American people.\"", "315", ["118", "Comments"]], ["Cruz seems confident that they'll be able to get her confirmed.", "5K", ["299", "Comments"]], ["This might not go well with the \"Defund the Police\" crowd.", "1.7K", ["957", "Comments"]], ["The media had a few things to say about Trump's surprise drive-by outside the Walter Reed Medical Center", "794", ["512", "Comments"]], ["A large Hollywood-like sign, with the letters that spelled out “TRUMP,” appeared Tuesday along a highway in Los Angeles and has since been taken down.", "7.3K", ["651", "Comments"]], ["Tough talk from Nancy.", "8.8K", ["6K", "Comments"]], ["A Texas grand jury has indicted Netflix, Inc. for the controversial film \"Cuties\"", "7.6K", ["640", "Comments"]], ["This looks really bad.", "30K", ["7.7K", "Comments"]], ["WATCH: The media's reaction to President Trump's return to the White House from Walter Reed Medical Center.", "1.2K", ["730", "Comments"]], ["Woah.", "3.1K", ["275", "Comments"]], ["Rest in peace to a legend.", "1.2K", ["147", "Comments"]], ["The chance of a deal doesn't look promising.", "2.9K", ["1K", "Comments"]], ["Severe flooding in Italy and France have left 12 dead so far, but rescuers are also finding corpses long dead that have washed down to shore.", "448", ["45", "Comments"]], ["When white people attack black man while chanting 'black lives matter': the definition of irony #blacklivesmatter #BLM", "1.2K", ["514", "Comments"]], ["Yikes...", "2.5K", ["1.1K", "Comments"]], ["She's not wrong.", "3.6K", ["1.4K", "Comments"]], ["Which woman is nuttier? #publicfreakout", "822", ["211", "Comments"]], ["A slew of recent polls could indicate that Trump is losing support among seniors.", "2.1K", ["1.9K", "Comments"]], ["POTUS says he's geared up for the next presidential debate.", "4.5K", ["705", "Comments"]], ["Any violent demonstration is unacceptable.", "23K", ["9.7K", "Comments"]], ["Celebrities seized on the moment to take some cheap shots.", "347", ["422", "Comments"]], ["The university could be in a tough spot.", "592", ["77", "Comments"]], ["Mike Kucharski, the co-owner and vice president of JKC Trucking, spoke with the Daily Caller's Samantha Renck about blue-collar workers' support for President Trump, the first presidential debate and more.", "335", ["73", "Comments"]], ["Tucker delivered a scathing rebuke of Governor Cuomo.", "6.9K", ["374", "Comments"]], ["Will Democrats be able to refrain from attacking ACB's faith?", "774", ["424", "Comments"]], ["The order intends to facilitate a government response to mental health conditions exacerbated by the pandemic. This includes issues related to suicide prevention, the order notes.", "1K", ["139", "Comments"]], ["The Daily Caller's Caity McDuffee spoke with Tom Spencer, an election attorney, about Bush v. Gore and whether something similar will happen in the 2020 election.", "352", ["113", "Comments"]], ["The former Libertarian presidential candidate is facing charges for tax evasion and willful failure to file tax returns, the Justice Department announced.", "435", ["296", "Comments"]], ["Holt noted that both Biden and President Trump had a hand in the debate’s devolution.", "742", ["454", "Comments"]], ["Is this fair to children who need school?", "985", ["521", "Comments"]], ["A heartbreaking scene.", "722", ["179", "Comments"]], ["Yikes....", "3.4K", ["974", "Comments"]], ["A Louisiana family is suing a school system after their fourth-grader was suspended when a teacher saw a BB Gun in the child’s room during an online class.", "3.9K", ["780", "Comments"]], ["\"The dots are slowly being connected, far too slowly for those who would like the full truth to come out.\"", "1.8K", ["148", "Comments"]], ["Horrifying.", "318", ["46", "Comments"]], ["A woman was killed and two were seriously injured after a seaplane crashed into a concrete pier in Queens.", "204", ["25", "Comments"]], ["The number would be roughly 10% of the global population.", "233", ["199", "Comments"]], ["Multiple staff members made some serious accusations about Texas Attorney General Paxton.", "99", ["65", "Comments"]], ["Selfies aren't worth putting yourself in danger.", "314", ["197", "Comments"]], ["Two of McEnany’s top aides have contracted coronavirus.", "2K", ["1.6K", "Comments"]], ["Spooky stuff at the WH?", "441", ["183", "Comments"]], ["Biden's seen some gains in the polls.", "5.7K", ["3.2K", "Comments"]], ["POTUS received some well wishes from Israel.", "7.6K", ["178", "Comments"]], ["Wow", "2.6K", ["703", "Comments"]], ["It was a rare find.", "137", ["23", "Comments"]], ["A registered Democrat in Florida was reportedly arrested earlier in the week for allegedly requesting a mail-in ballot for his wife who has been dead for two years.", "3.3K", ["716", "Comments"]], ["“I think the fact that he’s an elite Democrat put him in this untouchable position,” Reade said.", "539", ["92", "Comments"]], ["Trump makes his return.", "6.1K", ["506", "Comments"]], ["We interviewed these Trump supporters outside Walter Reed Medical Center", "2.7K", ["215", "Comments"]], ["She had quite a criticism for the move.", "4.4K", ["2.8K", "Comments"]], ["Movie theaters are struggling in the age of COVID.", "288", ["262", "Comments"]], ["President Donald Trump Set To Leave Walter Reed", "8.8K", ["1.4K", "Comments"]], ["A police officer shot during riots in Louisville, Kentucky has been released from the hospital.", "1.3K", ["71", "Comments"]], ["Next level craziness.", "11K", ["6.1K", "Comments"]], ["Joy floated an interesting idea for the upcoming VP debate....", "1.6K", ["1.1K", "Comments"]], ["But Trump is a fascist?", "15K", ["5.6K", "Comments"]], ["He's ready to do whatever it takes.", "8.3K", ["256", "Comments"]], ["They Don't Realize These Are Actually Biden Quotes.", "2.1K", ["689", "Comments"]], ["The president will be returning to the White House tonight.", "4.5K", ["817", "Comments"]], ["I wouldn't want to be on this flight!", "1.7K", ["1.1K", "Comments"]], ["President Trump Potentially Being Discharged From Walter Reed Today", "14K", ["1.7K", "Comments"]], ["President Trump is apparently working to declassify documents related to the Russia investigation while he recovers from coronavirus.", "4.3K", ["374", "Comments"]], ["Actress Kirstie Alley from \"Cheers\" ripped into Democrats, saying they \"have accomplished nothing in the last 3 1/2 years\"", "67K", ["4.3K", "Comments"]], ["You don't see this everyday in DC!", "23K", ["2.2K", "Comments"]], ["Brutal numbers for the NBA.", "57K", ["10K", "Comments"]], ["FLOTUS thanked her supporters in an update after testing positive for COVID-19 and shared a message of hope.", "13K", ["652", "Comments"]], ["He will not be seeking reelection in 2022.", "261", ["47", "Comments"]], ["Bad news. Prayers up for Kayleigh.", "5.7K", ["2.1K", "Comments"]], ["\"He had it coming.\"", "315", ["236", "Comments"]], ["Harsh words.", "6.6K", ["2.9K", "Comments"]], ["Meadows pushed back on the idea that it caused unnecessary danger.", "2.7K", ["783", "Comments"]], ["Trump, tweeting from the hospital, shared a long list of reasons to vote for him in the upcoming election.", "4.8K", ["1.1K", "Comments"]], ["The Biden campaign has released an ad narrated by a rapper with close ties to Louis Farrakhan, despite Farrakhan's numerous anti-Semitic comments.", "597", ["169", "Comments"]], ["Is the stunt cute or cringe?", "1.6K", ["1.2K", "Comments"]], ["Oh my...", "1.8K", ["399", "Comments"]], ["NYC Mayor Bill de Blasio announced Sunday he intends to enact lockdown restrictions in 20 coronavirus hotspots following a spike in positivity rates.", "900", ["445", "Comments"]], ["Looks like Michigan Gov. Gretchen Whitmer won't get her way", "2.1K", ["177", "Comments"]], ["Not good news for POTUS", "3.4K", ["2.3K", "Comments"]], ["A personal assistant to President Donald Trump has tested positive for COVID-19", "354", ["298", "Comments"]], ["This interview got a bit testy 😳", "3K", ["1.1K", "Comments"]], ["Not smart.", "69", ["6", "Comments"]], ["A group of protesters swarmed him.", "2.8K", ["471", "Comments"]], ["His largest lead so far.", "11K", ["6.4K", "Comments"]], ["That would be a bold move.", "7.4K", ["515", "Comments"]], ["\"He's a hero, that man!\"", "12K", ["1.6K", "Comments"]], ["He had been in close proximity to the president.", "719", ["634", "Comments"]], ["Watch what happens when this man refused to say 'black lives matter'", "864", ["289", "Comments"]], ["Very dramatic!", "477", ["168", "Comments"]], ["Abysmal.", "37K", ["6.9K", "Comments"]], ["He waved and gave a thumbs-up.", "38K", ["3.7K", "Comments"]], ["Pelosi said Sunday Republicans have allowed the coronavirus to “run free in the White House” because they are “anti-science.”", "12K", ["8K", "Comments"]], ["A federal judge ruled against deportation for an illegal immigrant from Indonesia who was detained on church property in Maryland last month.", "1.1K", ["193", "Comments"]], ["Joe Biden's presidential campaign released an ad this week narrated by a popular rapper who has called Nation of Islam leader Louis Farrakhan his 'mentor.'", "1.5K", ["423", "Comments"]], ["😱WOW😱 Richard has been out in front of Walter Reed since Friday evening (and hasn’t left). He came to pray for Trump and his health. “We hope you get better soon. I’ll be here until Marine One lands and until we see you off, sir,” he said.", "21K", ["1.9K", "Comments"]], ["He blamed the Trump administration's response to the pandemic.", "3.8K", ["2K", "Comments"]], ["Supporters of President Donald Trump are far more likely to vote in person on Election Day, which may give him a significant early advantage against Joe Biden.", "6K", ["1.1K", "Comments"]], ["The Media Won't Show You This!", "28K", ["2.3K", "Comments"]], ["The coach had a bone to pick", "120", ["21", "Comments"]], ["What did y'all think of Chris Wallace's moderation? Comment below! Unfit To Print Episode 71 Subscribe to the podcast on iTunes https://urlzs.com/1wpfr... and Soundcloud https://urlzs.com/nS4Zy Become a Daily Caller PATRIOT: https://dailycaller.com/subscribe/ Subscribe now to The Spectator’s US edition. The speech is free — subscriptions are just $1 a week. Visit spectator.us for more See More", "1.1K", ["2K", "Comments"]], ["Some good news 🙏", "9.3K", ["1.6K", "Comments"]], ["How did no one see this coming?", "2.9K", ["170", "Comments"]], ["That escalated quickly.", "7.4K", ["5.8K", "Comments"]], ["A new study warns of the possibility of 'attacks on vital infrastructure' and even a potential 'mass-casualty event.'", "849", ["642", "Comments"]], ["A furloughed photographer who documented protests starting on May 31, expected to find white supremacists behind the looting but instead found anarchists.", "2.1K", ["438", "Comments"]], ["Here's what 16 hours in jail is really like...", "264", ["130", "Comments"]], ["A Florida man who tried to get access to a mail-in ballot for his dead wife in order to 'test the system' has been charged with voter fraud, authorities said.", "1.4K", ["294", "Comments"]], ["Wow", "3.2K", ["2K", "Comments"]], ["Amazon continues to offer products related to the QAnon conspiracy theory on its marketplace despite banning Proud Boys and Washington Redskins merchandise.", "296", ["140", "Comments"]], ["Mitch McConnell expressed his intention to hold a vote to confirm before the election, but also said that a lame duck Senate could also vote to confirm.", "1.6K", ["842", "Comments"]], ["Daniel Cameron fired back at critics", "2.3K", ["153", "Comments"]], ["Former CIA Director John Brennan reveals in a forthcoming book and interview that there was internal division at the spy agency over Trump-Russia intelligence.", "165", ["70", "Comments"]], ["Oh my...", "370", ["141", "Comments"]], ["Melania Trump sounded close to tears in a secretly recorded audio tape in which she trashed the 'liberal media.'", "4.8K", ["3K", "Comments"]], ["Scary attack.", "310", ["44", "Comments"]], ["This is a big step for the social media giant...", "5.9K", ["1.5K", "Comments"]], ["Chinese President Xi Jinping wished President Donald Trump and the first lady 'a speedy recovery'", "1.1K", ["389", "Comments"]], ["Trump supporters showed up in the nation's capital", "27K", ["1.1K", "Comments"]], ["Former New Jersey Gov. Chris Christie tested positive for coronavirus, he announced Saturday morning.", "2K", ["853", "Comments"]], ["Doctors have confirmed POTUS is not currently on oxygen.", "1.4K", ["422", "Comments"]], ["Trump Just Tweeted This Video Updating The Nation On His Health", "23K", ["2.7K", "Comments"]], ["Former CIA Director John Brennan reveals in a forthcoming book and interview that there was internal division at the spy agency over Trump-Russia intelligence.", "461", ["216", "Comments"]], ["\"He had it coming.\"", "1K", ["754", "Comments"]], ["Not good.", "4.8K", ["5.8K", "Comments"]], ["Amazing.", "386", ["39", "Comments"]], ["Another U.S. Senator with COVID-19", "1K", ["1.1K", "Comments"]], ["Why are you walking away?", "8.4K", ["870", "Comments"]], ["Oh my...", "770", ["280", "Comments"]], ["You don't see this everyday in DC!", "74K", ["8.2K", "Comments"]], ["The White House appeared to contradict itself with two separate messages regarding President Donald Trump's health on Saturday.", "470", ["431", "Comments"]], ["They're hoping she gets swiftly confirmed.", "8.6K", ["374", "Comments"]], ["LIVE from DC!", "28K", ["1.9K", "Comments"]], ["Bad news for the New England Patriots and Cam Newton", "171", ["194", "Comments"]], ["\"He had it coming.\"", "1.1K", ["956", "Comments"]], ["He and other executives embezzled union funds and spent the money on vacations, green fees and high-end meals, according to the DOJ.", "1.2K", ["289", "Comments"]], ["\"For Barrett, fundamental rights such as the right to keep and bear arms as guaranteed by the Second Amendment, are too precious to be swept aside by arbitrary laws.\"", "3.8K", ["602", "Comments"]], ["He's the latest Trump staffer to test positive...", "1.2K", ["1.1K", "Comments"]], ["Kathie Lee Gifford spoke with the Daily Caller's Samantha Renck about her new movie \"Then Came You,\" her favorite memories with Regis Philbin and more.", "474", ["139", "Comments"]], ["Some Christian leaders are pushing back on Biden's faith.", "2.7K", ["1.7K", "Comments"]], ["That's a lot of employees...", "391", ["301", "Comments"]], ["Pompeo met with Vatican officials to discuss religious freedom and their differing approaches to China.", "642", ["84", "Comments"]], ["Though unlikely, it is possible that President Trump and Democratic nominee Joe Biden could tie in November’s election, receiving 269 electoral votes each.", "220", ["257", "Comments"]], ["Rev. John Jenkins, who visited the White House for the announcement of Amy Coney Barrett’s nomination to the Supreme Court, has tested positive for the coronavirus.", "569", ["399", "Comments"]], ["Strong words from Duckworth.", "1.1K", ["527", "Comments"]], ["A New York union leader was charged in an alleged fraud, bribery and racketeering scheme along with 10 other union leaders, according to a new indictment.", "893", ["133", "Comments"]], ["Breaking news journalists probably didn't get much sleep this week...", "271", ["69", "Comments"]], ["Great news.", "471", ["442", "Comments"]], ["George Santos, a Republican candidate running in New York’s 3rd Congressional District, spoke with the Daily Caller’s Samantha Renck about the presidential debate, President Trump’s immigration policies and more.", "197", ["33", "Comments"]], ["\"He had it coming.\"", "7.2K", ["5.8K", "Comments"]], ["What in the world?", "43", ["23", "Comments"]], ["Lindsey Graham presses James Comey on Steele dossier", "1.9K", ["387", "Comments"]], ["Hoping Ronna gets well soon.", "4.7K", ["1.1K", "Comments"]], ["Chris Murkowski, the host of 'Watchdog on Wall Street' and the president of Murkowski Investments, spoke with the Daily Caller's Samantha Renck about what President Trump's COVID-19 diagnosis means for the market, the recent jobs report and more.", "128", ["32", "Comments"]], ["Corey Lewandowski, Trump's former campaign manager, talked to the Daily Caller's Caity McDuffee about the Trump campaign's game plan after the president tested positive for COVID-19.", "1.2K", ["334", "Comments"]], ["Pray for the president.", "12K", ["1.9K", "Comments"]], ["SCOTUS nominee ACB is negative.", "6.1K", ["983", "Comments"]], ["Scarborough wasn't happy about the decision.", "1.3K", ["323", "Comments"]], ["A scary thought...", "329", ["209", "Comments"]], ["\"For decades the powerful Pharma lobby has been very successful at getting Washington to resist measures to provide relief from this lopsided and predatory situation. But no longer, thanks to President Trump.\"", "544", ["41", "Comments"]], ["It didn't take long for the event to become politicized.", "1.3K", ["1.2K", "Comments"]], ["Grasping at straws.", "2.6K", ["950", "Comments"]], ["Pretty unhinged stuff.", "3.2K", ["1.8K", "Comments"]], ["“I’m disgusted.\"", "14K", ["4.1K", "Comments"]], ["It was a horrifying attack in broad daylight.", "3.3K", ["1K", "Comments"]], ["What reaction do you expect from the media?", "1K", ["960", "Comments"]], ["A truly touching moment.", "323", ["101", "Comments"]], ["Wishing Mike Lee a speedy recovery.", "1.8K", ["347", "Comments"]], ["Joe Grogan, the former Domestic Policy Council Director at the White House, joined Daily Caller's Senior White House correspondent Christian Datoc to discuss President Trump's newly announced healthcare plan, the coronavirus task force, and more.", "150", ["25", "Comments"]], ["Pure evil.", "2.2K", ["1.7K", "Comments"]], ["Here are some of the hottest come backs dropped at the first Presidential Debate!", "2.5K", ["347", "Comments"]], ["The news isn't going to stop the Senate from continuing her nomination process.", "11K", ["656", "Comments"]], ["After the first presidential debates, the Daily Caller's Adesola Fasoro and Matt Miller asked Washingtonians how they felt about the debates and who the winner of the debate was. Trump or Biden? Let's find out.", "201", ["109", "Comments"]], ["This could be a potential disaster.", "736", ["211", "Comments"]], ["Not everything needs to be political.", "1.7K", ["717", "Comments"]], ["Ted Cruz goes toe to toe with Senator Hirono on Black Lives Matter", "3.1K", ["384", "Comments"]], ["A solid response from the Democratic ticket in response to the news.", "368", ["412", "Comments"]], ["There's a long list of people that they've interacted with.", "268", ["446", "Comments"]], ["Will he be able to give Trump a fair shake at the debate?", "4.5K", ["2.6K", "Comments"]], ["It was quite the scene.", "482", ["199", "Comments"]], ["Daily Caller Co-Founder Neil Patel: \"Founding Fathers were wise enough to enshrine protections for the press in the very first amendment to our Constitution. The inept Louisville Police Department and Louisville prosecutors apparently didn’t get the memo on this. We are going to teach them all about it.\"", "425", ["118", "Comments"]], ["The FBI cited “pending or prospective law enforcement proceedings\" in their explanation for why they couldn't release the records.", "917", ["306", "Comments"]], ["Did they forget they were on camera?", "2.3K", ["323", "Comments"]], ["Melania ripped the media in a secretly recorded audio tape over their alleged refusal to cover a story.", "13K", ["5.1K", "Comments"]], ["These attacks are inexcusable.", "1.7K", ["516", "Comments"]], ["Did you think it was a sh*tshow?", "458", ["363", "Comments"]], ["Prayers up for POTUS and FLOTUS.", "35K", ["7.7K", "Comments"]], ["“They don’t have an answer for what Donald Trump is saying, about trying to empower African-Americans by putting jobs in those areas.\"", "2.7K", ["260", "Comments"]], ["The president's former national security advisor had some strong words for Trump.", "677", ["478", "Comments"]], ["A furloughed photographer who documented protests starting on May 31 apparently expected to find white supremacists behind widespread looting but instead found anarchists.", "6.5K", ["573", "Comments"]], ["\"The Washington Post is an appendage of the Democratic Party and it will dutifully get behind the nominee.\"", "476", ["60", "Comments"]], ["The left has been escalating their tactics.", "1.7K", ["611", "Comments"]], ["So much for tolerance!", "1.2K", ["245", "Comments"]], ["Lockdowns have serious consequences.", "2.2K", ["409", "Comments"]], ["Wallace defended his performance during the first debate.", "29K", ["20K", "Comments"]], ["China supplies a large amount of the earth minerals used in commercial and defense technologies. We got an inside look at what the Trump administration is doing to change that.", "416", ["25", "Comments"]], ["Credit where credit is due. We need more NBA players to speak out against China.", "4K", ["235", "Comments"]], ["He wants a big chunk of change for another fight.", "3.1K", ["947", "Comments"]], ["AMERICAN RENEWAL: \"Once court-packing destroys judicial independence, it cannot be restored.\"", "475", ["64", "Comments"]], ["She praised Trump for low black unemployment rates and for his support of historically black colleges.", "50K", ["1.3K", "Comments"]], ["Another uneventful day for Biden...", "1.1K", ["453", "Comments"]], ["A classy move from Cuban.", "15K", ["768", "Comments"]], ["Buckle up....", "7.8K", ["749", "Comments"]], ["The prankster at CPAC turned out to be a famous actor filming for his new movie.", "423", ["124", "Comments"]], ["The first time Chris Wallace interviewed Trump at the RNC in 1988, Trump predicted he would win!", "15K", ["2.5K", "Comments"]], ["Philadelphia election officials scrambled after a computer and two flash drives used to program electronic voting machines were reportedly stolen.", "595", ["212", "Comments"]], ["Good luck with that.", "4.1K", ["1.9K", "Comments"]], ["Who do YOU think won the debate? Let us know in the comments below!", "1.3K", ["350", "Comments"]], ["Should he have been there to begin with?", "329", ["97", "Comments"]], ["Tough talk from POTUS.", "3.1K", ["1.2K", "Comments"]], ["He was fed up.", "8.4K", ["9.2K", "Comments"]], ["Following President Trump’s nomination of Amy Coney Barret for Supreme Court, Democratic politicians had this to say about ACB.", "710", ["246", "Comments"]], ["Not a good look for Pelosi.", "2.2K", ["777", "Comments"]], ["It didn't end well for a big pharma exec after Katie Porter pulled out her whiteboard.", "355", ["36", "Comments"]], ["Remember when NYT had a meltdown over a Tom Cotton Op-Ed?", "630", ["88", "Comments"]], ["Tucker wants to get his words tattoed!  In Louisville, Fadi Faouri defended his business and refused to say 'black lives matter' to a group of protesters standing outside. Fadi later went on Tucker Carlson Tonight and explained his position to America.", "4.8K", ["481", "Comments"]], ["McEnany used the media outrage against them.", "7.1K", ["508", "Comments"]], ["Whoopi broke her tradition of not saying President Trump's name.", "430", ["419", "Comments"]], ["BET founder Robert Johnson appeared to suggest that he will be supporting President Trump in the 2020 election.", "31K", ["2.1K", "Comments"]], ["Ilya Shapiro, director of the Robert A. Levy Center for Constitutional Studies at the Cato Institute, spoke with the Daily Caller's Samantha Renck about President Donald Trump's Supreme Court nomination, the future of the court and more.", "139", ["3", "Comments"]], ["It would be the lowest refugee cap ever put on record.", "4.6K", ["330", "Comments"]], ["\"So why — other than politics — is there now a concerted media attack on Dr. Scott Atlas?\"", "658", ["125", "Comments"]], ["Press Secretary Kayleigh McEnany Holds a Press Briefing at The White House", "5.8K", ["2.8K", "Comments"]], ["\"No, he's not that kind of guy.\"", "3.4K", ["359", "Comments"]], ["Things got heated on CNN after Ted Cruz brought up Governor Cuomo's nursing home scandal.", "1.9K", ["391", "Comments"]], ["U.S. Secretary of Agriculture Sonny Perdue writes: \"Expanding access to broadband infrastructure puts America first and gives Americans more choices in how they receive the healthcare they need.\"", "1.4K", ["216", "Comments"]], ["An Ohio professor apologized, saying he would devote himself to “anti racist learning” after receiving criticism for an article he co-authored about college football.", "211", ["142", "Comments"]], ["He believes criticisms of the agency are unwarranted.", "266", ["13", "Comments"]], ["Trump brought up Biden's past record in public office.", "942", ["248", "Comments"]], ["Every day Congress stalls on negotiations, more Americans suffer.", "999", ["919", "Comments"]], ["What happened to our reporters in Louisville was outrageous.", "324", ["85", "Comments"]], ["“What people tune in for is actually what happened last night. The two guys going at it directly.”", "638", ["457", "Comments"]], ["A truly horrible comment.", "3.2K", ["280", "Comments"]], ["People wanted to know how much Trump played a role in bringing back football.", "327", ["301", "Comments"]], ["There are far-reaching effects to anarchy and lawlessness.", "514", ["64", "Comments"]], ["They argue that Barrett is a role model for young women.", "3.9K", ["213", "Comments"]], ["There's a solid chance the election won't be called on November 3rd.", "551", ["386", "Comments"]], ["Google searches spiked for the Libertarian candidate.", "732", ["816", "Comments"]], ["St. Louis officials announced that the nine people who were cited for allegedly trespassing on the McCloskey’s property will not be prosecuted.", "2.2K", ["833", "Comments"]], ["The UFC star will reportedly join the president's son to warn about the dangers of socialism.", "13K", ["690", "Comments"]], ["Hawley ripped into the proposals.", "1.4K", ["106", "Comments"]], ["Rogan saw the first debate a didn't seem too interested in the idea of moderating.", "289", ["49", "Comments"]], ["Shep explained his experience leaving Fox.", "624", ["302", "Comments"]], ["Fleischer had some suggestions for POTUS.", "952", ["191", "Comments"]], ["House Minority Leader Kevin McCarthy (R-CA) joined Daily Caller’s Senior White House Correspondent Christian Datoc to discuss his reaction to the first Presidential debate, China, stimulus bill proceedings, and more.", "503", ["49", "Comments"]], ["Will Biden lose the progressive wing of his party for this?", "3.2K", ["996", "Comments"]], ["Wallace seems disappointed after debate night.", "1.8K", ["1.7K", "Comments"]], ["Would they really try it?", "653", ["230", "Comments"]], ["Mika wasn't impressed.", "1.4K", ["523", "Comments"]], ["A few parrots were removed from public view for cursing at customers.", "1.4K", ["204", "Comments"]], ["A number of Republican senators thought it was a disaster.", "220", ["241", "Comments"]], ["Of course.", "2.9K", ["1.5K", "Comments"]], ["Daily Caller White House correspondent Christian Datoc sits down with Wall Street guru and CEO of Farvahar Partners Omeed Malik for a new episode of \"WALL STREET MEETS WASHINGTON.\" It's the only show that breaks down the Beltway's economic updates for both financial VIPs and everyday Americans looking for market tips. Part 2 of Datoc and Malik's interview with SkyBridge Capital founder and former White House communications director Anthony Scaramucci was significantly more co...ntentious that the first half.  Malik and Scaramucci, who have known each other for years, butted heads over what specific policies put forth by the Trump administration should actually be considered successful. Scaramucci argued that like past presidents, Trump has offered the right rhetoric without actually following through on his campaign promises. Malik in turn cited the tougher stance Trump has taken with China, his attempts to end America's wars, and the administration's brokering of historic  Finally, Datoc returned the conversation back to civil grounds. Specifically, he pressed Scaramucci on what the future of the Republican party will look like. Earlier in the interview, Scaramucci had argued that the Republican party had abandoned fiscal conservatism, so Datoc wanted to know on what policies the new platform will instead focus. See More", "248", ["343", "Comments"]], ["Yikes....", "4.1K", ["3.7K", "Comments"]], ["A man has been arrested and charged for allegedly ambushing and shooting two Los Angeles County sheriff’s deputies as they sat in their car.", "5K", ["676", "Comments"]], ["There may be some new rules in future debates.", "4.1K", ["3.9K", "Comments"]], ["A Trump Bentley?!", "19K", ["1K", "Comments"]], ["Senator Scott thinks Trump should clarify the comments.", "658", ["841", "Comments"]], ["Some honesty from CNN.", "8.2K", ["693", "Comments"]], ["The attorney for Kyle Rittenhouse threatened to sue Biden after Biden released a video suggesting Rittenhouse is a white supremacist.", "20K", ["2.2K", "Comments"]], ["WATCH LIVE: The Senate Judiciary Committee holds a hearing on the oversight of the Crossfire Hurricane investigation into Trump/Russia collusion", "2.1K", ["1.6K", "Comments"]], ["Republican Senators are trying to pry answers out of Comey.", "1K", ["304", "Comments"]], ["There could be a deal on the horizon.", "669", ["102", "Comments"]], ["Even some of Fox's own personalities weren't pleased with Wallace's performance as a moderator.", "37K", ["6.5K", "Comments"]], ["Biden blamed Trump for ongoing rioting in Portland while admitting that he has not called on leadership in the area to help the situation.", "2.7K", ["1K", "Comments"]], ["Why don't they want to answer this?", "1.3K", ["319", "Comments"]], ["Athletic apparel giant Adidas is still touting its donations to the Minnesota Freedom Fund, which bailed out a lengthy list of alleged violent criminals.", "1.8K", ["265", "Comments"]], ["WATCH LIVE: The Senate Judiciary Committee holds a hearing on the oversight of the Crossfire Hurricane investigation into Trump/Russia collusion", "1.5K", ["2.7K", "Comments"]], ["“He wants to shut down this country and I want to keep it open,” Trump said.", "3.6K", ["976", "Comments"]], ["Biden VS Trump: Round 1", "1K", ["473", "Comments"]], ["University of Notre Dame president Rev. John I. Jenkins apologized to students after being seen maskless with other guests at the Supreme Court nomination ceremony of Amy Coney Barrett.", "405", ["163", "Comments"]], ["Tough scene.", "18K", ["4.2K", "Comments"]], ["The entire night was a showdown.", "523", ["348", "Comments"]], ["Infighting on the Mueller team.", "547", ["61", "Comments"]], ["Are Democrats not even giving her a chance?", "3.1K", ["1.9K", "Comments"]], ["Trump took a shot at Hunter's business dealings.", "1.8K", ["313", "Comments"]], ["Brutal.", "26K", ["5.2K", "Comments"]], ["A Christian wedding photographer in Virginia is challenging a recent state law that would force him to defy his religious beliefs about marriage or face hefty penalties.", "521", ["240", "Comments"]], ["Wallace had to break it up.", "2.1K", ["1.7K", "Comments"]], ["A Texas sheriff was reportedly arrested for allegedly tampering with evidence in a 2019 case surrounding the death of a black motorist.", "143", ["36", "Comments"]], ["The media needs to do better.", "335", ["80", "Comments"]], ["Biden VS Trump: Round 1", "13K", ["4.5K", "Comments"]], ["Donors have raised a large sum of money on a Christian fundraising website for Kyle Rittenhouse, who was arrested and charged with killing two rioters and injuring one during unrest in Kenosha, Wisconsin in August.", "5.7K", ["2.1K", "Comments"]], ["The president argued that he deserves some credit for bringing back football.", "1.9K", ["452", "Comments"]], ["Classy.", "4.5K", ["3.4K", "Comments"]], ["Wallace got a kick out of that one.", "6.4K", ["583", "Comments"]], ["Not a good look for Biden.", "12K", ["3K", "Comments"]], ["Trump isn't pleased with how Chirs Wallace is moderating the debate.", "24K", ["7.1K", "Comments"]], ["WATCH LIVE", "2.9K", ["9.1K", "Comments"]], ["Chris Wallace moderates. Who do you think is winning?", "464", ["1.5K", "Comments"]], ["Militarized trash collection?", "4.3K", ["2.7K", "Comments"]], ["Gorgeous!", "9.9K", ["549", "Comments"]], ["The Trump camp fired back on the claim, saying “This is a lie and it never happened.\"", "1.8K", ["910", "Comments"]], ["Several sports betting companies offer chances to win cash for making predictions about tonight's presidential debate.", "114", ["80", "Comments"]], ["Corey Lewandowski, Trump's Former Campaign Adviser, talked with the Daily Caller's Caitlyn McDuffee about tonight's debate.", "828", ["393", "Comments"]], ["Mrinalini Kumari, co-chair of Indian Voices for Trump, spoke with the Daily Caller's Samantha Renck about Indian American support for President Trump, tonight's debate and more.", "193", ["47", "Comments"]], ["The American people deserve answers.", "770", ["184", "Comments"]], ["The Hennepin County Attorney’s Office announced they have no information or evidence supporting Project Veritas’ recent claims that Minneapolis’ Ward 6 was the victim of mass voter fraud.", "851", ["384", "Comments"]], ["This is a much bigger story than anything related to tax returns.", "16K", ["1.9K", "Comments"]], ["Musk expressed skepticism of a potential vaccine and took a shot at Bill Gates.", "3.8K", ["333", "Comments"]], ["When will we have a COVID Vaccine?  Watch the FULL interview to find out! Centers for Medicare and Medicaid Services administrator Seema Verma joined Daily Caller's senior White House correspondent for an exclusive interview on President Donald Trump's new health care plan.", "131", ["73", "Comments"]], ["Behar thinks Biden should go scorched earth on Trump.", "7.5K", ["4.7K", "Comments"]], ["Do Democrats have their priorities straight?", "3.4K", ["877", "Comments"]], ["Yikes...", "2.6K", ["820", "Comments"]]]