[["After President Donald J. Trump's coronavirus diagnosis last week, the Commission on Presidential Debates said it will separate the vice presidential candidates with plexiglass, in addition to other precautions, during Wednesday night's encounter.", "2K", ["1.6K", "Comments"]], ["A rapidly strengthening Hurricane Delta is taking aim at the resort hotspot of Mexico's northeastern Yucatan Peninsula before targeting the U.S. Gulf Coast later this week.", "583", ["360", "Comments"]], ["A little girl who was told she may never walk due to a rare condition proudly escorted her younger sister into school for her first day.", "6K", ["474", "Comments"]], ["Senate Majority Leader Mitch McConnell offered a unanimous consent request to retool the upper chamber's schedule on Monday, blocking floor action through Oct. 19 due to health concerns and senators quarantining after being exposed to COVID-19.", "1.4K", ["1.4K", "Comments"]], ["A band of Florida deputies and firefighters joined forces to rescue a steer that was submerged in neck-deep mud.", "1.6K", ["370", "Comments"]], ["Shelley Luther, the Dallas salon owner who made waves earlier this year after reopening her hair salon during the early stages of the coronavirus crisis, will be in a Republican runoff election for a state Senate seat.", "17K", ["1.6K", "Comments"]], ["President Donald J. Trump was discharged from Walter Reed National Military Medical Center Monday, walking out of the hospital and returning to the White House. Catch up on this story and other developments in today's Fox News First newsletter.", "31K", ["5.3K", "Comments"]], ["An Army identification tag lost by an American soldier when he was wounded by a grenade blast in Vietnam was returned Wednesday to his widow after it was found by an American traveling in Russia.", "2.9K", ["220", "Comments"]], ["ICYMI: President Donald J. Trump arrived at the White House Monday evening after being treated for the coronavirus at Walter Reed National Military Medical Center.  Despite being back home for treatment, the president's medical team warned that he \"may not entirely be out of the woods yet.\"  https://fxn.ws/3npnE9g", "23K", ["3.3K", "Comments"]], ["An Arkansas police officer was fatally shot and another was wounded Monday during a shooting at a motel.", "4.9K", ["1.1K", "Comments"]], ["Members of the New York Police Department leave a service at St. Patrick's Cathedral on Monday where 46 members of the NYPD who have died due to COVID-19 related illness were honored.", "5.5K", ["1.5K", "Comments"]], ["Suspicious devices attached to five political yard signs in Maryland — including at least one Trump-Pence sign — led to multiple calls to the bomb squad, according to reports.", "1.6K", ["1.5K", "Comments"]], ["A Georgia pastor recently gave a Waffle House waitress the surprise of a lifetime after raising a $12,000 tip for the pregnant server, after learning that the woman’s unborn child will have the same name as his late son.", "4.3K", ["270", "Comments"]], ["The White House is looking to potentially block guidelines proposed by the Food and Drug Administration regarding the approval of a coronavirus vaccine for emergency use.", "1.6K", ["1.8K", "Comments"]], ["Joe Biden's wife Jill Biden, had to literally pull  the 2020 Democratic presidential nominee away from a group of reporters on Monday, in an effort to maintain social distancing in the lead up to November's election.", "8.5K", ["4.4K", "Comments"]], ["\"We’re going about our jobs as best we can, instilling calm and confidence for the American people that their government is working” — White House deputy press secretary Brian Morgenstern", "3.7K", ["1.5K", "Comments"]], ["Ivanka Trump thanked the frontline workers who took care of her father while he was hospitalized at Walter Reed Medical Center.  President Donald J. Trump's daughter also thanked all health care workers who have been caring for COVID-19 patients since the beginning of the pandemic.", "61K", ["7.5K", "Comments"]], ["The Senate Judiciary Committee on Monday formally scheduled the confirmation hearings for President Trump’s Supreme Court nominee Judge Amy Coney Barrett, saying that the proceedings will begin on Monday, Oct. 12.", "20K", ["1.5K", "Comments"]], ["President Donald J. Trump stopped to pose for cameras after returning to the White House from Walter Reed Medical Center Monday evening.", "111K", ["12K", "Comments"]], ["Governor Andrew Cuomo said state officials will take over enforcement of mandates such as building capacity limits and social distancing.", "11K", ["4.9K", "Comments"]], ["A Maryland educator is set to resign Tuesday from the Washington County Board of Education after she wrote on her on her personal Facebook page that she wished President Trump dies from coronavirus.", "45K", ["12K", "Comments"]], ["\"I want my kids to grow up safe. I want them to grow up in a community with a future, with more freedom and safety than I grew up with. California makes that impossible.\" — Ben Shapiro", "12K", ["2.6K", "Comments"]], ["Biden said that he “wasn’t surprised” to learn of Trump’s positive test result.", "12K", ["6.4K", "Comments"]], ["Police on Sunday were investigating a theft of a city of Long Beach flag that was reportedly stolen outside police headquarters and replaced with a banner supporting President Trump.", "38K", ["3.8K", "Comments"]], ["JUST IN: President Donald J. Trump plans to take part in next week's second presidential debate in Miami, Trump 2020 Communications Director Tim Murtaugh told Fox News. , The debate will take place less than two weeks after the president contracted the novel coronavirus.", "72K", ["12K", "Comments"]], ["A new report reveals that despite some states getting tougher on gun control, the number of Americans with permits to carry concealed firearms has spiked in recent years.", "15K", ["2.1K", "Comments"]], ["President Donald J. Trump arrives at the White House aboard Marine 1. (Credit: WTTG) https://fxn.ws/3nk2U2l", "73K", ["20K", "Comments"]], ["President Donald J. Trump departs from Walter Reed National Military Medical Center on Marine One en route to the White House.", "35K", ["7.1K", "Comments"]], ["President Donald J. Trump leaves Walter Reed Medical Center.", "36K", ["11K", "Comments"]], ["A professional golfer and his fiancée were surprised on the golf course by a curious deer in Oakland County, Michigan.", "9.4K", ["810", "Comments"]], ["Jerry Seinfeld isn't giving up on New York City and he believes you shouldn't either.", "5K", ["2.5K", "Comments"]], ["JUST IN: The Houston Texans fired coach Bill O'Brien, according to multiple reports.", "1.8K", ["1.3K", "Comments"]], ["Former Vice President Joe Biden and Dr. Jill Biden make remarks in Miami, Florida.", "26K", ["32K", "Comments"]], ["Vice President Mike Pence makes remarks before departing Joint Base Andrews for Utah.", "15K", ["2.2K", "Comments"]], ["President Donald J. Trump's medical team provides an update on his condition outside of Walter Reed National Military Medical Center after the president tweeted that he will be discharged Monday evening and will return to the White House. https://fxn.ws/2SuZCeE", "29K", ["14K", "Comments"]], ["BREAKING NEWS: President Donald J. Trump said he will be discharged from Walter Reed Military Medical Center Monday evening and will return to the White House.", "202K", ["23K", "Comments"]], ["Wednesday: Vice President Mike Pence and Sen. Kamala Harris face off in the vice presidential debate. Tune in to Fox News Channel at 9p ET for this must-see event! https://fxn.ws/3nlRfjO", "17K", ["7.3K", "Comments"]], ["Democratic presidential nominee Joe Biden says he’ll listen to what the experts say to determine whether it’s safe for him to face off next week against President Donald J. Trump – who’s battling COVID-19 -- at the second of three scheduled general election debates.", "10K", ["8K", "Comments"]], ["In the critical days since President Donald J. Trump announced that he and the first lady had been infected with the novel coronavirus, the eyes of the world have been fixed on one place: a sprawling parcel of manicured green lawns and matchbox-like ivory dwellings known as the Walter Reed National Military Medical Center (WRNMMC).", "7.5K", ["1.9K", "Comments"]], ["This is the moment a man proposed to his girlfriend - with a pizza. Walter Marano, 27, had planned to pop the question to his partner of five years, Sophia Florio, 24, in Italy. Unfortunately, their holiday was canceled due to the coronavirus pandemic so he decided to bring a taste of Italy to them instead. He arranged a romantic meal at a restaurant in Fitzrovia, London, where waiters brought out heart-shaped pizzas. They had the words 'will you marry me?' written across them in crust and were presented to Sophia. Shocked Sophia said 'yes' and diners burst into cheers for the couple - before they tucked into their meal.", "4.8K", ["882", "Comments"]], ["New York Governor Andrew Cuomo holds a press briefing.", "13K", ["20K", "Comments"]], ["Trump supporters gather outside of Walter Reed National Military Medical Center to show their support for President Donald J. Trump, who is being treated for COVID-19.", "41K", ["8K", "Comments"]], ["BREAKING: White House Press Secretary Kayleigh McEnany revealed she tested positive for the coronavirus on Monday morning and will start the \"quarantine process\" despite not showing symptoms, after multiple days of negative tests.", "82K", ["32K", "Comments"]], ["First Lady Melania Trump tweeted an update on her health Monday morning after testing positive for coronavirus early Friday with \"mild symptoms.\" https://fxn.ws/3d8f61K", "141K", ["9.2K", "Comments"]], ["Talk about a shark with huge pearly whites.", "24K", ["1.6K", "Comments"]], ["BREAKING NEWS: Sen. Pat Toomey, R-Pa., announced on Monday that he will not seek reelection to his Senate seat in 2022 and that he will not run for Pennsylvania governor that year either.", "3.3K", ["1.4K", "Comments"]], ["JUST IN: White House Chief of Staff Mark Meadows said the administration is “optimistic” President Donald J. Trump will be able to return to the White House on Monday after spending several days at Walter Reed National Military Medical Center being treated for coronavirus, saying Trump's health improved overnight and the president is ready to get back “to a normal working schedule.”", "11K", ["3.6K", "Comments"]], ["Americans Harvey J. Alter and Charles M. Rice, and British scientist Michael Houghton were awarded the Nobel Prize for Medicine or Physiology on Monday for the discovery of the Hepatitis C virus.", "2.8K", ["2.1K", "Comments"]], ["More than three in four Americans said they are more careful spenders and savers than they were one year ago, according to new research.", "3.4K", ["1K", "Comments"]], ["Attorney General William Barr will self-quarantine for several days out of an abundance of caution after President Trump and several other lawmakers tested positive for the coronavirus, according to a report.", "6.8K", ["2.3K", "Comments"]], ["President Trump Sunday tweeted out a video of himself at Walter Reed Medical Center, telling his followers he's learned a lot about the novel coronavirus and teased his supporters gathered outside the hospital about \"a little surprise.\" Catch up on this story and other developments in today's Fox News First newsletter.", "45K", ["9K", "Comments"]], ["“This is uncalled for, especially in this time and place,” Rep. Kevin McCarthy said. “Other nations are watching America. This is the one time we could unite together… [Trump] is sitting here trying to work with this speaker to get a COVID relief package together and these are the comments that she makes? It’s really unbecoming of that position.”", "17K", ["6.8K", "Comments"]], ["A new White House photo shows President Donald J. Trump listening to a phone call with Vice President Mike Pence, Secretary of State Mike Pompeo, and Chairman of the Joint Chiefs of Staff Gen. Mark Milley in his conference room at Walter Reed National Military Medical Center in Bethesda, Maryland, on Sunday.  https://fxn.ws/3iyP7Bz", "51K", ["4.3K", "Comments"]], ["In front of a crowd, Sen. Bernie Sanders, I-Vt.on Saturday wished President Donald J. Trump and First Lady Melania Trump a “full and speedy recovery’ from COVID-19, after they were diagnosed with the virus earlier this week, but immediately went on the attack.", "7K", ["2.9K", "Comments"]], ["Senate Democrats blamed the coronavirus outbreak at the White House and Senate in their latest effort to delay the confirmation hearing for Supreme Court nominee Amy Coney Barrett, saying \"health and safety\" must come first.", "8K", ["3.9K", "Comments"]], ["The move comes in an effort to minimize the spread of the coronavirus after cases in the areas topped a 3% positivity rate over the past seven days.", "2.4K", ["1.4K", "Comments"]], ["On Sunday, supporters of President Donald J. Trump brought their boats to Harvey's Lake in Luzerne County, Pennsylvania, for a parade supporting the president.", "175K", ["8K", "Comments"]], ["Democratic presidential nominee Joe Biden will travel to Florida to participate in the next debate and hopes that President Donald J. Trump will be able to join him despite the president testing positive for the novel coronavirus late last week.", "4K", ["3.5K", "Comments"]], ["Former Democratic presidential candidate Rep. Tulsi Gabbard sent her \"best wishes and aloha\" to the president and first lady after learning they tested positive for coronavirus.", "50K", ["5.3K", "Comments"]], ["President Donald J. Trump was told Sunday that no foreign adversaries were attempting to take advantage of his health situation during an \"around the world\" national security briefing that took place on a secure line after the president tested positive late last week for COVID-19.", "10K", ["2.3K", "Comments"]], ["Former Texas Rep. Beto O'Rourke believes that Democratic presidential nominee Joe Biden can win Texas’ 38 electoral votes this November – a move that would mark a drastic change for a state once considered firmly in the hands of the Republican Party.", "24K", ["7.9K", "Comments"]], ["A new poll shows Democratic nominee Joe Biden with a 14 point lead nationally over President Donald J. Trump, following the first presidential debate last week.", "120K", ["53K", "Comments"]], ["ICYMI: On Sunday, President Donald J. Trump surprised his supporters who had gathered outside Walter Reed Medical Center, where the president is being treated for coronavirus. Shortly after sending out a tweet announcing his last-minute decision, the president made his surprise appearance when he briefly left the hospital and drove by, the groups of supporters gathered outside in Maryland, waving and giving a thumbs-up, before returning to Walter Reed shortly after.", "225K", ["23K", "Comments"]], ["Jaime Harrison, the South Carolina Democratic candidate looking to replace Republican incumbent U.S. Sen. Lindsey Graham, took what appeared to be a unique approach to stressing the coronavirus issue during their debate Saturday: he wrapped himself in plexiglass. Harrison shielded himself on the debate stage by using a transparent partition as the two candidates met on stage at Allen University in Columbia -- before the state’s voters head to the polls in November. https://fxn.ws/2Gvyr0u", "14K", ["5.9K", "Comments"]], ["Hundreds of President Donald J. Trump supporters lined up outside Trump Tower in New York City early Sunday, briefly shutting down Manhattan’s Fifth Avenue, to show support after the president’s recent coronavirus diagnosis.", "72K", ["6.9K", "Comments"]], ["Rep. Ilhan Omar called out former Vice President Joe Biden for pulling negative campaign ads after President Donald J. Trump's coronavirus diagnosis, arguing that the president wouldn't have offered the same courtesy.", "14K", ["6.7K", "Comments"]], ["“We can’t just walk away and shut the doors and say that the problem will go away—no, we’ve got to get people working again.” Evan Hafer and Mat Best, CEO and co-founder of Black Rifle Coffee, appeared on \"Fox & Friends” Sunday morning to discuss the expansion of their veteran-owned coffee company after opening their first brick-and-mortar store in Texas.", "13K", ["1.1K", "Comments"]], ["New York City police officers will be required to wear face masks, with officers who fail to comply with the coronavirus safety rules to face disciplinary action, according to reports.", "7.3K", ["3.4K", "Comments"]], ["A South Carolina officer has been killed and another wounded after responding to a domestic call and exchanging gunfire with an individual, authorities said Sunday.", "34K", ["3.6K", "Comments"]], ["Former astronauts Tom Stafford, Charlie Duke and Jack Lousma have endorsed U.S. Senator Martha McSally in an op-ed published Thursday ahead of her special election against Democratic nominee and astronaut Mark Kelly on Nov. 3.", "48K", ["2.5K", "Comments"]], ["President Donald J. Trump took to Twitter Sunday afternoon to announce that he would be paying a surprise visit to supporters who have gathered outside Walter Reed National Military Medical Center, where he is being treated for coronavirus. https://fxn.ws/3lebwWx", "137K", ["19K", "Comments"]], ["People gather in Bethesda, Maryland, to show support for President Donald J. Trump and First Lady Melania Trump. (Credit: WTTG)", "179K", ["25K", "Comments"]], ["President Donald J. Trump tweeted out his thanks on Sunday to the supporters who have gathered outside Walter Reed Medical Center in Maryland over the weekend, where the president is battling a case of the novel coronavirus. https://fxn.ws/3ir1UWx", "107K", ["7.5K", "Comments"]], ["Be part of the vice presidential debate with our 'Democracy 2020 Live!' experience. Join the conversation, react in real time to debate answers and see what the Fox News experts are saying. To participate, scan the QR code in this video or sign up at foxnews.com/2020live now and tune in to Fox News Channel Wednesday at 9p ET as the debate kicks off!", "1.5K", ["1.1K", "Comments"]], ["The 43-year-old rapper took time on Saturday to send well wishes to President Donald J. Trump and his wife, First Lady Melania Trump, following their positive coronavirus diagnosis.", "56K", ["2.1K", "Comments"]], ["Vice President Mike Pence and his wife, Karen, have against tested negative again for COVID-19 just days after President Donald J. Trump and the first lady were diagnosed with the virus, White House officials confirmed to Fox News.", "52K", ["2.6K", "Comments"]], ["\"I think there is clear danger in having events where there are many people close together without wearing masks for a long period of time.\" Dr. Tom Inglesby, director of the Center for Health Security at Johns Hopkins University, said on 'Fox News Sunday' that \"large gatherings like rallies shouldn't be happening at this point for any purpose\" and that \"we are still in the middle of a dangerous pandemic in this country.\"", "6.3K", ["8.9K", "Comments"]], ["Senator Chuck Schumer said \"it's not safe\" for the Senate Judiciary Committee to move forward with hearings for President Donald J. Trump’s Supreme Court nominee amid a coronavirus outbreak that's infected three Republican senators.", "36K", ["19K", "Comments"]], ["Supporters of President Donald J. Trump left signs, flowers and balloons at the entrance to Walter Reed National Military Medical Center on Sunday. Trump was flown to Walter Reed National Military Medical Center in Bethesda, Md., on Friday after testing positive for the coronavirus overnight Thursday into Friday.", "162K", ["8.5K", "Comments"]], ["Sen. Amy Klobuchar, in an interview on \"Fox News Sunday,\" said the Senate should wait until after the presidential election to move on the nomination of Judge Amy Coney Barrett to the Supreme Court -- not just because of how close the nomination is to the election, as Democrats have said in recent weeks, but also for \"safety\" reasons after multiple Republican senators tested positive for the coronavirus. https://fxn.ws/3ldBjy5", "11K", ["10K", "Comments"]], ["BREAKING NEWS: President Donald J. Trump could be released from the Walter Reed Medical Center as soon as Monday, his medical team said in an update Sunday to members of the White House press pool, as the president continues his treatment on dexamethasone and Remdesivir to fight coronavirus.", "43K", ["6.2K", "Comments"]], ["As President Donald J. Trump battles COVID-19, there are questions about how his illness will impact his campaign and the country. Tune in to a special edition of \"Special Report with Bret Baier\" tonight at 6p ET on Fox News Channel.", "3.6K", ["1.7K", "Comments"]], ["President Donald J. Trump's medical team provides an update on his condition outside of Walter Reed National Military Medical Center.", "55K", ["23K", "Comments"]], ["Senate Minority Leader Chuck Schumer holds a press conference.  Courtesy: WNYW", "11K", ["12K", "Comments"]], ["Joe Biden's campaign pledged to disclose the results of every coronavirus test the Democratic presidential nominee takes in the wake of President Donald J. Trump's positive COVID-19 diagnosis last week.", "11K", ["7.7K", "Comments"]], ["JUST IN: Trump campaign senior adviser Steve Cortes said on \"Fox News Sunday\" that the president is \"upbeat and assertive as ever\" while he fights the coronavirus after reports and comments that the president as recently as Friday was showing concerning signs after his diagnosis.", "48K", ["7.2K", "Comments"]], ["While Democratic presidential nominee Joe Biden heads to the crucial battleground state of Florida on Monday, President Donald J. Trump is hospitalized at Walter Reed National Military Medical Center after being diagnosed with COVID-19.", "2.5K", ["6K", "Comments"]], ["Hundreds of Honduran migrants bound for the U.S. were bused back to their homeland by Saturday morning after illegally entering Guatemala.", "26K", ["3K", "Comments"]], ["Estella Cobert was overcome with emotion when her granddaughter surprised her with a memory pillow of her late husband.", "7.8K", ["569", "Comments"]], ["Former FBI Deputy Director Andrew McCabe reportedly will not testify before the Senate Judiciary Committee on Tuesday as planned because it would “put his family’s health at risk\" for the coronavirus, a letter from his lawyer said Saturday.", "18K", ["8.1K", "Comments"]], ["President Trump supporters lined up in front of Walter Reed Hospital Saturday evening, to show support for Donald J. Trump who was recently diagnosed with coronavirus.", "99K", ["7.8K", "Comments"]], ["The full Senate won't return to the Capitol until Oct. 19 -- two weeks later than planned -- after at least three Republicans tested positive for the coronavirus in recent days, Majority Leader Mitch McConnell said Saturday.", "18K", ["4K", "Comments"]], ["White House doctors release Saturday evening update on President Donald J. Trump's fight against COVID-19 saying the commander-in-chief has completed his second dose of the Remdesivir drug without complication.", "30K", ["4.6K", "Comments"]], ["In two photos released by the White House late Saturday, President Donald J. Trump works from Walter Reed Medical Center as he continues undergoing treatment for COVID-19.", "414K", ["42K", "Comments"]], ["President Donald J. Trump, several top White House aides and Republican lawmakers have tested positive for the coronavirus, -- likely restructuring the final weeks of the presidential campaign, the race to confirm Trump's Supreme Court pick and even the day-to-day workings of the federal government.", "4.3K", ["6K", "Comments"]], ["Reps. Rashida Tlaib and Alexandria Ocasio-Cortez are complaining that Twitter has gone the extra mile to shield President Trump from tweets wishing him ill as he battles COVID-19 after failing to block death threats against them.", "23K", ["14K", "Comments"]], ["Texas Attorney General Ken Paxton defended himself Saturday evening after a group of high-level aides reported alleged criminal misconduct to federal law enforcement, according to local reports.", "1.6K", ["662", "Comments"]], ["A driver of a pick-up truck surrendered to authorities in Ohio on Saturday after allegedly opening fire during a pro-Trump car parade near Columbus, according to reports.", "6.2K", ["2.3K", "Comments"]], ["A billboard supporting President Donald J. Trump and first lady Melania Trump is seen over a highway Saturday in Tel Aviv, Israel. The Trumps both tested positive for coronavirus overnight Friday, and currently, the president is undergoing treatment at Walter Reed Medical Center in Bethesda, MD.", "316K", ["8.8K", "Comments"]], ["President Trump’s former attorney Michael Cohen blasted the chief executive’s COVID-19 diagnosis Friday, claiming that the White House is to blame.", "4.7K", ["3.8K", "Comments"]], ["Senate Judiciary Committee Chairman Lindsey Graham, R-S.C., said Saturday the confirmation hearing for Supreme Court nominee Judge Amy Coney Barrett will go forward as planned despite the president, first lady, numerous senators and White House staffers testing positive for coronavirus in the past 24 hours.", "34K", ["2.7K", "Comments"]], ["Supporters of President Donald Trump hold flags in front of Walter Reed Medical Center in Bethesda, Md., where the president is receiving treatment for the coronavirus. https://fxn.ws/30slvzy", "199K", ["12K", "Comments"]], ["\"We wish the President and First Lady a speedy recovery, and hope for the safety of the White House staff, the Secret Service, and others putting their lives on the line.\"", "10K", ["3.2K", "Comments"]], ["President Donald J. Trump said in a video taken from inside Walter Reed Medical Center on Saturday that he is incredibly thankful for the support of the American people and looking forward to finishing up his campaign.", "227K", ["13K", "Comments"]], ["Michigan's Supreme Court on Friday struck down Gov. Gretchen Whitmer's orders to extend a coronavirus-related state of emergency past April 30 without legislative approval.", "31K", ["3.3K", "Comments"]], ["\"He is an absolute warrior.\"  On \"Justice with Judge Jeanine\" Saturday, Eric Trump discussed his father's condition after the president tested positive for COVID-19. https://fxn.ws/3iuJgxd", "22K", ["4.4K", "Comments"]], ["At least 11 positive COVID-19 cases have been linked to planning and set up prior to Tuesday's presidential debate, Cleveland officials said on Friday.", "9.9K", ["11K", "Comments"]], ["\"The president is determined to move forward and, like the president, we cannot, must not and will not surrender and hide, as if that will make the coronavirus, and our problems, go away. It is why the president reopened the country while others were wed to the gloom-and-doom scenario of hiding in the basement. It is why the economy is coming back and why America continues to be a land of hope and opportunity.\" — Judge Jeanine Pirro", "27K", ["4.4K", "Comments"]], ["Senate Majority Leader Mitch McConnell tweeted Saturday afternoon that he had a “great” phone call with President Donald J. Trump, who remains at Walter Reed Medical Center following his positive COVID-19 test but told McConnell that “he’s feeling good.” https://fxn.ws/33wZaD7", "58K", ["8.5K", "Comments"]], ["EXCLUSIVE: The Trump campaign is taking over the YouTube masthead for 24 hours beginning at midnight, Fox News has learned, featuring the video of President Trump as he was departing the White House for Walter Reed Military Medical Center to be treated for COVID-19.", "33K", ["6.7K", "Comments"]], ["President Trump released a video from Walter Reed Medical Center Saturday evening, informing Americans that he felt \"much better\" after entering the facility and was committed to defeating the virus. https://fxn.ws/3insLms", "225K", ["33K", "Comments"]], ["TUNE IN: Sen. Ted Cruz discusses the importance of our next Supreme Court justice in a must-see interview on “Life, Liberty & Levin,” Sunday at 8p ET on Fox News Channel.", "2.4K", ["637", "Comments"]], ["BREAKING: Former New Jersey Gov. Chris Christie said on Saturday that he checked into Morristown Medical Center after testing positive for COVID-19.", "14K", ["7.8K", "Comments"]], ["BREAKING: Vice President Mike Pence will step up on the campaign trail as President Trump deals with a case of the coronavirus.", "91K", ["5.3K", "Comments"]], ["\"The president's illness does not disrupt the command and control nor the national security apparatus that we have in place.\"  On \"America's News HQ\" Saturday, Gen. Jack Keane discussed national security issues as President Trump battles COVID-19 at Walter Reed Medical Center. https://fxn.ws/36pKfwe", "7.9K", ["3.1K", "Comments"]], ["Rep. Ilhan Omar called out former Vice President Joe Biden for pulling negative campaign ads after President Donald J. Trump's coronavirus diagnosis, arguing that the president wouldn't have offered the same courtesy.", "34K", ["19K", "Comments"]], ["Democratic presidential nominee Joe Biden joins a virtual town hall with the Amalgamated Transit Union. (Courtesy: ATU International YouTube)", "15K", ["31K", "Comments"]], ["Trump supporters gather outside of Walter Reed National Military Medical Center to show their support for President Donald Trump, who is being treated for COVID-19.", "183K", ["30K", "Comments"]], ["EXCLUSIVE: The Trump campaign is keeping at “full speed” as President Trump fights the novel coronavirus, with a new “Operation MAGA” that includes events featuring Vice President Pence and members of the Trump family in key battleground states across the country, Fox News has learned.", "43K", ["5K", "Comments"]], ["Senator Bernie Sanders holds a socially distanced rally in Lebanon, NH.", "21K", ["23K", "Comments"]], ["Months after the cancellation of \"Cops\" at the Paramount Network, the show has reportedly resumed production.", "26K", ["2.9K", "Comments"]], ["\"It's all about beating the virus and so we're just helping the natural immune system beat it, by supplementing it with this antibody cocktail.\" On 'Cavuto Live\" Saturday, Regeneron co-founder Dr. George Yancopoulos discussed the antibody cocktail President Trump is taking to fight coronavirus.", "5.6K", ["3.9K", "Comments"]], ["Chinese President Xi Jinping on Saturday wished President Donald J. Trump and Melania Trump a \"fast recovery\" after the pair contracted coronavirus.", "19K", ["5K", "Comments"]], ["JUST IN: President Donald J. Trump on Saturday praised the staff at Walter Reed National Military Medical Center, and said he is \"feeling well,\" a day after he was transferred to the center after testing positive for COVID-19.", "77K", ["7.5K", "Comments"]], ["Former New Jersey Gov. Chris Christie has tested positive for COVID-19 just days after he admitted he was in a room with a group of maskless White House advisers and staff members – at least four of whom later tested positive for the virus – to help prepare President Donald J. Trump for the first presidential debate.", "22K", ["11K", "Comments"]], ["BREAKING NEWS: President Trump is “doing very well” and has no difficulty breathing, his medical team said Saturday -- the morning after he was transferred to Walter Reed National Military Medical Center.", "376K", ["49K", "Comments"]], ["Dr. Sean Conley, physician to the president, provides an update on President Donald J. Trump's condition.", "119K", ["48K", "Comments"]], ["\"Let’s remember that we’re all Americans. We’re all human beings. And we want everyone to be healthy, no matter our party.\" — Former President Barack Obama", "23K", ["8.1K", "Comments"]], ["Wednesday, October 7th at 9p ET: Vice President Mike Pence and Sen. Kamala Harris face off in the vice presidential debate. Tune in to Fox News Channel for this must-see event!", "2.4K", ["1.3K", "Comments"]], ["President Donald J. Trump is taking experimental coronavirus drugs Remdesivir and Regeneron after being diagnosed with COVID-19 this week, his former White House physician told \"Fox & Friends\" on Saturday. https://fxn.ws/2GsnhJT", "10K", ["3.7K", "Comments"]], ["JUST IN: Sen. Ron Johnson has tested positive for COVID-19, his office announced Saturday -- making him the third senator to test positive in recent days.", "10K", ["8.6K", "Comments"]], ["EXCLUSIVE: Sen. Ted Cruz said Senate Democrats “will do everything they can” to turn the confirmation hearing of Supreme Court nominee Judge Amy Coney Barrett into a “political circus,” while saying he is “confident” the Senate will confirm her to the high court before Election Day.", "34K", ["3.8K", "Comments"]], ["An artist paints portraits of President Donald Trump and first lady Melania Trump with messages to get well soon in Mumbai, India. President Trump announced Friday morning that he and the first lady tested positive for the coronavirus.  https://fxn.ws/3naGmkF", "366K", ["12K", "Comments"]], ["Sen. Chris Murphy, D-Conn., claimed on Friday that Russian President Vladimir Putin will step up his efforts to meddle in the upcoming election in the coming days now that President Donald J. Trump has tested positive for coronavirus.", "20K", ["13K", "Comments"]], ["House Minority Leader Kevin McCarthy tweeted an optimistic message late Friday stating that he spoke with President Donald J. Trump on the phone, adding that the president was \"upbeat\" and he appreciates all the support from everyone after his positive coronavirus diagnosis.", "64K", ["5.5K", "Comments"]], ["Senator Chuck Schumer, D-N.Y., said Friday evening it would be “irresponsible and dangerous” to move forward with a Senate Judiciary Committee hearing for President Donald J. Trump’s Supreme Court nominee on Oct. 12 after two Republican senators on the panel confirmed they have tested positive for the coronavirus.", "18K", ["11K", "Comments"]], ["Twitter issued a statement amid President Donald J. Trump's positive coronavirus diagnosis, saying that it would remove content hoping for his or anyone else's death resulting from fatal diseases.", "15K", ["3.6K", "Comments"]], ["President Donald J. Trump's positive coronavirus test has reignited calls for a coronavirus testing regimen on Capitol Hill that would screen members of Congress, staff, reporters and others who work in the U.S. Capitol and its surrounding office buildings.", "2.6K", ["2.8K", "Comments"]], ["Former President Barack Obama tweeted Friday he and former first lady Michelle Obama are sending their \"best wishes\" to President Donald J. Trump as he undergoes treatment for coronavirus, adding that everyone should remember \"we're all Americans\" and \"we want everyone to be healthy\" regardless of their political affiliation. https://fxn.ws/3jtMemN", "42K", ["22K", "Comments"]], ["Vice President Mike Pence and Democratic vice presidential nominee Sen. Kamala Harris will be putting more distance between them at their one-and-only debate scheduled for Wednesday night, according to reports.", "4.6K", ["2.8K", "Comments"]], ["\"The greatest antidote to hate is prayer — you cannot hate somebody that you're praying for regularly and I think all Americans can join together to pray for our great president.\" Fox News contributor Pastor Robert Jeffress joined host Shannon Bream on \"Fox News at Night\" early Saturday morning to discuss how to find encouragement in times of trouble as President Donald J. Trump begins his coronavirus treatment at Walter Reed Military Medical Center and how the country can come together in today's polarized political climate.", "12K", ["3.7K", "Comments"]], ["The health adviser to the Commission on Presidential Debates said Friday that they believe there was “low risk of exposure” to COVID-19 for guests at Tuesday’s debate, after President Donald J. Trump and first lady Melania Trump tested positive for the novel coronavirus.", "1.2K", ["1.4K", "Comments"]], ["The coronavirus outbreak at the White House has spread to the ranks of the press.", "12K", ["13K", "Comments"]], ["California is poised to hit a fearsome milestone: 4 million acres burned this year by wildfires that have killed 30 people and incinerated hundreds of homes in what is already the worst fire season on record.", "3.5K", ["2.2K", "Comments"]], ["Israeli Prime Minister Benjamin Netanyahu wished President Donald J. Trump and Melania Trump a speedy recovery after they tested positive for the coronavirus.", "100K", ["2.8K", "Comments"]], ["Republican Ohio Senator Rob Portman and executives from Ohio-based Lordstown Motors underwent coronavirus testing on Friday after President Donald J. Trump revealed that he had tested positive just days after their visit to the White House.", "2.4K", ["3.3K", "Comments"]], ["“This cannot be a partisan moment. It must be an American moment. We have to come together as a nation.” Democratic nominee Joe Biden delivered a message of unity after it was reported that President Donald J. Trump was being taken to Walter Reed Medical Center following his COVID-19 diagnosis.", "7.2K", ["6.5K", "Comments"]], ["President Donald J. Trump’s campaign manager, Bill Stepien, tested positive for the coronavirus Friday evening, a campaign official told Fox News, hours after the president and first lady confirmed they too had contracted the virus.", "31K", ["23K", "Comments"]], ["The Lincoln Project, a group of current and former Republicans who oppose President Donald J. Trump, wished him and the first lady well Friday after both tested positive for COVID-19, while also saying that they hope the diagnosis \"sends a signal\" to his supporters to take the pandemic seriously.", "8.7K", ["9.1K", "Comments"]], ["President Donald J. Trump tweeted an optimistic message late Friday from Walter Reed National Military Medical Center, where he is being treated for COVID-19 after testing positive for coronavirus. https://fxn.ws/30pXol2", "261K", ["30K", "Comments"]], ["JUST IN: Bob Gibson, a Hall of Fame pitcher who played his entire career with the St. Louis Cardinals died Friday. He was 84.", "20K", ["2.2K", "Comments"]], ["BREAKING: Former counselor to the president Kellyanne Conway announced she has tested positive for COVID-19 and is experiencing \"mild\" symptoms, including a cough.", "99K", ["36K", "Comments"]], ["\"I think he will come out of this very, very well.\" Bill Bennett, former U.S. secretary of education under President Ronald Reagan, joined \"The Story with Martha MacCallum\" on Friday to share his thoughts on President Donald J. Trump’s strength following his positive COVID-19 test.", "8.2K", ["2K", "Comments"]], ["\"He’s a fighter.\" Donald Trump Jr. joined \"Tucker Carlson Tonight\" on Friday to provide an update on his father’s condition after the president tested positive for COVID-19.", "41K", ["10K", "Comments"]], ["JUST IN: North Carolina Republican Sen. Thom Tillis, who is running for reelection, has tested positive for COVID-19.", "10K", ["7.4K", "Comments"]], ["“America keep the Faith because God can come in this house!\"  Pro football great Herschel Walker expressed support for President Trump and first lady Melania Trump on Friday after they tested positive for coronavirus.", "68K", ["3.4K", "Comments"]], ["British Prime Minister Boris Johnson wished President Donald J. Trump and first lady Melania Trump a \"speedy recovery\" from the coronavirus after the news broke they both tested positive for COVID-19 early Friday morning. https://fxn.ws/3jnz2Qh", "57K", ["4.1K", "Comments"]], ["North Korean dictator Kim Jong Un offered his sympathy and support on Friday to the president and first lady after each tested positive for the coronavirus.", "94K", ["8.6K", "Comments"]], ["President Trump thanked Americans for their “tremendous support” and said he is “doing very well” in a pre-recorded video he tweeted out Friday as he was being flown by Marine One to Walter Reed Military Medical Center where he will be treated for mild symptoms after testing positive for the COVID-19. https://fxn.ws/3naGmkF", "110K", ["13K", "Comments"]], ["President Donald J. Trump left the White House and was transferred to Walter Reed Medical Center on Friday evening after testing positive for COVID-19. https://fxn.ws/2Gxze0K", "93K", ["21K", "Comments"]], ["President Donald Trump arrives at Walter Reed Medical Center after testing positive for COVID-19.", "67K", ["25K", "Comments"]], ["Moments ago, President Trump boarded Marine One to be taken to Walter Reed Medical Center after testing positive for COVID-19.", "71K", ["17K", "Comments"]], ["BREAKING: President Trump is being transferred to Walter Reed Military Medical Center \"out of an abundance of caution,\" the White House said Friday, after testing positive for COVID-19 and experiencing \"mild symptoms.\"", "27K", ["6.9K", "Comments"]], ["President Trump to be flown on Marine One to Walter Reed Military Medical Center for treatment after testing positive for COVID-19. (Courtesy: WTTG) Tune in to Fox News Channel for continuing coverage.", "57K", ["45K", "Comments"]], ["President Trump's physician released details about the commander-in-chief's medical condition and treatment Friday, following the bombshell announcement hours earlier that the first couple had been stricken with COVID-19.", "6.6K", ["4.1K", "Comments"]], ["Former Vice President Joe Biden delivers remarks at a campaign event in Grand Rapids, Mich.", "23K", ["33K", "Comments"]], ["Notre Dame President Fr. John Jenkins, who was at the White House Supreme Court announcement last Saturday, has tested positive for Covid-19.", "3.9K", ["2.3K", "Comments"]], ["\"In politics, when you get faced with adversity -- when you’re given lemons, make lemonade.\"  On \"Outnumbered Overtime\" Friday, Karl Rove said President Trump being forced to hold virtual campaign events after testing positive for coronavirus may cause him to be more \"focused and disciplined\" in his messaging.", "8.7K", ["3K", "Comments"]], ["Joe Biden on Friday morning tweeted he and his wife, Jill, sent their thoughts to President Donald J. Trump and first lady Melania Trump \"for a swift recovery,\" after the Trumps announced they'd tested positive for COVID-19. https://fxn.ws/34mWiHS", "15K", ["9.9K", "Comments"]], ["The Trump campaign announced that all previously announced events that were to feature the president will be postponed or become virtual events after he revealed he tested positive for the coronavirus.", "10K", ["4.2K", "Comments"]], ["Friday morning on “America's Newsroom,” Chris Wallace weighed in on President Trump’s COVID-19 diagnosis after moderating the first presidential debate on Tuesday. Former Vice President Joe Biden revealed Friday afternoon that he tested negative for COVID-19.", "37K", ["36K", "Comments"]], ["JUST IN: Joe Biden confirmed Friday that he and his wife, Jill, tested negative for the coronavirus, days after the former vice president appeared on the debate stage with President Trump, and hours after Trump revealed he and first lady Melania Trump tested positive. https://fxn.ws/30nSdCf", "18K", ["11K", "Comments"]], ["JUST IN: United States Senator Mike Lee revealed Friday he's tested positive for the coronavirus and \"will remain isolated for the next 10 days,\" days after visiting the White House, and hours after President Trump said he and first lady Melania Trump had tested positive.", "7.3K", ["3.9K", "Comments"]], ["JUST IN: Louisville Attorney General Daniel Cameron on Friday released the much-anticipated recordings of the grand jury proceedings in the deadly shooting of Breonna Taylor involving three Louisville police officers earlier this year.", "2.2K", ["2.6K", "Comments"]], ["The Supreme Court confirmation for Amy Coney Barrett is moving forward as planned despite revelations of the coronavirus at the White House with President Donald J. Trump testing positive.", "26K", ["2.8K", "Comments"]], ["President Trump’s eldest daughter and senior adviser Ivanka Trump and her husband, White House adviser Jared Kushner, tested negative for COVID-19 on Friday. The president’s youngest son, Barron Trump, tested negative, as well.", "27K", ["5.4K", "Comments"]], ["White House Chief of Staff Mark Meadows speaks to reporters after President Donald J. Trump's positive coronavirus test.", "22K", ["14K", "Comments"]], ["JUST IN: Republican National Committee Chairwoman Ronna McDaniel is recovering in her Michigan home after learning Wednesday she tested positive for the novel coronavirus, a spokesman told Fox News.", "12K", ["5.5K", "Comments"]], ["EXCLUSIVE: Dr. Scott Atlas, a special adviser on coronavirus to President Trump, said Friday he expects the president and first lady to make a “complete, full and rapid recovery” after the two tested positive for COVID-19, adding, “there is zero reason to panic.”", "40K", ["6.6K", "Comments"]], ["JUST IN: Joe Biden on Friday morning tweeted he and his wife, Jill, sent their thoughts to President Donald J. Trump and first lady Melania Trump \"for a swift recovery,\" after the Trumps announced they'd tested positive for COVID-19.", "28K", ["12K", "Comments"]], ["BREAKING: The U.S. economy added 661,000 jobs in September, suggesting the labor market's recovery from the coronavirus pandemic is beginning to plateau amid fading government relief money and a gradually growing virus caseload.", "12K", ["2K", "Comments"]], ["While many on social media sent well wishes to President Donald J. Trump and First Lady Melania Trump early Friday after the president confirmed they had both tested positive for the coronavirus, others took the time to criticize or make negative comments.", "53K", ["29K", "Comments"]], ["JUST IN: Vice President Mike Pence and second lady Karen Pence have tested negative for COVID-19, Press Secretary Devin O'Malley announced Friday morning, hours after President Donald J. Trump, first lady Melania Trump and White House adviser Hope Hicks confirmed they'd tested positive.", "32K", ["2K", "Comments"]], ["Shortly after President Donald J. Trump announced that he and First Lady Melania Trump had tested positive for COVID-19, a number of the president’s fiercest critics wished him well as he battles a disease that has already left more than 205,000 Americans dead.", "14K", ["5.4K", "Comments"]], ["President Donald J. Trump cleared his Friday schedule after he and First Lady Melania Trump confirmed they had tested positive for the coronavirus in the early morning hours -- except for a phone call on virus aid for vulnerable seniors, multiple reports said.", "21K", ["9.1K", "Comments"]], ["President Donald J. Trump and first lady Melania Trump were in quarantine at the White House early Friday after receiving word that they had tested positive for the coronavirus. Catch up on this story and other developments in today's Fox News First newsletter.", "9.2K", ["6K", "Comments"]], ["Vice President Mike Pence and second lady Karen Pence sent their prayers to President Donald J. Trump and First Lady Melania Trump after they tested positive for the coronavirus.  https://fxn.ws/3joV3OD", "60K", ["6.6K", "Comments"]], ["President Donald J. Trump has tested positive for the novel coronavirus, and in doing so, he joins a growing list of world leaders who have previously contracted the disease.  Since the start of the pandemic, at least seven major world leaders have tested positive for the virus.", "37K", ["14K", "Comments"]], ["On Oct. 1, 2017, a gunman opened fire on more than 22,000 music fans in attendance at the Route 91 Harvest Festival in Las Vegas.", "1.7K", ["918", "Comments"]], ["WATCH: Fox News’ Griff Jenkins provides the latest information on President Donald J. Trump and First Lady Melania Trump’s positive coronavirus test results.  According to President Trump’s doctor, “the president and first lady are both well at this time.\"  https://fxn.ws/34mfZQ2", "9.6K", ["6.7K", "Comments"]], ["First Lady Melania Trump tweeted she and President Donald J. Trump are \"feeling good\" after testing positive for coronavirus early Friday morning, and wished for everyone to stay safe as they begin the quarantine process.", "69K", ["17K", "Comments"]], ["Press Secretary Kayleigh McEnany reacted on Twitter to the news that  President Donald J. Trump and First Lady Melania Trump tested positive for the coronavirus.  The president and first lady’s positive coronavirus tests came just hours after news surfaced that senior White House adviser Hope Hicks tested positive for COVID-19.  https://fxn.ws/34mfZQ2", "52K", ["12K", "Comments"]], ["BREAKING NEWS: President Donald J. Trump announced on Twitter early Friday that he and the first lady tested positive for the coronavirus. He said, “We will get through this together.”", "108K", ["45K", "Comments"]], ["“Donald Trump has demonstrated repeatedly that his first allegiance is not to the United States of America.\" — Hillary Clinton", "31K", ["14K", "Comments"]], ["After learning that senior White House advisor Hope Hicks tested positive for coronavirus, President Donald J. Trump announced that he and First Lady Melania Trump will quarantine for two weeks.  The president told Sean Hannity that they are currently awaiting coronavirus test results. https://fxn.ws/3joV3OD", "52K", ["14K", "Comments"]], ["BREAKING: President Donald J. Trump announced that he and his wife, Melania Trump, will begin the “quarantine process” after top aide Hope Hicks tests positive for coronavirus.", "31K", ["12K", "Comments"]], ["\"I think what's happened here, as we've gotten closer to the election, the spirit of bipartisanship on coronavirus that we had in March and April has largely disappeared.\" Senate Majority Leader Mitch McConnell joined 'Special Report with Bret Baier' Thursday evening to discuss the negotiations in Congress for coronavirus relief, and the SCOTUS nominee Amy Coney Barrett, as the 2020 election approaches.", "4.3K", ["1.6K", "Comments"]], ["\"A lot of folks had already made up their mind and weren't interested in what the truth is -- and now [they] are still trying to cherry-pick so that they can fashion a narrative that meets their agenda and advances their own interests.\" Kentucky Attorney General Daniel Cameron joined 'Tucker Carlson Tonight' Thursday to discuss the backlash he's received after not recommending murder charges against the officers involved in the Breonna Taylor case. https://fxn.ws/3cQ4pAB", "6.2K", ["1.8K", "Comments"]], ["BREAKING: Amid news that White House adviser Hope Hicks tested positive for COVID-19, President Donald J. Trump told Sean Hannity on Thursday that he and the first lady had been recently tested.", "5.7K", ["3.8K", "Comments"]], ["JUST IN: White House advisor Hope Hicks has tested positive for COVID-19 after traveling with President Trump to a rally in Duluth, Minnesota.", "8.2K", ["8.1K", "Comments"]], ["Mississippi Gov. Tate Reeves said the declining number of confirmed COVID-19 cases and hospitalizations are positive developments that call for the lifting of some restrictions, including the mask mandate.", "52K", ["4.2K", "Comments"]], ["New York City police officers who don’t wear coronavirus masks should face “penalties,” according to Mayor Bill de Blasio.", "12K", ["5.6K", "Comments"]], ["The Archdiocese of NY holds its annual Al Smith dinner remotely, featuring remarks from President Trump and Democratic presidential nominee Joe Biden.", "6K", ["6.1K", "Comments"]], ["Former Democratic presidential nominee Hillary Clinton on Thursday reiterated allegations that called into question President Donald Trump’s loyalty to the United States. https://fxn.ws/3n3q5Ox", "123K", ["85K", "Comments"]], ["EXCLUSIVE: President Donald J. Trump joins ‘Hannity’ to discuss the first presidential debate, next steps in the Supreme Court confirmation process and more. Tune in tonight at 9p ET on Fox News Channel.", "14K", ["5.9K", "Comments"]], ["President Trump arrives at Joint Base Andrews aboard Air Force One.", "25K", ["8.7K", "Comments"]], ["\"I was really hoping for the debate that I think America wanted to see, which was a serious exchange of views… [The American people] didn’t get the debate they wanted and that they deserved, and I think that’s a loss for the country because they didn’t get to hear these two guys nearly as much as I think they should have.\" On \"Bill Hemmer Reports,\" \"Fox News Sunday\" anchor Chris Wallace discussed his experience moderating the first presidential debate and said that President Donald J. Trump \"bears the primary responsibility for what happened on Tuesday night.\" https://fxn.ws/3l4PWUf", "30K", ["31K", "Comments"]], ["Vice President Mike Pence participates in a Faith in Leadership event in Des Moines, Iowa.", "28K", ["9.1K", "Comments"]], ["\"Why would I allow the Debate Commission to change the rules for the second and third Debates when I easily won last time?\" President Donald J. Trump tweeted Thursday.", "18K", ["11K", "Comments"]], ["Dallas Mavericks owner Mark Cuban donated $50,000 to each of the families of the two Los Angeles County sheriff’s deputies who were wounded in an ambush attack last month.", "100K", ["6.6K", "Comments"]], ["President Donald J. Trump arrives via Air Force One at Morristown Municipal Airport in Morristown, NJ.", "19K", ["6.9K", "Comments"]], ["Senator Chuck Schumer holds a press conference.", "9.9K", ["11K", "Comments"]], ["Vice President Mike Pence participates in a Make America Great Again event in Carter Lake, Iowa.", "26K", ["7.7K", "Comments"]], ["House Minority Leader Kevin McCarthy holds his weekly press briefing.", "8.9K", ["4.7K", "Comments"]], ["President Donald J. Trump departs Joint Base Andrews aboard Air Force One en route to New Jersey.", "14K", ["5.1K", "Comments"]], ["Senator Dianne Feinstein, D-Calif., led a group of Democrats to formally call for a delay in the confirmation of Supreme Court nominee Amy Coney Barrett until after the presidential inauguration, saying the process is too rushed to properly vet President Donald J. Trump's pick.", "49K", ["21K", "Comments"]], ["First Lady Melania Trump tweeted a video about National Substance Abuse Prevention Month and highlighted how she will raise awareness and “encourage youth across America to lead healthy and drug-free lives.”", "30K", ["3.6K", "Comments"]], ["White House Press Secretary Kayleigh McEnany holds a press briefing.", "33K", ["27K", "Comments"]], ["TUNE IN: Chris Wallace joins Bill Hemmer to discuss moderating the historic presidential debate and his take on the state of the race. Don't miss \"Bill Hemmer Reports\" at 3p ET on Fox News Channel.", "12K", ["16K", "Comments"]], ["House Speaker Nancy Pelosi holds her weekly press conference.", "25K", ["35K", "Comments"]], ["A horse named Lola was airlifted to safety after falling sixty feet down a ravine in Orange County, California.", "4.9K", ["484", "Comments"]], ["Democratic presidential nominee Joe Biden once again avoided giving a straight answer on whether he would support packing the Supreme Court if elected, after making clear during Tuesday’s debate that he would not address the issue.", "13K", ["7.7K", "Comments"]], ["EXCLUSIVE: Republican attorneys general from across the U.S. sent a letter to the Senate Thursday morning urging them to confirm President Donald J. Trump's Supreme Court nominee Amy Coney Barrett.", "21K", ["2.4K", "Comments"]], ["Democratic presidential nominee Joe Biden on Wednesday called the first presidential debate \"embarrassing for the country\" and speculated that some parents took their children away from the television as President Donald J. Trump regularly interrupted the former vice president and moderator Chris Wallace and hammered Biden with personal attacks, including about his son Hunter's drug use.", "20K", ["22K", "Comments"]], ["Members of the U.S. House of Representatives will be able to continue voting by proxy – rather than inside the Capitol – at least until Nov. 16.", "8K", ["3.1K", "Comments"]], ["Senate Majority Leader Mitch McConnell discarded the likelihood of a coronavirus relief bill Wednesday, saying Democrats still want too much money as bipartisan talks at the Capitol failed to produce an agreement.", "6.3K", ["3.8K", "Comments"]], ["California Gov. Gavin Newsom signed into law Wednesday a bill that will establish a task force to study and develop proposals for paying reparations to the descendants of enslaved Black people.", "63K", ["34K", "Comments"]], ["Senior congressional leadership have urged Democratic presidential candidate Joe Biden to continue with the next two scheduled debates, despite calls from some urging him to pull out.", "4.9K", ["3.7K", "Comments"]], ["The Commission on Presidential Debates said Wednesday that “additional structure” should be added to the formats of the two remaining Trump-Biden debates in order to ensure a “more orderly discussion” of the issues by the two candidates. Catch up on this story and other developments in today's Fox News First newsletter.", "2.2K", ["3.4K", "Comments"]], ["Governor Tony Evers suggested President Donald J. Trump skip two campaign rallies in Wisconsin this weekend, as spiking coronavirus cases and record hospitalizations strain the state's resources.", "7.8K", ["4.2K", "Comments"]], ["The firefighters and paramedics union in Philadelphia broke with the International Association of Fire Fighters to endorse President Donald J. Trump in the upcoming election, according to a report.", "111K", ["3.9K", "Comments"]], ["The Navy recently changed the SEALs ethos and Special Warfare Combatant Crewmen creed to replace gendered language like \"man\" and \"brotherhood\" with gender-neutral terms like \"citizen,\" American Military News reported this week.", "8.7K", ["3K", "Comments"]], ["Five female Palm Beach Gardens Fire and Rescue firefighters made history becoming the first all-female crew to staff a shift for their department.", "23K", ["1.4K", "Comments"]], ["A woman in upstate New York was arrested Sunday for allegedly using six children to steal Trump campaign signs from people’s homes, according to the Montgomery County Sheriff’s Office.", "17K", ["7.1K", "Comments"]], ["Private firefighter Bradcus Schrandt gives an injured kitten water at the Zogg Fire near Ono, California on Sunday. Northern California's wine country was on fire again Monday as strong winds fanned flames in the already scorched region, destroying homes and prompting orders for nearly 70,000 people to evacuated.", "7.1K", ["898", "Comments"]], ["Chrissy Teigen announced Tuesday night that complications resulted in the loss of her pregnancy in a heartbreaking post on social media.", "7.3K", ["6.2K", "Comments"]], ["A stimulus package proposed by Democrats in the House of Representatives includes an expansion of stimulus checks and protections from deportations for illegal immigrants in certain \"essential\" jobs.", "32K", ["14K", "Comments"]], ["BET founder Robert Johnson suggested on Wednesday that his vote will go to President Donald J. Trump over Joe Biden, although he stopped short of offering an endorsement.", "97K", ["19K", "Comments"]], ["\"Folks, this is what a mom can do.\" Seven GOP female senators on Wednesday rallied behind Supreme Court nominee Amy Coney Barrett, touting her legal accomplishments while at the same time raising seven children.", "40K", ["1.8K", "Comments"]], ["President Donald J. Trump arrives at Joint Base Andrews following his trip to Minnesota.", "25K", ["7.2K", "Comments"]], ["President Donald J. Trump declared victory over former Vice President Joe Biden after their first presidential debate, telling a rally in Duluth, Minnesota Wednesday evening that they and other Americans won as well.", "38K", ["16K", "Comments"]], ["Alabama Governor Kay Ivey on Wednesday issued a supplemental state of emergency that authorizes the opening of absentee ballots, for tabulation, beginning at 7 a.m. on Election Day, according to reports.", "1.5K", ["1K", "Comments"]], ["\"I expected more from President Trump and I definitely expected more from Mr. Joe Biden.\" Ohio residents joined 'The Story with Martha MacCallum' Wednesday night to discuss what was missing from the first debate between President Donald J. Trump and Democratic presidential nominee Joe Biden.", "2.1K", ["2.4K", "Comments"]], ["After an unruly first presidential debate between President Donald J. Trump and former Vice President Joe Biden, Senator Chuck Schumer suggested a \"mute\" button would be necessary for another debate to take place.", "17K", ["15K", "Comments"]], ["“I am stepping away from my company and any role in the campaign for the immediate future to focus on my family and get help dealing with the overwhelming stress,\" Parscale said.", "9.6K", ["2.8K", "Comments"]], ["President Trump holds a campaign rally in Duluth, Minn.", "49K", ["26K", "Comments"]], ["Democratic presidential nominee Joe Biden holds a drive-in event in Johnstown, Pennsylvania.", "30K", ["46K", "Comments"]], ["The first presidential debate between President Donald J. Trump and Democratic nominee Joe Biden was a \"disastrous meeting for American democracy\" that resulted in no clear winner, pollster Frank Luntz told Bret Baier on \"Special Report\" Wednesday. https://fxn.ws/36jOv02", "2.3K", ["2.9K", "Comments"]], ["The last-minute approval came just hours before funding expired at midnight on Wednesday.", "2.4K", ["1K", "Comments"]], ["Former FBI Director James Comey on Wednesday said it didn’t “ring a bell” when asked whether he received an investigative referral on Hillary Clinton purportedly approving “a plan” attempting to tie President Donald J. Trump to Russia and distract from her email scandal before the 2016 election.", "35K", ["13K", "Comments"]], ["TONIGHT: Senate Majority Leader Mitch McConnell and Sen. Lindsey Graham join ‘Hannity’ to discuss the Supreme Court process and former FBI Director James Comey’s testimony. Tune in tonight at 9p ET on Fox News Channel.", "1.8K", ["973", "Comments"]], ["Democratic presidential nominee Joe Biden holds a campaign event in New Alexandria, Penn.", "27K", ["34K", "Comments"]], ["The Senate is now voting on the Continuing Resolution that will fund the government through December 11. https://fxn.ws/3ngieNI", "3.9K", ["5.5K", "Comments"]], ["President Trump arrives at Minneapolis-Saint Paul International Airport.", "27K", ["9.7K", "Comments"]], ["President Trump arrives at Minneapolis−Saint Paul International Airport aboard Air Force One.", "2.3K", ["257", "Comments"]], ["The sheriff of Multnomah County, Ore., which includes Portland, emphatically denied supporting President Donald J. Trump on Tuesday evening -- shortly after the president made the claim during his debate against Democrat Joe Biden.", "7.6K", ["6.5K", "Comments"]], ["BREAKING NEWS: A judge in Nevada approved an $800 million settlement on Wednesday between MGM Resorts International and its insurers and the families of the victims of a deadly mass shooting at a country music festival in Las Vegas in Oct. 2017.", "2.4K", ["2.3K", "Comments"]], ["Vice President Mike Pence delivers remarks at the Faith and Freedom Coalition Policy Conference in Atlanta.", "28K", ["10K", "Comments"]], ["Former Vice President Joe Biden speaks in Pittsburgh, Pennsylvania.", "21K", ["24K", "Comments"]], ["EARLIER: President Donald J. Trump makes remarks outside the White House before departing for Minnesota.", "19K", ["8.4K", "Comments"]], ["President Donald J. Trump departs for Minnesota on Air Force One.", "16K", ["3.2K", "Comments"]], ["Senate Democratic leadership hold a press briefing in Washington, D.C.", "10K", ["14K", "Comments"]], ["Senate GOP leadership hold a press conference.", "9.9K", ["5.6K", "Comments"]], ["JUST IN: Deonte Lee Murray, the man accused in the shooting ambush against two Los Angeles County deputies in Compton earlier this month, now faces attempted-murder charges, prosecutors announced Wednesday.", "11K", ["2.1K", "Comments"]], ["The Los Angeles County Sheriff's Department provides an update on the ambush shooting investigation of two on-duty deputies that took place September 12.", "6.2K", ["4.6K", "Comments"]], ["Former FBI Director James Comey resumes testifying before the Senate Judiciary Committee regarding the FBI's actions in the early stages of the Russia investigation. https://fxn.ws/34eYbGq", "16K", ["22K", "Comments"]], ["JUST IN: The NFL announced Wednesday that Sunday’s game between the Tennessee Titans and the Pittsburgh Steelers is postponed after at least nine members of the Titans tested positive for coronavirus, marking the league’s first breakout since the season began Sept. 10.", "2.4K", ["2.4K", "Comments"]], ["Former first daughter Chelsea Clinton called for Americans to \"dissent\" against President Donald J. Trump's pick to replace the late Supreme Court Justice Ruth Bader Ginsburg’s seat in an op-ed shared on social media by her mother, former Democratic nominee Hillary Clinton.", "83K", ["54K", "Comments"]], ["JUST IN: Kentucky Attorney General Daniel Cameron's office on Wednesday announced it moved to delay the release of grand-jury records in the controversial March police shooting of Breonna Taylor in Louisville, hours before the audio recording was to go public.", "2.7K", ["1.5K", "Comments"]], ["House Democrat leaders hold a press conference following their closed caucus meeting.", "9.9K", ["13K", "Comments"]], ["Democratic presidential nominee Joe Biden launches a campaign train tour in Cleveland, Ohio.", "31K", ["32K", "Comments"]], ["House GOP leaders hold a press conference on the China Task Force findings report. https://fxn.ws/2SeruDM", "16K", ["8.5K", "Comments"]], ["Former FBI Director James Comey testifies before the Senate Judiciary Committee regarding the FBI's actions in the early stages of the Russia investigation. https://fxn.ws/34eYbGq", "18K", ["25K", "Comments"]], ["Joe Biden refused to answer a question on packing the Supreme Court in the first presidential debate because the former vice president is \"afraid of alienating his far-left flank\" and losing the election, Sen. Tom Cotton told \"Fox & Friends\" Wednesday.", "32K", ["13K", "Comments"]], ["BREAKING: Private employers hired at a faster-than-expected pace in September, indicating the nation's pandemic-ravaged labor market is continuing to recover from the coronavirus crisis, according to the ADP National Employment Report released Wednesday.", "19K", ["1.9K", "Comments"]], ["Former FBI director James Comey will make his long-awaited appearance before the Senate Judiciary Committee Wednesday to answer questions regarding the FBI’s actions in the early stages of the Russia investigation.", "4.9K", ["2K", "Comments"]], ["President Donald J. Trump and former Vice President Joe Biden had a heated exchange over extremist violence with each facing questions over their approach to dealing with the problem.", "15K", ["11K", "Comments"]], ["The first debate of the 2020 presidential election on Tuesday night was fiery from beginning to end.", "5.6K", ["8.4K", "Comments"]], ["\"Under this president, we've become weaker, sicker, poorer, more divided and more violent.\" ICYMI: President Donald J. Trump and former Vice President Joe Biden sparred over the Supreme Court nomination, coronavirus and more — check out the highlights from the first presidential debate, moderated by \"Fox News Sunday\" anchor Chris Wallace.", "6.4K", ["7.3K", "Comments"]], ["President Donald J. Trump and Democratic nominee Joe Biden held a fiery first presidential debate Tuesday night, sparring over everything from the Supreme Court nomination, coronavirus and Biden's sons, with moderator Chris Wallace of Fox News admonishing Trump several times for interrupting and deploring both candidates to let the other speak. Catch up on this story and other developments in today's Fox News First newsletter.", "13K", ["15K", "Comments"]], ["Former Democratic presidential candidate Andrew Yang took to social media to react to Tuesday night's presidential debate.", "25K", ["11K", "Comments"]], ["President Donald J. Trump attacked Democratic nominee Joe Biden over his son Hunter’s foreign business dealings in a heated exchange during the first presidential debate.", "24K", ["11K", "Comments"]], ["Polly’s got a potty mouth.", "28K", ["1.7K", "Comments"]], ["The Trump administration is preparing a series of immigration enforcement operations targeting illegal immigrants in at least three sanctuary jurisdictions, a source familiar with the operations told Fox News Tuesday.", "19K", ["3K", "Comments"]], ["President Donald J. Trump said Tuesday night there’s “nothing happening” in the Supreme Court with Roe v. Wade, and it isn’t on the ballot with the latest Supreme Court vacancy.", "5.5K", ["5.4K", "Comments"]], ["\"I don't hold public office now. I am a former vice president. I've made it clear in my public statements that the violence should be prosecuted.\" Democratic presidential nominee Joe Biden explained at Tuesday night's debate why he has not called the leaders in cities and states where violent protests have erupted.  https://fxn.ws/33gKlnG", "4.7K", ["4.2K", "Comments"]], ["Democratic vice presidential nominee Sen. Kamala Harris reacted on Twitter to Tuesday’s first presidential debate between Joe Biden and President Donald J. Trump.", "179K", ["101K", "Comments"]], ["President Trump slammed Democratic presidential nominee Joe Biden's stance on law enforcement while discussing race relations during the first presidential debate Tuesday.", "155K", ["21K", "Comments"]], ["\"Once the winner is declared, that will be the end of it.\" Democratic presidential nominee Joe Biden said during the first presidential debate Tuesday that he will \"support the outcome\" of the November election amid a back-and-forth with President Donald J. Trump over potential voter fraud due to the unprecedented scale of mail-in ballots amid the coronavirus pandemic. https://fxn.ws/2S7SrZA", "6.1K", ["6.9K", "Comments"]], ["\"One of the biggest takeaways I thought, was the big reminder of Joe Biden's willingness to shut down the economy again.\"  On \"Hannity\" Tuesday, former White House Press Secretary Sarah Sanders discussed her key takeaways from the first presidential debate.  https://fxn.ws/3cU6o7f", "17K", ["6.1K", "Comments"]], ["President Trump arrives at Joint Base Andrews following Tuesday's presidential debate.", "31K", ["16K", "Comments"]], ["President Donald J. Trump and Democratic presidential nominee Joe Biden spoke during the debate Tuesday night about the coronavirus vaccine. https://fxn.ws/34dAdLI", "3K", ["4.2K", "Comments"]], ["Democratic presidential nominee Joe Biden said Tuesday night at the first presidential debate that the nation's economy cannot fully recover until the United States effectively moves past the coronavirus pandemic. https://fxn.ws/34dKK9Z", "49K", ["28K", "Comments"]], ["President Donald J. Trump and Democratic presidential nominee Joe Biden faced off during Tuesday night's presidential debate over Trump's Supreme Court nominee Amy Coney Barrett.  https://fxn.ws/3cHx2jq", "5.5K", ["9.8K", "Comments"]], ["During the first presidential debate Tuesday, President Donald Trump dismissed the idea of shutting down the country due to COVID-19, saying a shutdown will \"hurt people.\" https://fxn.ws/2HLMu2N", "189K", ["46K", "Comments"]], ["Responding to a question of trusting the candidates when it comes to handling the COVID-19 pandemic, former Vice President Joe Biden charged that President Donald Trump “still doesn’t have a plan,” while Trump contended that millions of Americans would have died if Biden was president. https://fxn.ws/33fdMH6", "5.2K", ["11K", "Comments"]], ["Democratic presidential nominee Joe Biden sharply criticized President Donald J. Trump for not revealing a comprehensive health care plan during his tenure at the first presidential debate on Tuesday night. https://fxn.ws/36mFWBJ", "44K", ["40K", "Comments"]], ["President Donald J. Trump and former Vice President Joe Biden take the stage for the first presidential debate. https://fxn.ws/36ifppd", "17K", ["25K", "Comments"]], ["President Donald J. Trump and former Vice President Joe Biden participate in the first presidential debate, moderated by Fox News’ Chris Wallace, in Cleveland, Ohio.  Tune in to Fox News Channel for live coverage and join the conversation in our ‘Democracy 2020 Live!’ experience:  https://fxn.ws/33c4ueE", "43K", ["204K", "Comments"]], ["BREAKING: The Walt Disney Company's Chairman of Parks, Experiences and Products, Josh D'Amaro, announced Tuesday evening that approximately 28,000 employees -- known as \"cast members\" -- will be laid off at its theme parks due to the ongoing impact of the coronavirus pandemic.", "8.9K", ["3.2K", "Comments"]], ["TONIGHT: Donald Trump Jr., Ari Fleischer and Sarah Sanders join \"Hannity\" to react to the first presidential debate. Tune in to Fox News Channel at 11p ET.", "3.6K", ["1.9K", "Comments"]], ["Vice President Pence delivers remarks at a \"Make America Great Again\" event and presidential debate watch party in Lititz, Penn.", "46K", ["16K", "Comments"]], ["A Houston Starbucks employee was fired after scribbling “Defund the Police” on customers' drinks, according to a report.", "15K", ["2.1K", "Comments"]], ["Mexico is now deploying guards equipped with assault rifles to help protect mining companies from attacks by drug cartels.", "8.1K", ["1.4K", "Comments"]], ["BREAKING: The Director of National Intelligence (DNI) has declassified information indicating that former President Obama's administration knew of allegations that former Democratic presidential nominee Hillary Clinton was attempting to tie Trump to Russia and distract from her email scandal in 2016.", "112K", ["26K", "Comments"]], ["“On each and every issue there’s a point-by-point contrast and a clear, definitive choice the American people have to make, and I think they’ll recognize the president’s accomplishments this evening.” White House press secretary Kayleigh McEnany joined \"America's Newsroom\" Tuesday morning ahead of the first presidential debate between President Donald J. Trump and Democratic presidential nominee Joe Biden.", "6K", ["2.2K", "Comments"]], ["Be part of the first presidential debate with our 'Democracy 2020 Live!' experience. Join the conversation, react in real time to debate answers and see what your favorite Fox News personalities are saying. To participate, scan the QR code in this video or sign up at https://fxn.ws/33c4ueE now and tune in to Fox News Channel tonight at 9p ET as the debate kicks off!", "1.3K", ["983", "Comments"]], ["In a presidential race that has remained relatively consistent in the polls the past six months, tonight's debate – the first of three in-person showdowns between Democratic presidential nominee Joe Biden and President Donald J. Trump – offers an opportunity for Trump to stir the pot and try to move the needle. Tune in to Fox News Channel at 9p ET for this must-see event, moderated by Fox News’ Chris Wallace.", "3.8K", ["3.3K", "Comments"]], ["Judge Amy Coney Barrett, President Donald J. Trump's nominee to the Supreme Court, and Vice President Mike Pence arrive at the Capitol where she met with senators on Tuesday in Washington.", "42K", ["2.5K", "Comments"]], ["President Donald J. Trump arrives in Cleveland, Ohio, ahead of tonight's debate, which starts at 9p ET. Courtesy: WOIO", "41K", ["17K", "Comments"]], ["House Speaker Nancy Pelosi urged Democratic presidential nominee Joe Biden to be himself on Tuesday night as the former vice president and President Donald J. Trump are set to face off for the first time, calling on Biden to “save the planet.”", "36K", ["10K", "Comments"]], ["\"Fox News Sunday\" anchor Chris Wallace prepares to moderate the first presidential debate from Cleveland, Ohio. Tune in to this must-see event tonight at 9p ET on Fox News Channel.", "5.1K", ["5.5K", "Comments"]], ["President Donald J. Trump departs Joint Base Andrews en route to Cleveland, Ohio, for tonight's debate. Tune in to Fox News Channel at 9p ET when the debate kicks off.", "42K", ["16K", "Comments"]], ["Former FBI Deputy Director Andrew McCabe and his legal team are calling for the Justice Department inspector general to launch an investigation into the agency over what they say is the FBI’s refusal to provide McCabe documents they say he needs to prepare for upcoming congressional testimony.", "3.9K", ["1.2K", "Comments"]], ["JUST IN: Former Vice President Joe Biden's campaign on Tuesday released 2019 tax returns for Biden and running mate Kamala Harris, calling on President Donald J. Trump to release his own, hours before Biden and Trump are set to face off in the first presidential debate.", "31K", ["28K", "Comments"]], ["President Donald J. Trump received his third 2020 Nobel Peace Prize nomination in September, this time from a group of Australian law professors.", "221K", ["18K", "Comments"]], ["TONIGHT: Vice President Mike Pence joins Bret Baier before the highly anticipated presidential debate to share his thoughts on the showdown. Watch the exclusive interview on ‘Special Report’ at 6p ET on Fox News Channel.", "6.6K", ["1.5K", "Comments"]], ["New York Governor Andrew Cuomo holds a press briefing.", "17K", ["23K", "Comments"]], ["President Donald J. Trump is asking for an additional ground rule ahead of Tuesday night’s first presidential debate between himself and Democratic presidential nominee Joe Biden.", "145K", ["29K", "Comments"]], ["JUST IN: Kuwait's Emir, Sheikh Sabah Al Ahmed Al Sabah, has died at the age of 91, state media reported Tuesday morning.", "1.6K", ["785", "Comments"]], ["Vice President Mike Pence and Senate Majority Leader Mitch McConnell deliver remarks prior to their meeting with Supreme Court nominee Judge Amy Coney Barrett.", "17K", ["4.8K", "Comments"]], ["Hundreds of thousands of elementary school students are heading back to classrooms Tuesday as New York City enters a high-stakes stage of resuming in-person learning during the coronavirus pandemic, which is keeping students at home in many other big U.S. school systems.", "2.3K", ["1K", "Comments"]], ["Nearly three in four voters plan to watch Tuesday's first 2020 presidential debate at 9 p.m. ET in Cleveland, Ohio, a new poll found.", "22K", ["10K", "Comments"]], ["TONIGHT at 9p ET: President Donald J. Trump and former Vice President Joe Biden face off in the first presidential debate. Tune in to Fox News Channel for this must-see event, moderated by Fox News’ Chris Wallace. https://fxn.ws/3mYPR6v", "42K", ["17K", "Comments"]], ["Supreme Court nominee Judge Amy Coney Barrett is set to start meeting with senators on Capitol Hill Tuesday as her accelerated confirmation process continues despite multiple Democrats refusing to see her, calling the process that led to her nomination so close to a presidential election \"illegitimate.\"", "22K", ["7.7K", "Comments"]], ["Northern California's wine country was on fire again Monday as strong winds fanned flames in the already scorched region, destroying homes and prompting orders for nearly 70,000 people to evacuated. Meanwhile, three people died in a separate fire further north in the state.", "4.8K", ["1.8K", "Comments"]], ["A grand juror in the Breonna Taylor case is requesting the release of records and transcripts of the proceedings so \"the truth may prevail\" after the panel opted to indict just one of the three police officers involved in the botched drug raid that led to her death.", "3.8K", ["3.2K", "Comments"]], ["The Napa County Sheriff’s Office shared this dramatic footage of the Glass Fire and urged people not to wait until \"the last second to evacuate.\" https://fxn.ws/3kNoaM2", "2.4K", ["654", "Comments"]], ["President Donald J. Trump and former Vice President Joe Biden are preparing for Tuesday's debate in starkly different ways, with the latter engaging in mock stand-offs while the former says he's leveraging as practice the contentious environment he already faces as president. Catch up on this story and other developments in today's Fox News First newsletter.", "4K", ["4K", "Comments"]], ["EXCLUSIVE: The Trump administration on Tuesday is launching a safety pledge with the National Center for Missing and Exploited Children in an effort to prevent attacks from online predators and sex traffickers, as the nonprofit has seen “a dramatic increase” in reports of child sex exploitation since the coronavirus pandemic began.", "42K", ["4.3K", "Comments"]], ["Sen. Kamala Harris ripped Trump and the GOP for attempting to appoint a Supreme Court justice during an election year.", "19K", ["8.3K", "Comments"]], ["One in three parents doesn't intend to have their child vaccinated for the flu this season, according to a new poll, despite the potential threat of a second wave of COVID-19 cases.", "7.5K", ["5.4K", "Comments"]], ["A gorilla at the Prague Zoo in the Czech Republic has gone viral after an amateur photographer captured an image of the massive mammal curling its lip reminiscent of Elvis Presley, while holding parsley like a microphone, British news agency SWNS reports. https://fxn.ws/337a1Dx", "2K", ["722", "Comments"]], ["Meghan McCain and her husband, Ben Domenech, announced the birth of their first child on Monday, a girl named Liberty Sage McCain Domenech, according to a report.", "3.4K", ["1.6K", "Comments"]], ["An alleged meth trafficker was arrested after a good Samaritan turned in the suspect’s wallet to police in Florida, according to a report.", "3.8K", ["831", "Comments"]], ["At least 30 people were arrested in Oregon during unrest over the weekend, as Gov. Kate Brown announced that she has asked law enforcement officials to investigate “any alleged incidents” involving their officers.", "4.1K", ["1.4K", "Comments"]], ["The Kentucky Attorney General Daniel Cameron’s office reportedly said Monday that it would release the recordings from the grand jury deliberations in the Breonna Taylor case later this week after a lawsuit was filed by an unnamed juror to make the details public.", "1.4K", ["1.8K", "Comments"]], ["\"There's just no better person for the job.\" Megan Edwards joined 'The Story with Martha MacCallum' Tuesday evening, to respond to criticism of her sister, Amy Coney Barrett, President Donald J. Trump's SCOTUS nominee.", "6.2K", ["1K", "Comments"]], ["Former Obama White House counsel Bob Bauer is standing in for President Donald J. Trump during former Vice President Joe Biden’s debate prep, Fox News has learned.", "4.5K", ["3.7K", "Comments"]], ["A new Monmouth University poll found there to be a divide among American voters when it comes to the president filling a vacant Supreme Court seat at the end of their term, as President Donald J. Trump gets ready to nominate Amy Coney Barrett to replace the late Justice Ruth Bader Ginsburg.", "2.6K", ["3.3K", "Comments"]], ["Sen. Rick Scott introduced legislation last week to establish federal standards regarding the counting of ballots, ahead of the upcoming presidential election between Democratic nominee Joe Biden and President Trump.", "27K", ["4.3K", "Comments"]], ["David Bossie, 2016 Deputy Trump Campaign Manager, joined 'Hannity' Tuesday night to talk about the upcoming presidential election, and President Donald J. Trump's accomplishments, as election day approaches.", "73K", ["14K", "Comments"]], ["BREAKING NEWS: The Tampa Bay Lightning won the Stanley Cup for the second time in franchise history after defeating the Dallas Stars 2-0 in Game 6 on Monday night. It's the first major title decided since the coronavirus pandemic forced the sports world to shut down in March.", "3.6K", ["740", "Comments"]], ["\"The Senate has every right to consider — or not consider — the president’s nominees, however it sees fit.\" — Sen. Tom Cotton via Fox News Opinion", "14K", ["2K", "Comments"]], ["The National Organization for Women, which is connected to a PAC that endorsed the Biden-Harris ticket, said Barrett \"will turn back the clock on equality.\"", "16K", ["6.4K", "Comments"]], ["BREAKING: There have been over 1 million coronavirus-associated deaths worldwide since the illness was first reported in late 2019, according to Johns Hopkins University data.", "4.4K", ["5.7K", "Comments"]], ["\"You can't have better preparation [ahead of a presidential debate] than taking the most hostile of questions from the White House press corps, each and every day... but [President Trump] has done some additional prep, and he is ready to go for tomorrow.\" White House Press Secretary Kayleigh McEnany joined \" The Story with Martha MacCallum\" Monday night, and contrasted the records of President Trump and Joe Biden.", "10K", ["3.2K", "Comments"]], ["Pittsburgh Steelers offensive lineman Alejandro Villanueva said Monday his decision to wear Sgt. 1st Class Alwyn Cashe’s name on the back of his helmet over Antwon Rose Jr.’s name was “exclusively” about getting him a Medal of Honor.", "9.3K", ["701", "Comments"]], ["Some Cleveland businesses aren't taking any chances ahead of Tuesday's first presidential debate and have started boarding up over concerns of possible unrest that has gripped the country in recent months, coupled with a contentious election.", "9.8K", ["4.4K", "Comments"]], ["JUST IN: Democratic House lawmakers on Monday unveiled a $2.2 trillion package of coronavirus relief funds intended to \"avert catastrophe for schools, small businesses, restaurants, performance spaces, airline workers and others.\"", "5.1K", ["3.8K", "Comments"]], ["Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, on Monday called Florida's recent decision to ease restaurant restrictions “very concerning.”", "18K", ["10K", "Comments"]], ["Joe Biden's proposal to hike taxes on corporations and wealthy Americans could dramatically shrink the nation's economy and destroy millions of jobs, according to new projections from President Donald J. Trump's former chief economist.", "20K", ["8.7K", "Comments"]], ["TONIGHT: Sen. Ted Cruz and Ari Fleischer join ‘Hannity’ to discuss Tuesday’s first presidential debate. Tune in at 9p ET on Fox News Channel.", "3.2K", ["1.5K", "Comments"]], ["U.S. Senator Kamala Harris participates in a Sister to Sister meets Shop Talk roundtable to hear directly from Black North Carolinians and highlight the importance of voting to affect change.", "21K", ["27K", "Comments"]], ["House Speaker Nancy Pelosi urged her congressional colleagues to redirect their fundraising efforts in an attempt to shore up the type of majority the party would need if the 2020 presidential election reached her chamber.", "9.5K", ["4.2K", "Comments"]], ["President Donald J. Trump gives an update on the nation’s coronavirus testing strategy.", "23K", ["16K", "Comments"]], ["We're just one day away from the first presidential debate! President Donald J. Trump and former Vice President Joe Biden will face off Tuesday at 9p ET on Fox News Channel. Tune in for this must-see event, moderated by Chris Wallace. https://fxn.ws/33bSF8p", "3.9K", ["2.3K", "Comments"]], ["A new law signed by California Gov. Gavin Newsom on Saturday requires the state to house transgender inmates in prisons based on their gender identity.", "24K", ["9.9K", "Comments"]], ["Democratic vice presidential nominee Sen. Kamala Harris delivers remarks on the Supreme Court and the presidential election.", "47K", ["61K", "Comments"]], ["A group of 70 senior government officials who worked with various Republican administrations dating back to Richard Nixon endorsed President Donald J. Trump for re-election on Monday, citing his accomplishments on foreign policy and national security.", "101K", ["8K", "Comments"]], ["“You can have a career and be a mother. I was with my 10-month-old late last night and then I showed up here in the morning to work. And there’s no better example of being a working mom than Amy Coney Barrett who has seven kids, two of whom she adopted.” White House press secretary Kayleigh McEnany reacted to working mom criticism directed at Supreme Court nominee Amy Coney Barrett on \"Fox & Friends” Monday morning.", "15K", ["3.4K", "Comments"]], ["The girl, identified as Serenity Arrington, suffered multiple stab wounds and died shortly after being rushed to a local hospital, according to CBS Chicago. Neighbors in East Garfield Park tried to assist the girl, while her mother, 27-year-old Simone Austin, was charged in her death with first-degree murder, the report added.", "14K", ["5.1K", "Comments"]], ["During a speech in Delaware, the former vice president told reporters that he did not want to discuss whether or not he backed adding more justices to the high court if he won the Nov. 3 election.", "5.7K", ["3.1K", "Comments"]], ["English surfing prodigy Nate wowed the beach-going crowds with his incredible skills at just 4 years old.", "3.3K", ["364", "Comments"]], ["\"I think that this is probably the biggest moment to change, potentially, the trajectory of this race.\" On 'America's Newsroom,' Fox News chief political anchor and 'Special Report' host Bret Baier discusses the first presidential debate, moderated by Fox News' Chris Wallace. Tune in for this must-see event Tuesday at 9p ET on Fox News Channel.", "1.9K", ["1.7K", "Comments"]], ["This plan – 16 days between a nomination and a hearing – represents a very quick timeline compared to most modern Supreme Court confirmations.", "21K", ["4.5K", "Comments"]], ["The Chicago Police Department holds a news conference to provide an update on weekend violence. https://fxn.ws/3jaF6vF  Courtesy: WFLD", "5.6K", ["4.2K", "Comments"]], ["EARLIER: President Donald J. Trump makes remarks outside the White House after looking at a Lordstown Motors 2021 endurance truck.", "30K", ["10K", "Comments"]], ["A seal was caught on video with its fins in the air relaxing under a jetty in South Australia over the weekend.", "4.3K", ["1K", "Comments"]], ["Hundreds of homes and a hospital have been evacuated in California's wine country as a fast-spreading wildfire has scorched thousands of acres with another day of dangerous fire conditions expected Monday.", "7.9K", ["2.7K", "Comments"]], ["Two Democrats on the Senate Judiciary Committee said they will not meet with Amy Coney Barrett -- President Donald J. Trump’s pick to fill the vacancy on the Supreme Court.", "10K", ["8.7K", "Comments"]], ["Senate Judiciary Committee Chairman Lindsey Graham on Sunday detailed the timeline of Judge Amy Coney Barrett's Supreme Court confirmation process starting Oct. 12.", "9.8K", ["2.4K", "Comments"]], ["Amy Coney Barrett’s pastor, Father Kevin Rousseau, weighed in on \"Fox & Friends\" Monday morning on how important the Supreme Court nominee’s faith is to her and how she will withstand further criticism.", "8.2K", ["2K", "Comments"]], ["“I’m trying to get them to engage, to focus on the key issues, to give people at home a sense of why [they] want to vote for one versus the other,” Fox News Sunday anchor Chris Wallace said. “If I’ve done my job right, at the end of the night, people will say, ‘That was a great debate, who was the moderator?’” Tune in for the first presidential between President Donald J. Trump and former Vice President Joe Biden Tuesday at 9p ET on Fox News Channel.", "13K", ["11K", "Comments"]], ["More than 25% of COVID-19 tests came back positive in some Midwestern states last week, as the region experiences an increase in infections and hospitalizations, according to a report on Sunday.", "2.2K", ["3.5K", "Comments"]], ["EXCLUSIVE: The White House is mounting an “offensive” communications strategy ahead of Supreme Court nominee Judge Amy Coney Barrett's upcoming Senate confirmation fight, with aides describing an aggressive plan for “knife fighters” to “fiercely” defend the nominee ahead of what’s expected to be a heated battle on Capitol Hill.", "16K", ["4.7K", "Comments"]], ["President Donald J. Trump lambasted a New York Times report that said he paid no federal income taxes for 10 of the past 15 years, calling the story “fake news” and arguing that he paid large federal and state taxes.  Catch up on this story and other developments in today's Fox News First newsletter.", "15K", ["15K", "Comments"]], ["Sen. Kelly Loeffler, R-Ga., has pushed back against a claim by Senator Chuck Schumer that there was “no precedent” for confirming a Supreme Court nominee between July and Election Day in a presidential year.", "3.7K", ["1.9K", "Comments"]], ["\"The dilemma for the Democrats is they have to decide whether they will try to destroy her (as they tried with Bork, Thomas, and Kavanaugh) or to concede that she is unacceptable for liberals but acceptable (indeed preferable) to most Americans.\" — Newt Gingrich via Fox News Opinion", "12K", ["2.7K", "Comments"]], ["Senator Chuck Schumer, D-N.Y., said the survival of the Affordable Care Act (ACA), also known as Obamacare, is on the line in remarks Saturday night reacting to President Donald J. Trump nominating 7th Circuit Court of Appeals Judge Amy Coney Barrett to the Supreme Court.", "9.4K", ["5.5K", "Comments"]], ["A U.S. district judge in Laredo, Texas, on Friday blocked Texas from eliminating straight-ticket voting in the state nearly a month ahead of the 2020 presidential election, citing coronavirus concerns as a major reason behind the ruling.", "1.7K", ["1.4K", "Comments"]], ["Justice Ruth Bader Ginsburg’s personal trainer picked a unique way of paying homage to the late justice at the U.S. Capitol Friday: He dropped down and did pushups next to the casket.", "1K", ["913", "Comments"]], ["A New York Supreme Court judge has ordered a public inquiry into the case of Eric Garner, multiple sources report.", "1.1K", ["1K", "Comments"]], ["Former Sen. Joe Lieberman cautioned Democrats Friday against harshly questioning presumptive Supreme Court nominee Amy Coney Barrett on her Roman Catholic faith, warning such a line of inquiry will \"hurt her opponents.\" https://fxn.ws/3j8EtCO", "49K", ["3.8K", "Comments"]], ["More than a dozen rioters were arrested late Saturday in Portland, Ore., as crowd members threw cans, bottles and other objects at law enforcement officers, authorities said.", "5.6K", ["1.9K", "Comments"]], ["\"If liberals really believed in diversity, under no circumstances would they make fools of themselves with irrational attempts to whitewash history, Senate precedent, and the objective reality experienced by millions of Americans who are no more afraid of a Catholic woman’s ideas than they are of the words painted on a liberal woman’s protest placard.\" — Sen. Marsha Blackburn via Fox News Opinion", "5.2K", ["3.1K", "Comments"]], ["Democratic presidential nominee Joe Biden on Sunday called on the U.S. Senate to hold off voting on President Donald J. Trump's Supreme Court nominee Amy Coney Barrett, saying that  senators should \"take a step back from the brink,\" and that \"this is a time to de-escalate.\" https://fxn.ws/3kMMtJO", "28K", ["16K", "Comments"]], ["“I really want to hear Joe Biden talk about his policies” during the first presidential debate scheduled for Tuesday, Republican National Committee (RNC) Chairwoman Ronna McDaniel told “Fox & Friends Weekend” on Sunday.", "11K", ["7.7K", "Comments"]], ["House Speaker Nancy Pelosi argued that a person’s religious beliefs should not matter to the senators questioning the potential Supreme Court justice, but instead they should focus on Barrett’s views on the Constitution.", "7.1K", ["3K", "Comments"]], ["In an exclusive interview on 'Sunday Morning Futures with Maria Bartiromo,' Senate Judiciary Committee Chairman Lindsey Graham told Maria Bartiromo that former FBI deputy director Andrew McCabe will testify on Oct. 6, adding that \"something else ... more damning\" is coming amid fallout over the controversial Steele dossier. https://fxn.ws/30d5IER", "4K", ["1.6K", "Comments"]], ["Bernie Sanders, I-Vt., couldn't nail down a plan for what lawmakers should do if President Donald J. Trump refuses to concede the White House if he loses in November, but said there will be a \"number of plans\" if that scenario were to take place.", "10K", ["7K", "Comments"]], ["A federal prosecutor has spoken out against Attorney General William Barr about his recent stances on the Mueller investigation and mail-in voting, saying that Barr has “brought shame” on the Department of Justice (DOJ).", "17K", ["8.4K", "Comments"]], ["Mike Tyson tweeted last week that he will be voting this year in a presidential election -- for the first time in his life. The 54-year-old boxing legend was sentenced to six years behind bars after being convicted of rape and deviant sexual conduct in 1992, The Hill noted. He served three years before his release. His conviction had previously disqualified him from voting until Nevada passed a law in 2019 to allow convicted felons to vote once they completed their prison sentence. https://fxn.ws/3361JeY", "22K", ["5.2K", "Comments"]], ["Super Bowl LV will take place in Tampa, Florida, at Raymond James Stadium next year and Gov. Ron DeSantis is hoping to have a full stadium despite the unknowns surrounding the coronavirus.", "12K", ["2.3K", "Comments"]], ["Sen. Tom Cotton announced the launch of a \"Supreme Court War Room\" on Friday to help Republicans fight back against Democratic attacks on President Trump's impending nomination to fill the High Court's seat left vacant after the death of Justice Ruth Bader Ginsburg.", "21K", ["3K", "Comments"]], ["George Mason University is working with the Virginia Health Department to contact trace potential cases of coronavirus after the state's governor tested positive for COVID-19 days after visiting the school.", "2.6K", ["1.9K", "Comments"]], ["Seattle police made at least 10 arrests Saturday evening when Breonna Taylor protests devolved into chaos and violence as demonstrators set fires and damaged property and allegedly committed assaults in the Capitol Hill neighborhood.", "13K", ["5.7K", "Comments"]], ["\"Vice President Biden and I both know that supporting his candidacy now certainly won’t dissuade me from speaking out later when I disagree with him,\" former Pennsylvania Gov. Tom Ridge wrote. \"But we surely will do so with civility and respect, not with childish name-calling and [T]witter tirades.\"", "13K", ["8.2K", "Comments"]], ["After President Donald J. Trump nominated federal appeals court Judge Amy Coney Barrett to the Supreme Court on Saturday, Senator Josh Hawley, R-Mo., sent a letter to Senator Chuck Schumer, D-N.Y., asking Democrats to avoid attacks on her Catholic faith during the confirmation process.", "15K", ["5K", "Comments"]], ["“I'm not going to vote for anything that would cause, basically, not be able to work in a bipartisan way,” Manchin said when asked about expanding the court.", "15K", ["2.6K", "Comments"]], ["Legendary NFL quarterback Joe Montana reportedly confronted a home intruder over the weekend after the burglar allegedly grabbed one of his grandchildren.", "9.8K", ["1.9K", "Comments"]], ["President Donald J. Trump speaks at the White House.", "41K", ["30K", "Comments"]], ["Amy Coney Barrett’s former law clerk, John Adams, told “Fox & Friends Weekend” on Sunday that “she will be a great Supreme Court justice.”", "41K", ["2.3K", "Comments"]], ["A message from our friends at FOX Bet: Predict six outcomes of the first presidential debate between President Donald Trump and former Vice President Joe Biden for a chance to win $25,000. To enter the FOX Bet Super 6 game for free, click here: https://foxsuper6.onelink.me/y0bF/FOXDebate *No purchase necessary. Open to legal residents of the US, excluding WA. 18 and older. Contest entry open until 9/29/2020 8:59:59 EDT. See terms and conditions at foxsuper6.com for prize description and full details. Sponsored by TSG Interactive US Services Limited. Prize supplied by Sponsor, TSG Interactive US Services Limited.", "748", ["1.3K", "Comments"]], ["“I think the most important thing to know about Judge Barrett’s jurisprudence is that she will go where the law takes her.” Labor Sec. Eugene Scalia, in an exclusive interview on \"Fox News Sunday,\" discussed Judge Amy Coney Barrett following her nomination by President Donald J. Trump to fill the seat left vacant on the Supreme Court by the late Justice Ruth Bader Ginsburg. https://fxn.ws/30tLHdl", "4.8K", ["1K", "Comments"]], ["Dwayne “The Rock” Johnson endorsed former Vice President Joe Biden and Sen. Kamala Harris, marking the first time he’s ever publicly thrown his weight behind a political candidate.", "97K", ["51K", "Comments"]], ["Washington Football Team players were seen wearing shirts dedicated to Breonna Taylor in the wake of a Kentucky grand jury’s decision not to charge any police officer with her death.", "8.1K", ["6.8K", "Comments"]], ["\"It's very clear from her writings, multiple writings, that she will be the vote that takes away healthcare for millions of Americans.\" Sen. Debbie Stabenow joined \"Fox News Sunday\" for an exclusive interview and discussed her take on Judge Amy Coney Barrett, President Donald J. Trump’s nominee to fill the vacant seat on the Supreme Court. https://fxn.ws/30cfHKw", "8K", ["5.9K", "Comments"]], ["Secretary of State Mike Pompeo decries claims that President  Donald J. Trump is \"anti-military\" and says Trump’s foreign policy has made the world “safer” in an interview with Mark Levin tonight. Tune in to the must-see interview on \"Life, Liberty & Levin\" at 8p ET on Fox News Channel. https://fxn.ws/3cyePF1", "37K", ["7.2K", "Comments"]], ["JUST IN: Democratic presidential nominee Joe Biden on Sunday called on the U.S. Senate to hold off voting on President Donald J. Trump's Supreme Court nominee Amy Coney Barrett, claiming that the right thing to do would be to wait to fill the vacant seat on the court until after January's inauguration.", "49K", ["18K", "Comments"]], ["Former Vice President Joe Biden delivers remarks on President Donald J. Trump's nominee to the Supreme Court, Judge Amy Coney Barrett.", "38K", ["56K", "Comments"]], ["\"That's really the only question you have before [you] — will she uphold the Constitution? Will she understand the Constitution? Republicans and Democrats alike know that is true.\" During an exclusive interview on \"Sunday Morning Futures with Maria Bartiromo,\" House Minority Leader Kevin McCarthy praised President Donald J. Trump's pick to fill the Supreme Court seat vacated by the late Justice Ruth Bader Ginsburg, telling Maria Bartiromo that Amy Coney Barrett is a \"fabulous\" choice.", "4K", ["937", "Comments"]], ["“I think she’s going to make a lot of people very proud.” President Donald J. Trump told 'Fox & Friends' co-host Pete Hegseth that he thinks his nominee to the Supreme Court, Judge Amy Coney Barrett, will be a textualist, and is looking for someone \"that can interpret the Constitution as written.\" https://fxn.ws/3kW5idT", "16K", ["3.4K", "Comments"]], ["Be part of the first presidential debate with our 'Democracy 2020 Live!' experience. Join the conversation, react in real time to debate answers and see what your favorite Fox News personalities are saying. To participate, scan the QR code in this video or sign up at foxnews.com/2020live now and tune in to Fox News Channel Tuesday at 9p ET as the debate kicks off!", "1.2K", ["900", "Comments"]], ["The Florida Gators and Ole Miss Rebels took a knee in a moment of solidarity before their game kicked off Saturday afternoon.", "7.4K", ["5K", "Comments"]], ["\"Mostly, I'm looking for somebody that can interpret the Constitution as written,\" President Donald J. Trump told \"Fox & Friends\" co-host Pete Hegseth during the exclusive one-on-one interview.", "22K", ["5.6K", "Comments"]], ["According to a new study, nearly half of Americans have already begun shopping online for the holidays, Southwest News Service (SWNS) reports. And the reason is simple: People are bored.", "1.6K", ["736", "Comments"]], ["Zookeepers in Australia have had their hands full and bottles at the ready hand-raising the park’s adorable baby animals.", "2.5K", ["312", "Comments"]], ["The city of Rochester, N.Y., appointed its first female police chief Saturday as part of an overhaul of the force following weeks of protests.", "1.3K", ["859", "Comments"]], ["Det. Brett Hankison, the since-fired Louisville police officer who now faces charges in connection with the Breonna Taylor case, was “visibly shaking” soon after the March drug raid that left Taylor dead -- and feared losing his job, a city police chief – who also lost his job -- testified soon after the incident.", "3.2K", ["4.3K", "Comments"]], ["A suspect was in custody Saturday night after a Los Angeles police officer was struck in the head by a bullet inside the department’s Harbor Station in San Pedro, according to reports.", "5K", ["1.1K", "Comments"]], ["Republicans are eyeing Oct. 12 as the target date for the start of confirmation hearings for Trump’s pick to fill the Supreme Court vacancy left by the death of late Justice Ruth Bader Ginsburg, a source familiar with the process told Fox News.", "7.8K", ["1.6K", "Comments"]], ["Amy Coney Barrett said Saturday that, if confirmed as a United States Supreme Court justice, she would assume the role to serve the American people. https://fxn.ws/3cxCk0I", "106K", ["5K", "Comments"]], ["TUNE IN: President Donald Trump sits down with Pete Hegseth for an exclusive interview on \"Fox & Friends,\" today at 6a ET on Fox News Channel.", "9.3K", ["4.9K", "Comments"]], ["\"She is a woman of unparalleled achievement, towering intellect, sterling credentials and unyielding loyalty to the Constitution.\" President Donald J. Trump on Saturday announced he has chosen Amy Coney Barrett as his pick to fill the Supreme Court seat vacated by the late Justice Ruth Bader Ginsburg. https://fxn.ws/30cmrIf", "8.8K", ["1.2K", "Comments"]], ["Democrats took to social media to slam President Donald J. Trump's choice of Judge Amy Coney Barrett for the Supreme Court after the president's announcement Saturday night -- with one senator claiming the nomination is the result of an \"illegitimate process.\"", "7.4K", ["4.2K", "Comments"]], ["Nineteen years after the terror attacks of Sept. 11, 2001, the 9/11 Victims’ Compensation Fund's Special Master Rupa Bhattacharyya announced that if a first responder’s or survivor’s death certificate lists COVID-19, plus cancer or a certified respiratory illness, the fund would accept wrongful death claims and consider it a 9/11-related illness.", "1.9K", ["797", "Comments"]], ["Louisville Metro Police Sgt. Jonathan Mattingly, who was not indicted this week in the shooting death of Breonna Taylor, will file civil lawsuits against individuals who allegedly called him a \"murderer.\"", "27K", ["6.6K", "Comments"]], ["Two protesters in Southern California were injured Saturday after a driver allegedly plowed through a demonstration where both President Donald J. Trump supporters and Black Lives Matter demonstrators had gathered.", "3.6K", ["2.6K", "Comments"]], ["Democratic presidential nominee Joe Biden on Saturday said the Senate should not act on Judge Amy Coney Barrett’s nomination to the Supreme Court until after “the American people select their next president and the next Congress.” https://fxn.ws/2G1qkJ2", "17K", ["11K", "Comments"]], ["President Donald J. Trump nominated Judge Amy Coney Barrett to replace the late Justice Ruth Bader Ginsburg on the Supreme Court Saturday, a move immediately met with praise from religious conservatives, who have Barrett for years.", "33K", ["2.8K", "Comments"]], ["Judge Amy Coney Barrett is joined by her family Saturday at the White House Rose Garden as President Donald J. Trump announces her nomination to the Supreme Court seat left vacant by the passing of Justice Ruth Bader Ginsburg.", "37K", ["3.1K", "Comments"]], ["Republicans in Congress lauded President Trump for his nomination of Judge Amy Coney Barrett to the Supreme Court Saturday night while Democrats predicted her confirmation could be a death knell for a number of liberal priorities, including the Affordable Care Act (ACA) and Roe v. Wade.", "10K", ["1.1K", "Comments"]], ["The Republican National Committee launched a $10 million campaign to promote President Trump’s Supreme Court nominee, Judge Amy Coney Barrett, to \"hold Democrats accountable\" for what the GOP called their \"hypocrisy\" on the nomination process to the high court.", "29K", ["2.7K", "Comments"]], ["President Donald J. Trump on Saturday announced he has chosen Amy Coney Barrett as his pick to fill the Supreme Court seat vacated by the late Justice Ruth Bader Ginsburg, describing Barrett as \"a woman of unparalleled achievement, towering intellect, sterling credentials and unyielding loyalty to the Constitution.\"", "55K", ["3K", "Comments"]], ["Democratic Sen. Brian Schatz of Hawaii expressed frustration with his party Friday over the Supreme Court fight over the seat left vacant after the death of Justice Ruth Bader Ginsburg.", "3.3K", ["1K", "Comments"]], ["A new poll found that the majority of Americans believe the winner of the presidential election should select Justice Ruth Bader Ginsburg's successor.", "50K", ["48K", "Comments"]], ["\"We are in the fight of our lives, you have 38 days. The choice between a man with uncommon stamina, energy and perseverance to fight the dark forces that seek to tear down mankind's greatest experiment of freedom, or the Trojan horse that includes the America that you have witnessed for the last several months without respect for law and order, without respect for the Constitution, without respect for the First and Second Amendment and indeed, without respect for freedom of religion.\" — Judge Jeanine Pirro", "32K", ["4.3K", "Comments"]], ["House Speaker Nancy Pelosi issued a statement following President Trump's nomination of Amy Coney Barrett to the Supreme Court, saying millions of families will have their health care \"ripped away in the middle of a pandemic.\"  https://fxn.ws/3i4CFcv", "105K", ["51K", "Comments"]], ["\"I love the United States, and I love the United States Constitution.\" Judge Amy Coney Barrett on Saturday accepted President Donald J. Trump's nomination to the United States Supreme Court, pledging to \"faithfully and impartially discharge\" her duties under the Constitution while vowing to go through the confirmation process with \"humility and courage.\" https://fxn.ws/2S28oR4", "57K", ["5.3K", "Comments"]], ["Democratic vice presidential nominee Sen. Kamala Harris released a statement Saturday saying she is \"strongly\" against President Donald J. Trump’s nomination of Amy Coney Barrett to the U.S. Supreme Court. https://fxn.ws/30cmrIf", "82K", ["45K", "Comments"]], ["President Trump holds a campaign rally in Middletown, Penn.", "58K", ["28K", "Comments"]], ["Before the first presidential debate, Bret Baier and Martha MacCallum host a special preview with unrivaled panel analysis, plus insight from debate moderator Chris Wallace. Don’t miss “Democracy 2020: Debate Preview,” Sunday at 10p ET on Fox News Channel.", "1.5K", ["1K", "Comments"]], ["President Trump departs Joint Base Andrews en route to Middletown, Penn.", "19K", ["6K", "Comments"]], ["Democratic presidential nominee Joe Biden on Saturday said the Senate should not act on Judge Amy Coney Barrett’s nomination to the Supreme Court until after “the American people select their next president and the next Congress.”", "34K", ["14K", "Comments"]], ["Judge Amy Coney Barrett on Saturday accepted President Trump’s nomination to the United States Supreme Court, pledging to “faithfully and impartially discharge” her duties under the Constitution while vowing to enter the confirmation process with “humility and courage.”", "24K", ["2.3K", "Comments"]], ["BREAKING: President Trump on Saturday announced he has chosen Amy Coney Barrett as his pick to fill the Supreme Court seat vacated by the late Justice Ruth Bader Ginsburg -- a move that could significantly shift the nation's highest court to the right if she's confirmed by the Senate.", "254K", ["20K", "Comments"]], ["President Donald J. Trump makes the announcement of his nominee for Associate Justice of the Supreme Court of the U.S. in the Rose Garden. https://fxn.ws/30cmrIf Tune in to Fox News Channel for continuing coverage.", "88K", ["18K", "Comments"]], ["This daredevil shot a flare gun into his own parachute at 7,000 feet above the ground in a stunt known as “canopy burn.”", "1K", ["725", "Comments"]], ["Sen. Bernie Sanders is warning that President Donald J. Trump is going \"down the path of authoritarianism\" by refusing \"to commit to a peaceful transition of power if he loses the election.\"", "22K", ["11K", "Comments"]], ["\"We don't want help from the government, because when the government comes in to help you, all they do is destroy everything that you do.” Manufacturers in Ohio aren’t swooning over Joe Biden’s promise to spend $400 billion dollars on made-in-America products.", "10K", ["3.8K", "Comments"]], ["\"I don't think that the Democrats are looking at increasing taxes on the middle class. I think they're looking at having billionaires pay more their fair share.\" On \"America's News HQ\" Saturday, Rep. Debbie Dingell compared former Vice President Joe Biden's tax plan to President Donald Trump's.", "3.2K", ["2.5K", "Comments"]], ["Former Vice President Joe Biden delivers remarks to the virtual US Conference of Mayors' Fall Leadership Meeting.", "25K", ["33K", "Comments"]], ["Denver Zoo gave tiger Nikita the most purr-fect 10th birthday celebration by hiding her favorite toys and treats inside wrapped boxes.", "3.3K", ["329", "Comments"]], ["The FBI has arrested the founder of a Black Lives Matter group in Atlanta on fraud and money laundering charges.", "145K", ["20K", "Comments"]], ["Arizona Republican Congressman Andy Biggs is continuing his push to oust Democratic House Speaker Nancy Pelosi using a short Twitter video calling on her to \"vacate the chair.\"", "46K", ["3.8K", "Comments"]], ["President Donald J. Trump will meet Saturday with evangelical faith leaders, hours before he is expected to announce that he is nominating Amy Coney Barrett for the Supreme Court.", "19K", ["3.7K", "Comments"]], ["The city of Rochester, N.Y., appointed its first female chief of police on Saturday, as part of an overhaul of the police force.", "2.4K", ["1.3K", "Comments"]], ["President Donald J. Trump and former Vice President Joe Biden face off in the first presidential debate, moderated by Fox News' Chris Wallace. Tune in for this must-see event Tuesday at 9p ET on Fox News Channel.", "5K", ["2.7K", "Comments"]], ["Franklin Graham leads a prayer march in Washington, D.C.", "301K", ["66K", "Comments"]], ["Rihanna is the latest celebrity to speak out against Kentucky Attorney General Daniel Cameron, who earlier this week warned the public against listening to celebrity's comments on the Breonna Taylor shooting indictment.", "14K", ["11K", "Comments"]], ["President Donald J. Trump is in Pennsylvania on Saturday for the second time in a week, in an effort to court some of the same rural and White working-class voters who supported him four years ago.", "23K", ["7K", "Comments"]], ["A fiery pro-Trump crowd gathered in a northern Chicago suburb Friday after an anti-Trump display critical of the president's handling of the coronavirus was placed at a busy intersection in the downtown area.", "52K", ["6.5K", "Comments"]], ["\"For Donald Trump, this is a moment of triumph. Three justices in three and a half years -- all of a similar intellect and all of a similar attitude about the Constitution.\"", "17K", ["2K", "Comments"]], ["Police in Oakland, Calif. arrested several protesters for assaulting officers Friday night as demonstrations calling for justice for Breonna Taylor turned violent.", "7.2K", ["3.2K", "Comments"]], ["This stunning photo of a mother deer and her two fawns was captured in a field of purple heather in Perthshire, Scotland.", "21K", ["1.1K", "Comments"]], ["TUNE IN: Watch live as President Donald J. Trump announces his pick for the nation’s highest court. Bret Baier and Shannon Bream host special coverage of the Supreme Court nomination, today at 4p ET on Fox News Channel.", "2.3K", ["887", "Comments"]], ["A mom in Wales went all out to bring some holiday cheer when she put up an elaborate Christmas display three months early.", "3.3K", ["383", "Comments"]], ["President Donald J. Trump is expected to announce his pick to fill the Supreme Court seat vacated by the death of Justice Ruth Bader Ginsburg this afternoon, and multiple sources tell Fox News that Amy Coney Barrett will be his nominee.", "26K", ["4.4K", "Comments"]], ["Democratic vice presidential nominee Kamala Harris is coming under increased scrutiny as the Supreme Court showdown comes to a tipping point ahead of November's election.", "6.9K", ["2.9K", "Comments"]], ["The Monarto Safari Park finally revealed the name of its 2-month-old southern white rhinoceros for World Rhino Day.", "6.8K", ["400", "Comments"]], ["White House Chief of Staff Mark Meadows criticized FBI Director Christopher Wray on Friday after the top law enforcement official told a congressional committee that the agency has seen no evidence of voter fraud ahead of the 2020 presidential election.", "4.1K", ["2.7K", "Comments"]], ["Sen. Thom Tillis, R-N.C., this week warned he has “grave concerns” over North Carolina’s mail-in voting process after several tentative changes were made, including allowing more time for ballots to arrive after Election Day in November.", "3.8K", ["1.9K", "Comments"]], ["Critics of Florida Gov. Ron DeSantis' order lifting restrictions on restaurant capacity despite the ongoing coronavirus pandemic \"are ignorant about Florida,\" the Republican told \"The Ingraham Angle\" Friday night.", "20K", ["5.6K", "Comments"]], ["President Donald J. Trump took his stump speech into a key \"purple\" state Friday, telling Virginians their Gov. Ralph Northam represents the kind of governance they'll get on a national scale if they vote for Democratic presidential nominee Joe Biden in November.", "10K", ["3.4K", "Comments"]], ["There’s nothing like a neat and clean work space to get the job done. The coronavirus pandemic has upended the traditional academic year for millions of American students, inspiring one crafty dad in California to make virtual learning a bit easier for local kids in need. To help start the school year off strong, the man has produced dozens of free desks for children in the community. https://fxn.ws/3csVF3n", "13K", ["552", "Comments"]], ["A man who was arrested for singing maskless at an outdoor worship service in Moscow, Idaho called the incident \"unbelievable\" when he spoke out on \"The Ingraham Angle\" Thursday night.", "19K", ["7.8K", "Comments"]], ["Florida's highest court on Thursday capped the amount a school board can be forced to pay the victims and families who filed lawsuits against the district at $300,000 following the 2018 Parkland mass shooting at a high school.", "1.6K", ["779", "Comments"]], ["Vladimir Putin called the recently approved Russian coronavirus vaccine \"reliable, safe, and effective\" and offered to supply the vaccine, which many scientists are skeptical of, to other nations.", "3.4K", ["2.2K", "Comments"]], ["President Donald J. Trump arrives at Joint Base Andrews after holding a campaign rally in Newport News, Virginia.", "27K", ["6.6K", "Comments"]], ["Vice President Mike Pence delivers remarks at a \"Make America Great Again\" rally in Newport News, Va.", "25K", ["6.5K", "Comments"]], ["President Trump departs Joint Base Andrews en route to Newport News, Va.", "20K", ["5.2K", "Comments"]], ["President Trump delivers remarks on \"Black Economic Empowerment: The Platinum Plan.\"", "34K", ["18K", "Comments"]], ["Air Force One arrives Dobbins Air Reserve Base in Atlanta, Georgia. (Courtesy: WAGA)", "27K", ["7.5K", "Comments"]], ["Departure ceremony at the U.S. Capitol for late Associate Supreme Court Justice Ruth Bader Ginsburg. Watch live coverage on Fox News Channel.", "3.8K", ["3.5K", "Comments"]], ["President Donald J. Trump participates in a \"Latinos for Trump\" roundtable in Doral, FL.", "34K", ["14K", "Comments"]], ["The family of Breonna Taylor responds to Wednesday's grand jury indictment at a news conference. (Credit: WDRB/WHAS)", "12K", ["24K", "Comments"]], ["President Donald J. Trump departs Joint Base Andrews aboard Air Force One en route to Charlotte, North Carolina.", "17K", ["4.2K", "Comments"]], ["Moments ago, President Trump spoke to reporters before departing for JBA.", "16K", ["7.9K", "Comments"]], ["White House press secretary Kayleigh McEnany holds a briefing.", "33K", ["15K", "Comments"]], ["House Speaker Nancy Pelosi holds her weekly press conference.", "23K", ["32K", "Comments"]], ["Late Associate Supreme Court Justice Ruth Bader Ginsburg lies in repose at the Supreme Court.", "5.3K", ["5.5K", "Comments"]], ["Aerial footage shows a group gathering in Los Angeles, California, following the announcement of one officer being indicted on criminal charges but not Breonna Taylor's death. https://fxn.ws/32TjcqW (Credit: KTTV)", "11K", ["10K", "Comments"]], ["President Trump holds a news conference at the White House.", "22K", ["15K", "Comments"]], ["EARLIER: President Trump participated in a discussion with State Attorneys General on protecting consumers from social media abuses.", "23K", ["8.4K", "Comments"]], ["Attorney General Daniel Cameron holds a press conference to announce the results of the grand jury proceedings in the investigation into the death of Breonna Taylor. (Courtesy: WHAS)", "6.4K", ["7.1K", "Comments"]], ["Democratic presidential nominee Joe Biden holds a Black Economic Summit in Charlotte, NC.", "23K", ["31K", "Comments"]], ["Late Associate Supreme Court Justice Ruth Bader Ginsburg lies in repose at the Supreme Court.", "8K", ["6.2K", "Comments"]], ["President Trump delivers remarks in Honor of Bay of Pigs Veterans.", "18K", ["6.3K", "Comments"]], ["House GOP leaders make remarks following their closed conference meeting.", "10K", ["5.2K", "Comments"]], ["A service is held for late Associate Supreme Court Justice Ruth Bader Ginsburg as she lies in repose at the Supreme Court.", "4.7K", ["4.8K", "Comments"]], ["House Speaker Nancy Pelosi and House Democratic committee chairs hold a briefing on a \"major reforms package.\"", "18K", ["32K", "Comments"]], ["President Trump holds a campaign rally at Pittsburgh International Airport.", "88K", ["41K", "Comments"]], ["Democratic vice presidential nominee, Sen. Kamala Harris participates in a Voter Mobilization event in Detroit, Michigan with Governor Gretchen Whitmer.", "15K", ["17K", "Comments"]], ["President Trump departs Joint Base Andrews en route to Pittsburgh International Airport.", "15K", ["5.9K", "Comments"]], ["Senate Majority Leader Mitch McConnell and other Republican senators make remarks.", "13K", ["7.9K", "Comments"]], ["White House press secretary Kayleigh McEnany holds a briefing.", "47K", ["20K", "Comments"]], ["President Donald J. Trump makes remarks to the United Nations General Assembly.", "14K", ["6.7K", "Comments"]], ["President Donald J. Trump arrives at Joint Base Andrews following his trip to Ohio.", "34K", ["7.2K", "Comments"]], ["President Donald J. Trump holds a \"Great American Comeback\" campaign rally in Swanton, Ohio.", "63K", ["27K", "Comments"]], ["Wisconsin Attorney General Josh Kaul and Kenosha County District Attorney Michael Gravely provide an update on the ongoing investigation into the August 23, 2020 officer-involved shooting in Kenosha, Wis. A decision on whether to charge the involved officer will not be announced today. (Credit: WITI)", "1.8K", ["2.5K", "Comments"]], ["President Donald J. Trump departs Joint Base Andrews for Dayton, Ohio on Air Force One.", "17K", ["4.6K", "Comments"]], ["Moments ago, President Donald J. Trump spoke to reporters before departing the White House en route to Joint Base Andrews.", "24K", ["8.3K", "Comments"]], ["Democratic presidential nominee Joe Biden holds an event in Manitowoc, Wisconsin.", "29K", ["55K", "Comments"]], ["Senate Majority Leader Mitch McConnell, Senator Chuck Schumer and others make remarks on the Senate floor.", "15K", ["19K", "Comments"]], ["Secretary of State Mike Pompeo, Treasury Secretary Steven Mnuchin, National Secretary Adviser Robert O’Brien and other U.S. officials deliver remarks on Iran snapback sanctions.", "12K", ["5.6K", "Comments"]], ["Ambassador Cherith Norman Chalet, acting deputy representative of the United States to the United Nations, delivers remarks at the UN General Assembly meeting.", "2.4K", ["2.6K", "Comments"]], ["Senator Chuck Schumer and Rep. Alexandria Ocasio-Cortez speak on the passing of Justice Ginsburg. (Credit: WNYW)", "25K", ["43K", "Comments"]], ["County Judge Mark Henry holds a press conference on Tropical Storm Beta in Galveston, Texas. (Credit: KRIV)", "2.9K", ["2.1K", "Comments"]], ["Democratic presidential nominee Joe Biden delivers remarks in Philadelphia.", "27K", ["44K", "Comments"]], ["President Donald J. Trump delivers remarks at a campaign rally in Fayetteville, N.C.", "57K", ["37K", "Comments"]], ["President Trump departs Joint Base Andrews en route to Fayetteville, N.C.", "23K", ["8K", "Comments"]], ["President Donald J. Trump arrives at Joint Base Andrews following his rally in Minnesota earlier Friday.", "22K", ["7.5K", "Comments"]], ["Ruth Bader Ginsburg, the enigmatic, longtime Supreme Court justice who attained near cult-like status among progressive circles, died at the age of 87 from complications surrounding metastatic pancreatic cancer. Ginsburg, who was appointed to the Supreme Court in 1993 by President Bill Clinton, was known for her soft-spoken demeanor that masked an analytical mind, a deep concern for the rights of every American and a commitment to upholding the Constitution.", "2.9K", ["1.7K", "Comments"]], ["President Trump holds a campaign rally in Bemidji, Minnesota.", "48K", ["28K", "Comments"]], ["Vice President Mike Pence delivers remarks at a Veterans for Trump event in Litchfield Park, Arizona.", "14K", ["5.2K", "Comments"]], ["Former Vice President Joe Biden delivers remarks in Duluth, Minn.", "19K", ["38K", "Comments"]], ["President Donald J. Trump arrives at Joint Base Andrews following a rally in Wisconsin.", "26K", ["6.7K", "Comments"]], ["President Trump holds a campaign rally in Mosinee, Wis.", "60K", ["37K", "Comments"]], ["President Donald J. Trump departs from Joint Base Andrews en route to Wisconsin.", "18K", ["6.7K", "Comments"]], ["Democratic vice presidential nominee Sen. Kamala Harris joins a community conversation with Latino leaders and elected officials.", "13K", ["14K", "Comments"]], ["EARLIER: President Donald J. Trump held an event in the Oval Office on preserving Native American artifacts.", "23K", ["5.8K", "Comments"]], ["Vice President Mike Pence delivers remarks at a \"Workers for Trump\" event in Zanesville, Ohio.", "27K", ["9.4K", "Comments"]], ["President Trump holds a news conference at the White House.", "26K", ["24K", "Comments"]], ["Federal Reserve Chair Jerome Powell delivers remarks following the U.S. central bank's final policy-setting meeting before the November presidential election. https://fxn.ws/3kgPfXI", "3.3K", ["4.6K", "Comments"]], ["Secretary of State Mike Pompeo and British Foreign Secretary Dominic Raab hold a press availability.", "7K", ["3.1K", "Comments"]], ["Senate Minority Leader Chuck Schumer speaks on the Senate floor.", "11K", ["13K", "Comments"]], ["Secretary of State Mike Pompeo participates in a bilateral meeting with His Highness Sheikh Abdullah bin Zayed Al Nahyan, Minister of Foreign Affairs of the United Arab Emirates.", "5.1K", ["1.1K", "Comments"]], ["Senate Majority Leader Mitch McConnell speaks on the Senate floor.", "11K", ["7.5K", "Comments"]], ["STORM TRACKER: Hurricane Sally made landfall early Wednesday morning near Gulf Shores, Ala., as a Category 2 storm packing maximum sustained winds of 105 mph and the potential for \"life-threatening\" flooding, according to the National Weather Service. https://fxn.ws/3mrobXx", "7K", ["4.1K", "Comments"]], ["President Donald J. Trump arrives at Joint Base Andrews.", "43K", ["9.2K", "Comments"]], ["Democratic nominee Joe Biden holds a Hispanic Heritage Month event in Kissimmee, Florida.", "31K", ["40K", "Comments"]], ["President Trump arrives in Philadelphia aboard Air Force One. (Courtesy: WTXF)", "24K", ["8.2K", "Comments"]], ["Senate Minority Leader Senator Chuck Schumer holds a press conference.", "10K", ["17K", "Comments"]], ["Former Vice President Joe Biden holds a veterans roundtable in Tampa, FL.", "32K", ["60K", "Comments"]], ["New Orleans Mayor LaToya Cantrell provides an update on Hurricane Sally.  Courtesy: WVUE", "1.6K", ["1.3K", "Comments"]], ["President Donald J. Trump and First Lady Melania Trump host the Abraham Accords Signing Ceremony at The White House.", "38K", ["14K", "Comments"]], ["House Minority Leader Kevin McCarthy, Rep. Steve Scalise and others make remarks.", "16K", ["9.7K", "Comments"]], ["Secretary of State Mike Pompeo discusses his recent trip to Central and Eastern Europe in a conversation with the Atlantic Council.", "4.5K", ["2.3K", "Comments"]], ["STORM WATCH: Hurricane Sally continues strengthening as it heads towards the Gulf Coast.  The storm is expected to strike on Tuesday. https://fxn.ws/2RsplDT", "8.6K", ["5.9K", "Comments"]], ["President Donald J. Trump arrives at Down Phoenix Sky Harbor International Airport. (Credit: KSAZ)", "21K", ["6.9K", "Comments"]], ["President Donald J. Trump delivers remarks and participates in a ceremony recognizing the California National Guard.", "28K", ["8.1K", "Comments"]], ["President Donald J. Trump receives a briefing on the deadly wildfires in California from Gov. Gavin Newsom and other officials in Sacramento.", "15K", ["9K", "Comments"]], ["Secretary of State Mike Pompeo, Treasury Secretary Steven Mnuchin and Commerce Secretary Wilbur Ross deliver remarks to launch the third annual US-Qatar Strategic Dialogue.", "5.6K", ["2.9K", "Comments"]], ["President Donald J. Trump hosts a \"Latinos for Trump\" roundtable in Las Vegas, Nevada.", "36K", ["21K", "Comments"]], ["Louisiana Gov. John Bel Edwards holds a news conference on the state's response to Tropical Storm Sally.", "2.2K", ["2.1K", "Comments"]], ["U.S. Senator Chuck Schumer and comedian Jerry Seinfeld announce a plan to seek federal relief for New York’s live events with the Save Our Stages Act. Courtesy: WNYW", "13K", ["12K", "Comments"]], ["President Donald J. Trump arrives in Las Vegas after holding a campaign rally in Minden, N.V., earlier Saturday evening. (Courtesy: KVVU)", "14K", ["6.8K", "Comments"]], ["President Trump delivers remarks at a rally in Minden, Nev.", "51K", ["39K", "Comments"]], ["President Donald J. Trump arrives in Reno, Nev., ahead of a campaign rally. (Courtesy: KRNV)", "46K", ["17K", "Comments"]], ["President Trump presents the Medal of Honor to Army SGM Thomas Payne.", "58K", ["11K", "Comments"]], ["Moments ago, President Trump spoke to the press after announcing that  Bahrain has agreed to normalize relations with Israel.", "57K", ["14K", "Comments"]], ["President Donald J. Trump speaks at the Flight 93 National Memorial Nineteenth Anniversary Observance.", "36K", ["7.5K", "Comments"]], ["President Donald J. Trump and first lady Melania Trump participate in the Flight 93 National Memorial Nineteenth Anniversary Observance.", "39K", ["8.6K", "Comments"]], ["The 9/11 Memorial Museum ceremony takes place.", "57K", ["12K", "Comments"]], ["The Tunnel to Towers Foundation holds a 9/11 remembrance ceremony.", "15K", ["2.6K", "Comments"]], ["The flag is unfurled at the Pentagon to commemorate the 19th anniversary of 9/11.", "50K", ["4.8K", "Comments"]], ["President Donald J. Trump holds a campaign event in Freeland, Michigan.", "97K", ["58K", "Comments"]], ["President Trump departs Joint Base Andrews en route to Freeland, Michigan.", "27K", ["9.4K", "Comments"]], ["Vice President Mike Pence delivers remarks to cadets at the Virginia Military Institute in Lexington.", "15K", ["4.3K", "Comments"]], ["President Donald J. Trump holds a news conference.", "30K", ["31K", "Comments"]], ["Democratic vice presidential nominee Kamala Harris participates in a community conversation with African-American leaders in Miami, FL.", "17K", ["21K", "Comments"]], ["House Speaker Nancy Pelosi holds her weekly press conference.", "27K", ["45K", "Comments"]], ["Senate Majority Leader Mitch McConnell, Senate Minority Leader Senator Chuck Schumer and Sen. John Thune make remarks on the Senate floor.", "11K", ["15K", "Comments"]], ["Vice President Mike Pence delivers remarks at a \"Workers for Trump\" event in Pittsburgh.", "16K", ["5.7K", "Comments"]], ["Senator Chuck Schumer, U.S. Senator Elizabeth Warren and U.S. Senator Bob Casey hold a press briefing in Washington, D.C.", "22K", ["37K", "Comments"]], ["Democratic presidential nominee Joe Biden delivers remarks at the United Auto Workers Region 1 headquarters in Warren, MI.", "47K", ["83K", "Comments"]], ["White House press secretary Kayleigh McEnany holds a briefing.", "45K", ["24K", "Comments"]], ["Vice President Mike Pence visits Cornerstone Ministries Church in Pennsylvania and participates in a roundtable discussion on the administration's pro-life agenda.", "8.3K", ["2.8K", "Comments"]], ["Attorney General William Barr provides an update on Operation Legend at a press conference in Chicago.", "23K", ["10K", "Comments"]], ["President Donald J. Trump delivers remarks at a campaign event in Winston-Salem, North Carolina.", "85K", ["39K", "Comments"]], ["President Donald J. Trump arrives at Palm Beach International Airport.", "28K", ["6.1K", "Comments"]], ["Chicago police hold a press briefing amid violence in the city over the weekend.  Courtesy: WFLD", "5.2K", ["5.8K", "Comments"]], ["President Donald J. Trump departs Joint Base Andrews en route to West Palm Beach, Florida.", "15K", ["5.2K", "Comments"]], ["President Donald J. Trump holds a news conference at the White House.", "38K", ["31K", "Comments"]], ["Vice President Mike Pence delivers remarks on jobs at Dairyland Power Cooperative in Wisconsin.", "30K", ["7.6K", "Comments"]], ["A pro-police, pro-veteran parade of boats is cruising along the Jersey Shore hoping to set a new world record. https://fxn.ws/2Grwcew", "154K", ["15K", "Comments"]], ["A pro-police, pro-veteran parade of boats is cruising along the Jersey Shore hoping to set a new world record.", "232K", ["31K", "Comments"]], ["EARLIER: President Donald J. Trump observes a signing ceremony and participates in a trilateral meeting with the President of the Republic of Serbia and the Prime Minister of the Republic of Kosovo.", "15K", ["5.6K", "Comments"]], ["President Trump arrives at Joint Base Andrews aboard Air Force One.", "35K", ["12K", "Comments"]], ["President Trump departs from Joint Base Andrews en route to Latrobe, Penn.", "16K", ["6.2K", "Comments"]], ["Former Vice President Joe Biden participates in a community meeting in Kenosha, Wis.", "28K", ["56K", "Comments"]], ["Vice President Mike Pence accepts the endorsement of the Southern States Police Benevolent Association and makes remarks in Raleigh, North Carolina.", "33K", ["3.6K", "Comments"]], ["Vice President Mike Pence participates in a roundtable at Gateway Women’s Care in Raleigh, N.C.", "11K", ["3.8K", "Comments"]], ["House Speaker Nancy Pelosi and local officials hold \"press event on day of action for children highlighting the impact of the pandemic on children and underscoring the urgent need for the Senate to pass the Heroes Act\" at Mission Education Center Elementary School in San Francisco.", "31K", ["47K", "Comments"]], ["President Donald J. Trump makes remarks after he arrived at Wilmington International Airport.", "22K", ["8.2K", "Comments"]], ["Democratic presidential nominee Joe Biden delivers remarks on reopening schools in Wilmington, Delaware.", "32K", ["73K", "Comments"]], ["President Donald J. Trump departs Joint Base Andrews aboard Air Force One en route to North Carolina.", "28K", ["7.2K", "Comments"]], ["Secretary of State Mike Pompeo delivers remarks at the Department of State.", "9.3K", ["4.7K", "Comments"]], ["President Trump arrives at Joint Base Andrews aboard Air Force One.", "30K", ["9K", "Comments"]], ["President Donald J. Trump attends a roundtable with law enforcement, other officials and small business owners in Kenosha, Wisconsin.", "40K", ["20K", "Comments"]], ["President Donald J. Trump tours the Emergency Operations Center at Mary D. Bradford High School in Kenosha, Wisconsin.", "26K", ["9.1K", "Comments"]], ["White House press secretary Kayleigh McEnany holds a briefing.", "46K", ["15K", "Comments"]], ["White House Senior Adviser Jared Kushner, US National Security Advisor Robert O’Brien and Israeli National Security Advisor Meir Ben-Shabbat deliver remarks at Abu Dhabi International Airport following the first-ever direct commercial passenger flight from Israel to the United Arab Emirates. https://fxn.ws/3jucvAX", "22K", ["5.6K", "Comments"]], ["Louisiana Governor John Bel Edwards holds a press briefing to address the state's response to Hurricane Laura.", "3.1K", ["2.4K", "Comments"]], ["President Donald J. Trump arrives at Joint Base Andrews.", "26K", ["8K", "Comments"]], ["President Trump participates in a roundtable discussion at an emergency operations center for Orange County, Texas.", "22K", ["8.5K", "Comments"]], ["President Trump receives a briefing on the damage from Hurricane Laura.", "30K", ["9.9K", "Comments"]], ["President Trump views damage from Hurricane Laura.", "57K", ["15K", "Comments"]], ["President Trump arrives at a relief effort distribution center.", "59K", ["10K", "Comments"]], ["President Donald Trump departs Joint Base Andrews en route to Manchester, New Hampshire on Air Force One.", "21K", ["6.1K", "Comments"]], ["Kenosha police hold presser amid unrest following shooting from Wisconsin. (Courtesy: WFLD)", "2.8K", ["6K", "Comments"]], ["Carl and Marsha Mueller — parents of aid worker Kayla Mueller, who was reported dead in 2015 after being abused by Islamic State militants — speak at the Republican National Convention. (Courtesy: RNC) https://fxn.ws/2QtoMcD", "14K", ["2.8K", "Comments"]], ["Sgt. Ann Dorn, widow of St. Louis police Capt. David Dorn, speaks at the Republican National Convention. (Courtesy: RNC) https://fxn.ws/2QtoMcD", "18K", ["3.1K", "Comments"]], ["UFC President Dana White addresses the Republican National Convention. (Courtesy: RNC) https://fxn.ws/2QtoMcD", "21K", ["4.1K", "Comments"]], ["Republican Rep. Jeff Van Drew, who switched parties when the House voted to impeach President Trump last year, addresses the Republican National Convention. (Courtesy: RNC) https://fxn.ws/2QtoMcD", "11K", ["2.2K", "Comments"]], ["House Minority Leader Kevin McCarthy makes remarks at the Republican National Convention. (Courtesy: RNC) https://fxn.ws/2QtoMcD", "4.2K", ["1.4K", "Comments"]], ["U.S. Senator Kamala Harris delivers remarks in Washington D.C.", "44K", ["76K", "Comments"]], ["Louisiana Gov. John Bel Edwards holds a media briefing on damage caused by Hurricane Laura. https://fxn.ws/3b40Gic", "2.4K", ["1.5K", "Comments"]], ["President Donald J. Trump and Vice President Mike Pence receive a briefing on Hurricane Laura from FEMA officials.", "18K", ["7.2K", "Comments"]], ["Texas Gov. Greg Abbott holds a press briefing amid Hurricane Laura.", "3.2K", ["1.4K", "Comments"]], ["Minneapolis Mayor Jacob Frey holds a press conference to discuss Wednesday night's unrest in the city. (Courtesy: KMSP)", "6.4K", ["10K", "Comments"]], ["Hurricane Laura battered the Louisiana and Texas coasts as it made landfall early Thursday as an \"extremely dangerous\" Category 4 storm before slowly weakening. Stay with Fox News Channel for continuing coverage. https://fxn.ws/3aYcQJi", "10K", ["3.9K", "Comments"]], ["Iowa Sen. Joni Ernst delivers remarks at the Republican National Convention. (Courtesy: RNC) https://fxn.ws/2YBopBh", "6.5K", ["1.1K", "Comments"]], ["Hall of Fame college football coach Lou Holtz speaks at the Republican National Convention. (Courtesy: RNC) https://fxn.ws/2YBopBh", "16K", ["2K", "Comments"]], ["South Dakota Gov. Kristi Noem makes a speech at the Republican National Convention. (Courtesy: RNC) https://fxn.ws/34BwWb5", "16K", ["2.5K", "Comments"]], ["Watch the third night of the Republican National Convention, featuring the theme \"Land of Heroes.\" Speakers include Vice President Mike Pence, Second Lady Karen Pence, outgoing counselor to the president Kellyanne Conway, White House Press Secretary Kayleigh McEnany, Rep. Dan Crenshaw and more. #Democracy2020 Tune in to Fox News Channel for complete coverage, analysis and reaction.", "36K", ["45K", "Comments"]], ["An intensifying Hurricane Laura grew stronger by the hour Wednesday over the Gulf of Mexico as forecasters said the system strengthened into an \"extremely dangerous\" Category 4 storm, spawning a storm surge that's already swamped parts of the Gulf Coast. https://fxn.ws/2D755UY Stay with Fox News Channel all night for continuing coverage.", "27K", ["12K", "Comments"]], ["Law enforcement and officials in Kenosha, Wisconsin hold a press briefing. Courtesy: WITI", "11K", ["13K", "Comments"]], ["Louisiana Gov. John Bel Edwards holds a media briefing about the state's activity related to Hurricane Laura.", "2.4K", ["2.2K", "Comments"]], ["An intensifying Hurricane Laura is growing stronger by the hour Wednesday over the Gulf of Mexico as forecasters warn the powerful system will be a \"catastrophic” Category 4 storm as it's already sending its storm surge along parts of the Gulf Coast. https://fxn.ws/2G02Xzl", "27K", ["10K", "Comments"]], ["Secretary of State Mike Pompeo delivers a speech during the Republican National Convention. Tune in to Fox News Channel for live coverage. (Courtesy: RNC) https://fxn.ws/3huTUUW", "11K", ["1.8K", "Comments"]], ["Eric Trump, executive vice president of the Trump Organization and President Donald Trump's son, delivers a speech at the Republican National Convention. Tune in to Fox News Channel for live coverage. (Courtesy: RNC) https://fxn.ws/3huTUUW", "24K", ["6.5K", "Comments"]], ["Tiffany Trump, President Donald Trump’s daughter, speaks at the Republican National Convention. (Courtesy: RNC) https://fxn.ws/3huTUUW", "41K", ["11K", "Comments"]], ["Former Florida Attorney General Pam Bondi speaks at the Republican National Convention. https://fxn.ws/3huTUUW", "19K", ["3.6K", "Comments"]], ["Former Planned Parenthood clinic director-turned-pro-life advocate Abby Johnson makes remarks at the Republican National Convention. (Courtesy: RNC) https://fxn.ws/3huTUUW", "62K", ["8.2K", "Comments"]], ["White House economic adviser Larry Kudlow makes remarks at the Republican National Convention. (Courtesy: RNC)  https://fxn.ws/3huTUUW", "6.2K", ["1.8K", "Comments"]], ["Sen. Rand Paul speaks during the second night of the Republican National Convention. (Courtesy: RNC)  https://fxn.ws/3huTUUW", "17K", ["3.2K", "Comments"]], ["President Donald Trump issues a full pardon to bank robber-turned activist Jon Ponder. Ponder founded the nonprofit Hope For Prisoners. https://fxn.ws/2EAb4C5 (Courtesy: RNC)", "19K", ["4.4K", "Comments"]], ["Watch the second night of the Republican National Convention, featuring the theme \"Land of Opportunity.\" Speakers include First Lady Melania Trump, Secretary of State Mike Pompeo, Sen. Rand Paul, Eric Trump and more. #Democracy2020 Tune in to Fox News Channel for complete coverage, analysis and reaction.", "43K", ["58K", "Comments"]], ["Heisman Trophy winner and football star Herschel Walker speaks at the Republican National Convention. (Courtesy: RNC) LIVE BLOG: https://fxn.ws/2CWyDVd", "69K", ["7K", "Comments"]], ["Watch the first night of the Republican National Convention, featuring the theme  \"Land of Promise.\" Speakers include Sen. Tim Scott, former U.S. Ambassador to the United Nations Nikki Haley, House Republican Whip Steve Scalise, Donald Trump Jr. and more. #Democracy2020 (Courtesy: RNC) Tune in to Fox News Channel for complete coverage, analysis and reaction. https://fxn.ws/2CWyDVd", "89K", ["62K", "Comments"]], ["President Donald J. Trump delivers remarks on Farmers to Families Food Box Program Distribution in Mills River, North Carolina.", "22K", ["8.1K", "Comments"]], ["President Donald J. Trump participates in a tour of Flavor First Growers and Packers in Mills River, North Carolina.", "29K", ["8.2K", "Comments"]], ["President Donald J. Trump arrives via Marine One in Fletcher, North Carolina.", "30K", ["12K", "Comments"]], ["US Postal Service Postmaster General Louis DeJoy and Postal Service Board of Governors Chair Robert Duncan resume their testimony before the House Oversight & Reform Committee regarding changes at the postal service under DeJoy's leadership.", "7.3K", ["15K", "Comments"]], ["US Postal Service Postmaster General Louis DeJoy and Postal Service Board of Governors Chair Robert Duncan testify before the House Oversight & Reform Committee regarding changes at the postal service under DeJoy's leadership.", "5.3K", ["11K", "Comments"]], ["President Donald J. Trump holds a press briefing.", "40K", ["22K", "Comments"]], ["BREAKING NEWS: Tropical Storm Marco, which is making its way toward Louisiana, has become a hurricane, according to the National Hurricane Center. https://fxn.ws/31m5XOH", "18K", ["6.7K", "Comments"]], ["The House votes on a $25 billion funding bill for the U.S. Postal Service. https://fxn.ws/3hsgtK4", "21K", ["19K", "Comments"]], ["President Trump delivers remarks at the conclusion of the American Workforce Policy Advisory Board Meeting and signs an executive order on skills-based hiring.", "25K", ["13K", "Comments"]], ["Vice President Mike Pence leads a White House Coronavirus Task Force briefing.", "8.8K", ["12K", "Comments"]], ["House Speaker Nancy Pelosi and House Democrats hold a press event commemorating the seventh anniversary of Shelby v. Holder.", "10K", ["14K", "Comments"]], ["Fmr Vice President Joe Biden delivers remarks on his plan to make quality, affordable health care available to every American.", "26K", ["41K", "Comments"]], ["President Donald J. Trump arrives in Green Bay, Wisconsin.  Courtesy: WLUK", "15K", ["4.9K", "Comments"]], ["President Donald J. Trump and First Lady Melania Trump participate in a wreath-laying ceremony at the Korean War Veterans Memorial.", "31K", ["10K", "Comments"]], ["Senate Majority Leader Mitch McConnell makes remarks on the Senate floor.", "6.4K", ["5.7K", "Comments"]], ["President Donald J. Trump participates in a joint press conference with Polish President Andrzej Duda.", "15K", ["10K", "Comments"]], ["MOMENTS AGO: President Donald J. Trump participates in a bilateral meeting with Polish President Andrzej Duda.", "9.5K", ["3.6K", "Comments"]], ["The House Judiciary Committee holds a hearing on \"Oversight of the Department of Justice: Political Interference and Threats to Prosecutorial Independence.\"", "6.6K", ["13K", "Comments"]], ["New York Governor Andrew Cuomo, New Jersey Gov. Phil Murphy and Connecticut Gov. Ned Lamont make remarks. https://fxn.ws/3doGveg", "3.8K", ["6K", "Comments"]], ["Secretary of State Mike Pompeo holds a press briefing.", "6.5K", ["2.3K", "Comments"]], ["President Donald J. Trump arrives at Joint Base Andrews after visiting Arizona earlier Tuesday to mark the construction of the U.S.-Mexico border wall and appearing at a \"Students for Trump\" event in Phoenix.", "14K", ["7.2K", "Comments"]], ["President Donald J. Trump arrives in Phoenix, Arizona. (Credit: KSAZ)", "17K", ["7.8K", "Comments"]], ["Senate Democratic leaders hold a press conference.", "11K", ["15K", "Comments"]], ["A funeral is held for Rayshard Brooks in Atlanta.", "4.2K", ["5.5K", "Comments"]], ["Senate Majority Leader Mitch McConnell and Senate Minority Leader Senator Chuck Schumer make remarks on the Senate floor.", "5.5K", ["6.4K", "Comments"]], ["New York City Mayor Bill de Blasio holds a press briefing Monday.", "5.5K", ["6.3K", "Comments"]], ["Senate Minority Leader Chuck Schumer holds a press conference Sunday on the firing of Geoffrey Berman, the U.S. Attorney for the Southern District of New York. Courtesy: WNYW", "11K", ["14K", "Comments"]], ["President Trump departs Tulsa, Oklahoma, after his campaign rally. (Courtesy: KOKI)", "43K", ["13K", "Comments"]], ["President Trump arrives in Tulsa, Oklahoma, for a rally Saturday night. (Courtesy: KOKI) Tune in to Fox News Channel tonight at 8p ET for live coverage of President Trump’s rally.", "42K", ["16K", "Comments"]], ["President Trump departs for Tulsa, Oklahoma, for Saturday night’s rally.", "55K", ["19K", "Comments"]], ["Florida Gov. Ron DeSantis holds a press conference regarding COVID-19 cases in the state.", "5.9K", ["5.1K", "Comments"]], ["Rev. Al Sharpton holds a press conference in Tulsa, Oklahoma.", "36K", ["54K", "Comments"]], ["A Juneteenth rally takes place in Oakland, California. (Courtesy: KTVU)", "5.2K", ["7.7K", "Comments"]], ["White House Press Secretary Kayleigh McEnany holds a press briefing.", "12K", ["12K", "Comments"]], ["New York Governor Andrew Cuomo holds a daily briefing on the state's COVID-19 pandemic response in Albany, NY.", "4.9K", ["6.1K", "Comments"]], ["Vice President Mike Pence delivers remarks following a tour at Chardam Gear Company in Sterling Heights, MI", "9.1K", ["5.3K", "Comments"]], ["House Speaker Nancy Pelosi and House Democrats unveil the Moving Forward Act.", "16K", ["17K", "Comments"]], ["New York Gov. Andrew Cuomo holds a press briefing.", "5.5K", ["8.4K", "Comments"]], ["The House Judiciary Committee continues its virtual markup of the George Floyd Justice in Policing Act.", "5.6K", ["13K", "Comments"]], ["BREAKING UPDATE: Garrett Rolfe, the Atlanta police officer fired after the killing of Rayshard Brooks last week, now faces charges including felony murder, which could potentially lead to the death penalty. https://fxn.ws/2YIpvu1 Fulton County District Attorney Paul L. Howard, Jr. announces his charging decision in the fatal police shooting of 27-year-old Rayshard Brooks in Atlanta.", "27K", ["39K", "Comments"]], ["The House Judiciary Committee continues its virtual markup of the George Floyd Justice in Policing Act.", "4.2K", ["9.2K", "Comments"]], ["Vice President Mike Pence delivers remarks to Winnebago Industries employees on opening up the United States economy in Forest City, Iowa.", "18K", ["5.2K", "Comments"]], ["Senate Minority Leader Chuck Schumer has a press conference.", "7.6K", ["8.2K", "Comments"]], ["Senator Chuck Schumer makes remarks from the Senate floor.", "6.2K", ["6.4K", "Comments"]], ["Senator Mitch McConnell makes remarks.", "3.7K", ["2.5K", "Comments"]], ["New York City Mayor Bill de Blasio holds a press briefing Tuesday.", "4.2K", ["5.7K", "Comments"]], ["Atlanta Mayor Keisha Lance Bottoms holds a press conference. (Courtesy: WAGA)", "6.7K", ["11K", "Comments"]], ["Moments ago, President Donald Trump, Vice President Mike Pence and administration officials took questions from the press after a Fighting for America's Seniors roundtable at the White House.", "28K", ["18K", "Comments"]], ["Senate Majority Leader Mitch McConnell and Senate Minority Leader Chuck Schumer speak on the Senate floor.", "6.8K", ["9.3K", "Comments"]], ["New York Gov. Andrew Cuomo holds a press briefing.", "4.2K", ["5.6K", "Comments"]], ["New York Governor Andrew Cuomo holds a briefing.", "8K", ["11K", "Comments"]], ["The attorneys for the family of an Atlanta man fatally shot by police hold a press conference. https://fxn.ws/2BWiaPN (Courtesy: WGCL)", "8.7K", ["22K", "Comments"]], ["Vice President Mike Pence participates in a listening session with faith and community leaders at Covenant Church in Pittsburgh, PA.", "16K", ["9K", "Comments"]], ["President Donald J. Trump arrives in Dallas, Texas.  Courtesy: KDFW", "29K", ["13K", "Comments"]], ["Chicago Mayor Lori Lightfoot and other officials make an announcement.  Courtesy: WFLD", "10K", ["21K", "Comments"]], ["President Donald J. Trump departs Joint Base Andrews on Air Force One en route to Dallas.", "23K", ["10K", "Comments"]], ["Former Vice President Joe Biden participates in a roundtable with community members in Philadelphia.", "11K", ["20K", "Comments"]], ["House Minority Leader Kevin McCarthy makes remarks at his weekly press conference.", "6.2K", ["4.3K", "Comments"]], ["Secretary of State Mike Pompeo, alongside Defense Secretary Mark Esper, Attorney General Bill Barr and National Security Adviser Robert O’Brien, hold a press conference at the State Department.", "9.4K", ["5.9K", "Comments"]], ["Moments ago, President Trump spoke to the press.", "59K", ["32K", "Comments"]], ["The House Judiciary Committee holds a hearing to examine racial profiling, police brutality and lost trust between police departments and communities.", "6.8K", ["13K", "Comments"]], ["Secretary of State Mike Pompeo holds a press availability and delivers remarks on the Release of the 2019 International Religious Freedom Report, at the Department of State.", "8.9K", ["5.2K", "Comments"]], ["New York City Mayor Bill de Blasio holds a press briefing on Wednesday.", "3.5K", ["4.9K", "Comments"]], ["A funeral service for George Floyd is held at the Fountain of Praise Church in Houston, Texas. Watch live coverage on Fox News Channel.", "8.9K", ["24K", "Comments"]], ["New York Governor Andrew Cuomo holds a press briefing on Tuesday.", "4.8K", ["7.1K", "Comments"]], ["White House press secretary Kayleigh McEnany makes remarks.", "26K", ["14K", "Comments"]], ["New York Governor Andrew Cuomo holds a press conference.", "5.4K", ["7.2K", "Comments"]], ["Senate and House Democrats hold a press conference to “unveil legislation to end police brutality, hold police accountable, improve transparency in policing and create meaningful, structural change that safeguards every American’s right to safety and equal justice.”", "15K", ["27K", "Comments"]], ["New York City Mayor Bill de Blasio holds a press briefing on Monday.", "5K", ["6.4K", "Comments"]], ["George Floyd's family holds a memorial service in Raeford, North Carolina. https://fxn.ws/30ieTV8 Watch live coverage on Fox News Channel.", "7.5K", ["14K", "Comments"]], ["Protesters gather in Chicago to call for justice for George Floyd and an end to police brutality. (Courtesy: WFLD)", "16K", ["17K", "Comments"]], ["President Donald J. Trump arrives at Joint Base Andrews.", "18K", ["6K", "Comments"]], ["President Trump takes part in a roundtable on supporting America's commercial fisherman in Bangor, Maine.", "24K", ["13K", "Comments"]], ["Air Force 1 arrives in Bangor, Maine. (Courtesy: WGME)", "20K", ["7.8K", "Comments"]], ["New York Gov. Andrew Cuomo holds a press briefing.", "6K", ["8.2K", "Comments"]], ["At a news conference in the Rose Garden on Friday, President Trump declared Friday that jobs are coming back on the heels of a surprise labor report that may indicate the start of an economic recovery amid historic job losses, as he also upped his demands on states to lift lingering coronavirus-related lockdowns. https://fxn.ws/2Y3aFhv", "66K", ["43K", "Comments"]], ["New York City Mayor Bill de Blasio holds a press briefing.", "6K", ["9.1K", "Comments"]], ["George Floyd's family holds a memorial service in Minneapolis, Minnesota. https://fxn.ws/2MwkTkZ Watch live coverage on Fox News Channel.", "17K", ["11K", "Comments"]], ["George Floyd's family holds a memorial service in Minneapolis, Minnesota. https://fxn.ws/2MwkTkZ Watch live coverage on Fox News Channel.", "12K", ["14K", "Comments"]], ["House Speaker Nancy Pelosi holds her weekly press conference.", "20K", ["27K", "Comments"]], ["Attorney General William Barr, FBI Director Christopher Wray and Justice Department officials hold a press briefing.", "17K", ["14K", "Comments"]], ["Washington Gov. Jay Inslee holds a press briefing.", "1.4K", ["2.7K", "Comments"]], ["Governor Tim Walz holds a press conference regarding the protests in Minneapolis over the death of George Floyd. (Courtesy: KMSP)", "1.3K", ["3K", "Comments"]], ["Rev. Al Sharpton and Attorney Benjamin Crump hold a press conference with one of George Floyd's sons, and the mother of Eric Garner to react to the announcement that the other three officers will be charged in Floyd's death, and the upgraded charges against Derek Chauvin. (Courtesy: KMSP)", "6.3K", ["11K", "Comments"]], ["New York Police Commissioner Dermot Shea holds a media availability with Terrence Floyd, the brother of George Floyd, and Reverend Kevin McCall in Brooklyn, N.Y.", "2.2K", ["2.6K", "Comments"]], ["Civil rights attorney Ben Crump and George Floyd's son hold a press briefing.", "4.1K", ["5.8K", "Comments"]], ["Former Deputy Attorney General Rod Rosenstein testifies before the Senate Judiciary Committee as part of its investigation into the origins of the Russia probe. https://fxn.ws/30guBQT", "7.2K", ["16K", "Comments"]], ["Secretary of Defense Mark Esper holds a press briefing.", "4.1K", ["4K", "Comments"]], ["Minnesota Governor Tim Walz provides an update on the response to public safety concerns in the Twin Cities. (Courtesy: KMSP)", "1.7K", ["3.4K", "Comments"]], ["President Donald J. Trump and First Lady Melania Trump visit the Saint John Paul II National Shrine in Washington, D.C.", "52K", ["15K", "Comments"]], ["House Speaker Nancy Pelosi has a bill enrollment ceremony.", "12K", ["12K", "Comments"]], ["President Donald J. Trump pays his respects at St. John's Church amid nationwide protests. https://fxn.ws/3eKo8l7", "127K", ["49K", "Comments"]], ["President Donald J. Trump delivers remarks in the Rose Garden amid nationwide protests over the death of George Floyd. Floyd died in police custody on Memorial Day in Minneapolis.", "110K", ["42K", "Comments"]], ["Oregon Governor Kate Brown holds a press conference to update the state's response to protests and provide information on curfews. (Courtesy: KPTV)", "2.2K", ["4.6K", "Comments"]], ["A press conference is held regarding the Spelman and Morehouse students who were arrested during protests in Atlanta. (Courtesy: WAGA) https://fxn.ws/2MgODlQ", "3K", ["5.2K", "Comments"]], ["District of Columbia Mayor Muriel Bowser holds a press conference to provide updates on the curfew and response to the ongoing protests. (Courtesy: WTTG)", "1.2K", ["2.2K", "Comments"]], ["California Gov. Gavin Newsom provides an update on demonstrations across the state and the state’s response to the COVID-19 pandemic.", "2K", ["4K", "Comments"]], ["Philadelphia Mayor Jim Kenney and other city officials provide updates on the response to the ongoing protests. (Courtesy: WTXF)", "1.5K", ["3.1K", "Comments"]], ["The International Space Station Expedition 63 crew holds a news conference with Commander Chris Cassidy and astronauts Bob Behnken & Doug Hurley of NASA.", "18K", ["1.9K", "Comments"]], ["New York Reps. Yvette Clarke and Hakeem Jeffries hold a press conference on police brutality, including an alleged assault on a peaceful protester by an NYPD police officer in New York City. (Courtesy: WNYW)", "4.9K", ["9.5K", "Comments"]], ["Demonstrators across the country took to the streets to protest the death of Minneapolis man George Floyd, who died in police custody earlier this week.", "14K", ["12K", "Comments"]], ["Minnesota Governor Tim Walz and other officials provide an update on protests.", "2.4K", ["5K", "Comments"]], ["Minnesota Governor Tim Walz gives a press briefing amid protests over the death of George Floyd who died on Memorial Day in police custody in Minneapolis. (Courtesy: KMSP)", "2.3K", ["4.7K", "Comments"]], ["Officials in Philadelphia hold a press conference regarding protests and curfews following the death of George Floyd in Minneapolis while in police custody. (Courtesy: WTXF)", "2.6K", ["4.2K", "Comments"]], ["Illinois Gov. Pritzker and Chicago Mayor Lori Lightfoot hold a press conference.", "2.4K", ["3.9K", "Comments"]], ["Philadelphia Mayor Jim Kenney holds a press conference on protests in the city on Saturday night over the death of George Floyd.", "2.4K", ["3.6K", "Comments"]], ["New York Governor Andrew Cuomo holds a press conference. Tune in to Fox News Channel for live coverage.", "3.1K", ["5.4K", "Comments"]], ["The SpaceX/DM-2 Crew Dragon and NASA astronauts Doug Hurley and Bob Behnken are docking Sunday morning to the International Space Station. Courtesy: NASA TV", "21K", ["2.8K", "Comments"]], ["New York City Mayor Bill de Blasio holds a press conference on protests in the city over the death of George Floyd, an unarmed black man in Minneapolis killed by a white police officer.", "3K", ["6.1K", "Comments"]], ["Demonstrators across the country took to the streets to protest the death of Minneapolis man George Floyd, who died in police custody earlier this week.", "14K", ["12K", "Comments"]], ["New York City Mayor Bill de Blasio provides an update on the protests in the city.", "4.3K", ["5.8K", "Comments"]], ["Minnesota Governor Tim Walz and other officials provide an update on the protests in Minneapolis.   (Courtesy: KMSP)", "1.3K", ["2.2K", "Comments"]], ["Chicago Mayor Lori Lightfoot and the Chicago Police Department hold a press conference on protests in the city over the death of Minneapolis man George Floyd. (Courtesy: WFLD)", "5.2K", ["7.8K", "Comments"]], ["Seattle Mayor Jenny Durkan and other officials hold a press conference to address demonstrations in the city.", "858", ["1.4K", "Comments"]], ["Minnesota Gov. Tim Walz holds a press conference on the state's response to protests stemming from the death of George Floyd. Courtesy: WCCO", "2.3K", ["4K", "Comments"]], ["The Atlanta Police Department holds a press conference on protests in the city over the death of Minneapolis man George Floyd.  (Courtesy: WAGA)", "5.8K", ["6.4K", "Comments"]], ["SpaceX's Demo-2 mission takes off in Cape Canaveral, Fla., for the first launch from U.S. soil since 2011. The historic launch marks the first time a private company, rather than a national government, sends astronauts into orbit.  (Courtesy: NASA TV)", "51K", ["15K", "Comments"]], ["President Donald J. Trump arrives aboard Air Force One at the Kennedy Space Center in Cape Canaveral, Florida. Courtesy: WOFL", "13K", ["3.5K", "Comments"]], ["Minnesota Governor Tim Walz and faith leaders hold a press briefing on the protests.", "2.8K", ["6.4K", "Comments"]], ["President Donald J. Trump and First Lady Melania Trump depart Washington, D.C. en route to the Kennedy Space Center in Florida.", "13K", ["6.4K", "Comments"]], ["Minnesota Gov. Tim Walz and Minneapolis Mayor Jacob Frey hold a press conference to give updates on the situation in the Twin Cities. https://fxn.ws/2XLIu6m Courtesy: KMSP", "3.4K", ["9.4K", "Comments"]], ["Demonstrators across the country took to the streets to protest the death of Minneapolis man George Floyd, who died in police custody earlier this week.", "14K", ["12K", "Comments"]], ["President Donald J. Trump participates in a roundtable discussion with industry executives.", "7.1K", ["7.9K", "Comments"]], ["Former Vice President Joe Biden delivers remarks on Minnesota. Courtesy: Biden for President", "8.7K", ["11K", "Comments"]], ["St. Paul Mayor Melvin Carter and the St. Paul Police Department hold a press conference on the looting protests in the city. (Courtesy: WCCO)", "2.3K", ["3.4K", "Comments"]], ["Moments ago, President Trump spoke about an executive order on social media that seeks to curb legal protections for the industry. https://fxn.ws/2XDbSMi", "36K", ["20K", "Comments"]], ["President Donald J. Trump, First Lady Melania Trump and Vice President Mike Pence receive a SpaceX Demonstration Mission 2 launch briefing. UPDATE: SpaceX and NASA’s historic launch was scrubbed Wednesday as a result of weather conditions. https://fxn.ws/2XBMkiv", "11K", ["3.5K", "Comments"]], ["Speaker Nancy Pelosi and House Democrats hold a press conference to discuss COVID-19 testing in Washington, D.C.", "12K", ["23K", "Comments"]], ["New York Governor Andrew Cuomo holds a press conference on Wednesday in Washington D.C. following a meeting at the White House.", "3.3K", ["7K", "Comments"]], ["UPDATE: SpaceX and NASA’s historic launch was scrubbed Wednesday as a result of weather conditions. (Credit: NASA TV) https://fxn.ws/2ZGQwAc", "26K", ["12K", "Comments"]], ["President Donald J. Trump and First Lady Melania Trump depart Joint Base Andrews en route to Kennedy Space Center.", "11K", ["4.4K", "Comments"]], ["House GOP leadership holds a press conference on Wednesday after filing a lawsuit challenging the constitutionality of the House Democrat plan to vote by proxy. https://fxn.ws/3cbpPGq", "12K", ["7K", "Comments"]], ["President Donald J. Trump delivers remarks on protecting at-risk seniors with diabetes from coronavirus at the White House Rose Garden.", "15K", ["12K", "Comments"]], ["White House press secretary Kayleigh McEnany holds a briefing.", "34K", ["14K", "Comments"]], ["Watch a special Memorial Day concert with country music star John Rich, featuring Gretchen Wilson and Lee Greenwood. #AmericaTogether", "5.1K", ["3.2K", "Comments"]], ["Americans nationwide paid their respects this Memorial Day to the men and women who gave the ultimate sacrifice fighting for our great country.", "9.1K", ["429", "Comments"]], ["President Donald J. Trump and first lady Melania Trump attend a Memorial Day ceremony at Fort McHenry.", "96K", ["16K", "Comments"]], ["New York Gov. Andrew Cuomo holds a press briefing.", "3.6K", ["5.7K", "Comments"]], ["New York Governor Andrew Cuomo holds a briefing on the state's COVID-19 response.", "3.8K", ["6.2K", "Comments"]], ["President Donald Trump delivers remarks at the Ford motor plant in Michigan.", "43K", ["18K", "Comments"]], ["Dana Perino is live now with storytime! Join her every weekday at 3:30p ET right here on Facebook as she reads some of her favorite children's books.", "777", ["471", "Comments"]], ["President Donald J. Trump participates in a listening session with African-American leaders in Michigan.", "13K", ["11K", "Comments"]], ["New York Governor Andrew Cuomo holds a briefing Thursday to provide an update on the coronavirus pandemic.", "2.9K", ["5K", "Comments"]], ["White House Press Secretary Kayleigh McEnany holds a press briefing.", "16K", ["9.3K", "Comments"]], ["Dana Perino is live now with storytime! Join her every weekday at 3:30p ET right here on Facebook as she reads some of her favorite children's books.", "1K", ["445", "Comments"]], ["New Jersey Governor Phil Murphy provides an update on the state's response to the coronavirus pandemic.", "1.5K", ["3K", "Comments"]], ["New York Governor Andrew Cuomo holds a news conference Wednesday to provide an update on the coronavirus pandemic.", "2.8K", ["5.7K", "Comments"]], ["Senate Minority Leader Chuck Schumer speaks on the Senate floor Wednesday morning.", "5.7K", ["7.2K", "Comments"]], ["United States Secretary of State Mike Pompeo makes remarks.", "3.7K", ["2.7K", "Comments"]], ["\"I see how much [my kids] miss their friends and their teachers, and the administrators at their school. And I'm also thinking — and we pray for this every night — about the less fortunate among us. They don't have any help, they don't have the luxury of venturing into nature every day, perhaps. And what about the frontline workers? They can't find childcare or someone to supplement the teaching of their kids.\" — Laura Ingraham", "10K", ["2.5K", "Comments"]], ["Dana Perino is live now with storytime! Join her every weekday at 3:30p ET right here on Facebook as she reads some of her favorite children's books.", "1.7K", ["480", "Comments"]], ["Senator Chuck Schumer has a press conference.", "10K", ["13K", "Comments"]], ["President Trump speaks to the press after a meeting with the Senate GOP.", "16K", ["7.3K", "Comments"]], ["House Minority Leader Kevin McCarthy holds a press conference with Republican Congressmen-elect Mike Garcia and Tom Tiffany.", "8.8K", ["4.6K", "Comments"]], ["New York Governor Andrew Cuomo provides an update on the state's response to the coronavirus pandemic.", "5.6K", ["8.5K", "Comments"]], ["House Speaker Nancy Pelosi presides over the ceremonial swearing in of new House members Rep. Mike Garcia (R-Calif.) and Rep. Tom Tiffany (R-Wis.).", "18K", ["13K", "Comments"]], ["Senate Minority Leader Chuck Schumer speaks on the Senate floor.", "8.7K", ["9.1K", "Comments"]], ["Vice President Mike Pence makes remarks at the National Space Council meeting.", "5.5K", ["1.8K", "Comments"]], ["Senate Majority Leader Mitch McConnell speaks on the Senate floor.", "4.3K", ["3.3K", "Comments"]], ["President Donald J. Trump and the coronavirus task force hold a press conference.", "33K", ["25K", "Comments"]], ["Connecticut Gov. Ned Lamont holds a coronavirus briefing.", "2.4K", ["3.5K", "Comments"]], ["Dana Perino is live now with storytime! Join her every weekday at 3:30p ET right here on Facebook as she reads some of her favorite children's books.", "1.7K", ["882", "Comments"]], ["New Jersey Governor Phil Murphy holds a press conference.", "1.4K", ["1.5K", "Comments"]], ["Massachusetts Gov. Charlie Baker holds a briefing on coronavirus in Boston, MA.", "1.4K", ["1.6K", "Comments"]], ["New York Governor Andrew Cuomo holds a briefing on coronavirus in Albany, NY.", "3.9K", ["6.6K", "Comments"]], ["Acting Secretary of the Navy Thomas B. Modly, Commandant of the Marine Corps General David H. Berger and Sergeant Major of the Marine Corps Troy E. Black hold a briefing on the COVID-19 response.", "5.6K", ["2.7K", "Comments"]], ["Senate Minority Leader Senator Chuck Schumer  speaks following the Senate's vote on the coronavirus stimulus bill.", "10K", ["11K", "Comments"]], ["Senators vote on the coronavirus stimulus bill. https://fxn.ws/39lf575", "14K", ["26K", "Comments"]], ["New York City Mayor Bill de Blasio holds a press conference.", "2.7K", ["3.5K", "Comments"]], ["Arizona Gov. Doug Ducey and Arizona Department of Health Services Director Dr. Cara Christ provide an update on the coronavirus.", "2K", ["1.8K", "Comments"]], ["President Donald J. Trump and the coronavirus task force hold a press briefing.", "17K", ["15K", "Comments"]], ["Massachusetts Gov. Charlie Baker holds a briefing on the coronavirus.", "1.2K", ["1.2K", "Comments"]], ["Pennsylvania Gov. Tom Wolf and Secretary of Health Dr. Rachel Levine  hold a briefing on the coronavirus.", "1.9K", ["3.8K", "Comments"]], ["Ohio governor Mike DeWine provides an update on the state's response to the coronavirus pandemic.", "1K", ["1.4K", "Comments"]], ["Senate Majority Leader Mitch McConnell speaks on the Senate floor.", "11K", ["6.7K", "Comments"]], ["Secretary of State Mike Pompeo holds a briefing from the State Department.", "6.6K", ["3K", "Comments"]], ["Florida Gov. Ron DeSantis holds a press briefing.", "2.7K", ["3.5K", "Comments"]], ["Pentagon officials hold a press briefing to provide a COVID-19 update.", "6.4K", ["6.1K", "Comments"]], ["Senators meet to discuss the Congressional response to the COVID-19 pandemic from the Senate floor.", "7.7K", ["11K", "Comments"]], ["California Governor Gavin Newsom holds a press conference.", "2.9K", ["4.2K", "Comments"]], ["President Donald J. Trump and the coronavirus task force hold a press conference.", "21K", ["12K", "Comments"]], ["Senators deliver speeches on the Congressional response to the COVID-19 pandemic from the Senate floor.", "7K", ["9.6K", "Comments"]], ["Dana Perino is live now with storytime! Join her every weekday at 3:30p ET right here on Facebook as she reads some of her favorite children's books.", "2.7K", ["1K", "Comments"]], ["New York Governor Andrew Cuomo provides an update on the state's response to the coronavirus pandemic from the Javits Center.", "8.4K", ["14K", "Comments"]], ["Senate Majority Leader Mitch McConnell speaks on the Senate floor.", "13K", ["9.5K", "Comments"]], ["California Gov. Gavin Newsom holds a press conference to discuss the state's response to the coronavirus.", "3.3K", ["4.9K", "Comments"]], ["UPDATE: Tensions flared on the Senate floor Monday as lawmakers viscerally clashed over phase three of a coronavirus response package, with Democrats blocking Republican efforts to advance the massive stimulus bill for the second day in a row. https://fxn.ws/2J7YNUa", "28K", ["24K", "Comments"]], ["House Speaker Nancy Pelosi delivers remarks on the 10th anniversary of the Affordable Care Act and discusses the House Democrats’ Take Responsibility for Workers and Families Act.", "76K", ["71K", "Comments"]], ["Defense Secretary Mark Esper discusses the Department of Defense's response to the coronavirus pandemic.", "6.4K", ["4.4K", "Comments"]], ["UPDATE: Tensions flared on the Senate floor Monday as lawmakers viscerally clashed over phase three of a coronavirus response package, with Democrats blocking Republican efforts to advance the massive stimulus bill for the second day in a row. https://fxn.ws/2J7YNUa", "63K", ["83K", "Comments"]], ["New Jersey Gov. Phil Murphy and other officials provide an update on the state's response to the coronavirus outbreak.", "1.7K", ["2.7K", "Comments"]], ["Maryland Gov. Larry Hogan delivers remarks on the state's response to the coronavirus outbreak.", "3.2K", ["3.1K", "Comments"]], ["New York Governor Andrew Cuomo holds a press briefing on the state's coronavirus situation.", "5.8K", ["4.9K", "Comments"]], ["Massachusetts Gov. Charlie Baker makes remarks on the coronavirus pandemic.", "3.3K", ["3.1K", "Comments"]], ["Kentucky Gov. Andy Beshear holds a press conference on his state's response to the coronavirus. (Courtesy: WKYT)", "3.4K", ["3K", "Comments"]]]