[["Southwest Airline <LUV.N> can avoid furloughs and layoffs through 2021 if union workers agree to pay cuts, Chief Executive Gary Kelly said in a message to employees on Monday that detailed the devastating impact of the COVID-19 pandemic on the industry.", "6", ["2", "Comments"]], ["The U.S. Securities and Exchange Commission (SEC) on Monday sued John McAfee, creator of the eponymous anti-virus software, alleging that he made over $23.1 million in undisclosed compensation from recommending seven cryptocurrency offerings on Twitter that were materially...", "34", ["3", "Comments"]], ["The U.S. Senate Judiciary Committee announced on Monday that it would open a confirmation hearing for President Donald Trump's Supreme Court nominee, Amy Coney Barrett, on Oct. 12, making clear that an outbreak of COVID-19 will not interfere with the schedule.", "576", ["106", "Comments"]], ["U.S. commercial bankruptcy filings are up 33% so far this year with new cases in September surging by 78% from a year earlier as the recession triggered by the COVID-19 pandemic hits small businesses, data released on Monday showed.", "152", ["54", "Comments"]], ["Democratic presidential candidate Joe Biden appeared to lead President Donald Trump in Wisconsin and Pennsylvania less than a month before the Nov. 3 election, according to Reuters/Ipsos opinion polls released on Monday.", "1.2K", ["222", "Comments"]], ["Japan's Toyota Motor Corp <7203.T> said on Monday it would develop a heavy-duty fuel-cell electric truck with its subsidiary, Hino Motor Co, for the North American market.", "63", ["2", "Comments"]], ["A U.S. judge on Monday ordered Cisco Systems Inc to pay $1.9 billion after a Virginia company accused it of infringing patents related to complex computer network security functions.", "63", ["1", "Comment"]], ["Four people have died and up to 18 more are missing in floods and heavy rain in south-eastern France, local authorities said on Monday.", "113", ["5", "Comments"]], ["The following is a roundup of some of the latest scientific studies on the novel coronavirus and efforts to find treatments and vaccines for COVID-19, the illness caused by the virus.", "667", ["254", "Comments"]], ["Bank of America Corp said on Monday it is rolling out a digital financial planning tool, wading into a space that has so far been dominated by fintech companies.", "45", ["5", "Comments"]], ["Chicago Federal Reserve Bank President Charles Evans on Monday said he expects U.S. inflation to reach 2% by 2023 and wants to push it to 2.5% to offset years of below-target price rises.", "31", ["3", "Comments"]], ["Facebook and Belgium's privacy watchdog sparred on Monday at Europe's top court over which data protection authority has the power to police the U.S. social media giant in a case that could escalate its privacy fights across the EU.", "34", ["8", "Comments"]], ["Johnson & Johnson <JNJ.N> will pay more than $100 million to settle over 1,000 lawsuits that allege the company's Baby Powder caused cancer, Bloomberg news reported on Monday, citing people with knowledge of the pacts.", "72", ["17", "Comments"]], ["Federal Communications Commission Chairman Ajit Pai said on Monday he stands by the agency's repeal of landmark net neutrality rules and circulated a proposal to address three issues raised by a U.S. appeals court.", "388", ["72", "Comments"]], ["As COVID-19 has hit plastic recycling, big oil is investing $400 billion over the next 5 years to make new plastic, but less than $2 billion on cleaning up the waste. #PlasticPandemic https://reut.rs/33uPYPu", "125", ["9", "Comments"]], ["U.S. Centers for Disease Control and Prevention (CDC) in an updated guidance on Monday said COVID-19 can spread through airborne transmission, a month after it took down a similar warning.", "353", ["211", "Comments"]], ["The U.S. Supreme Court on Monday rebuffed a bid by a county clerk in Kentucky briefly jailed in 2015 for refusing to issue marriage licenses to two same-sex couples to avoid lawsuits they filed that accuse her of violating their constitutional rights.", "1.5K", ["169", "Comments"]], ["West Coast wildfires: Parts of Napa Valley are still recovering after having one of California’s largest fires on record at its doorstep in August, damaging crops and blanketing the valley with thick smoke https://reut.rs/3d127i3", "36", ["5", "Comments"]], ["An artist who won a legal battle to prove that Belgium's former King Albert II is her father said on Monday she was not expecting anything from her new family, after a court last week made her a princess.", "418", ["35", "Comments"]], ["U.S. oil giant Exxon Mobil <XOM.N> said on Monday it plans to reduce its European workforce by up to 1,600 across the company's affiliates by the end of 2021 as part of its global review.", "77", ["1", "Comments"]], ["When a wildfire swept down California's Napa Valley in August, winemaker Patrick Elliot-Smith stayed put, fighting the encroaching flames with water pumps and laying fire breaks around his vines in a battle with nature that lasted three days.", "50", ["13", "Comments"]], ["A question mark hangs over U.S. President Donald Trump's health as he continues treatment for COVID-19 at Walter Reed National Military Medical Center. Doctors say he may go home on Monday.", "113", ["128", "Comments"]], ["West Coast wildfires: Parts of Napa Valley are still recovering after having one of California’s largest fires on record at its doorstep in August, damaging crops and blanketing the valley with thick smoke https://reut.rs/2GzZXKi", "34", ["1", "Comments"]], ["Roughly one in 10 people may have been infected with the coronavirus, leaving the vast majority of the world's population vulnerable to the COVID-19 disease it causes, the World Health Organization said on Monday.", "154", ["70", "Comments"]], ["iQIYI said on Monday an internal review concluded that a short-seller's allegations about the streaming service inflating many of its financial metrics were without merit.", "9", ["3", "Comments"]], ["SpaceX Chief Executive Elon Musk said he will visit his space company’s Florida rocket facilities this week to investigate the cause of recent launch aborts and delays that have held up a busy mission schedule for the company's workhorse Falcon 9 rocket.", "58", ["5", "Comments"]], ["Smoke, fire and vineyards: How wildfires and smoke have wreaked havoc in California’s wine country https://reut.rs/3lk76O1", "77", ["6", "Comments"]], ["Mexico's government presented an almost $14 billion infrastructure investment plan on Monday as President Andres Manuel Lopez Obrador seeks to repair rocky relations with business leaders and lift the struggling economy.", "119", ["3", "Comments"]], ["Ethiopia has banned all flights over its giant new hydropower dam on the Blue Nile for security reasons, the head of its civil aviation authority said on Monday, as the president pledged the dam would begin generating power in the next 12 months.", "204", ["6", "Comments"]], ["New York Governor Cuomo orders schools to close in coronavirus 'hot spots,' including parts of Brooklyn and Queens.", "593", ["63", "Comments"]], ["From Reuters Breakingviews: U.S. cabinet picks have never been as crucial, writes Rob Cox https://reut.rs/33vD1on", "37", ["19", "Comments"]], ["One of the positive turns that the U.S. economy took during a decade-long recovery through 2019 was a steady rise in the share of women looking for work and working.", "39", ["5", "Comments"]], ["From Reuters Breakingviews: Donald Trump’s COVID-19 battle is a reminder that the presidency isn’t a one-man job. And Breakingviews’ Economic Dream Machine showed that Joe Biden has the edge in picking his cabinet. Read the view from Rob Cox https://reut.rs/2I04qGX", "234", ["46", "Comments"]], ["China said at a World Trade Organization meeting that restrictions by the United States on Chinese mobile applications TikTok and WeChat are in violation of the body's rules, a trade official said.", "190", ["69", "Comments"]], ["LIVE: Governor Cuomo is set to make an announcement as New York tries to manage COVID-19 hotspots #coronavirus #COVID19 #Cuomo #pandemic", "578", ["131", "Comments"]], ["Nvidia Corp <NVDA.O> on Monday laid out a multi-year plan to create a new kind of chip for data centers, aimed at siphoning off more functions from its chief rival Intel Corp <INTC.O>.", "49", ["0", "Comments"]], ["The U.S. Supreme Court returned to work on Monday for the first time since liberal Justice Ruth Bader Ginsburg's death and heard arguments in two cases, opening its new term as Senate Republicans pursued quick confirmation of President Donald Trump's conservative nominee...", "229", ["9", "Comments"]], ["Japan's two biggest automakers, Toyota and Nissan, will ask Britain to reimburse them for additional custom charges incurred if the UK government fails to reach a Brexit trade deal with the European Union, the Nikkei financial daily reported on Monday.", "110", ["8", "Comments"]], ["Japan's two biggest automakers, Toyota and Nissan, will ask Britain to reimburse them for additional custom charges incurred if the UK government fails to reach a Brexit trade deal with the European Union, the Nikkei financial daily reported on Monday.", "78", ["5", "Comments"]], ["Uber Technologies Inc <UBER.N> and Lyft Inc <LYFT.O> together are spending nearly $100 million on a November California ballot initiative to overturn a state law that would compel them to classify drivers as employees.", "59", ["1", "Comment"]], ["Asia-focused online travel agency Agoda is counting on a revival of domestic tourism in parts of the region to help it weather the coronavirus pandemic, its top executive said on Monday.", "28", ["2", "Comments"]], ["The coronavirus pandemic has sparked a rush for plastic.", "117", ["18", "Comments"]], ["James Bond’s delay spells doom for cinemas and JD.com’s online pharmacy taps into health trends. Catch up on the latest pandemic-related insights from Breakingviews here: https://reut.rs/3lgkbYE", "22", ["2", "Comments"]], ["A tug-of-war over $1 billion worth of Venezuelan gold stored at the Bank of England took a new turn on Monday as the English Court of Appeal overturned an earlier High Court ruling on who the UK recognised as Venezuela's president.", "168", ["9", "Comments"]], ["The coronavirus pandemic has not only sparked a rush for plastic, but intensified a price war between recycled and new plastic - a war that recyclers worldwide are losing. Read more: https://reut.rs/3l9TPHu", "159", ["3", "Comments"]], ["LAREDO, Texas - Former U.S. Border Patrol agent Daniel Perales spent hours over the years crouched at the mouth of the Zacata Creek, a tributary of the Rio Grande, listening for the snap of carrizo cane as border crossers from Mexico arrived on the northern banks.", "121", ["2", "Comments"]], ["NYSE rises at open on hints of President Trump's discharge", "408", ["138", "Comments"]], ["Bristol Myers Squibb Co <BMY.N> said on Monday it would buy MyoKardia Inc <MYOK.O> for about $13 billion to bolster its portfolio of heart disease treatments, as it seeks to reduce some of its dependence on cancer drugs.", "25", ["2", "Comments"]], ["Britain's Queen Elizabeth gave a ringing endorsement of traditional media in a message to journalists on Monday, saying they were providing a vital public service during the COVID-19 pandemic.", "1.2K", ["120", "Comments"]], ["Japanese Prime Minister Yoshihide Suga, under fire for rejecting six scholars for membership of a science advisory panel, defended the move amid growing criticism that it violated the constitution’s principle of academic freedom https://reut.rs/30CHW5k", "69", ["2", "Comments"]], ["Roughly 1 in 10 people may have been infected with the novel coronavirus, leaving the vast majority of the world's population vulnerable to the related COVID-19 disease, the World Health Organization (WHO) said on Monday.", "250", ["69", "Comments"]], ["The laureate of the 2020 Nobel Peace Prize will be announced on Friday in Oslo. Here is a look at how the award works https://reut.rs/30xNwWD", "55", ["39", "Comments"]], ["Microsoft Corp. <MSFT.O> is to build a data centre hub in Greece as it invests in cloud services infrastructure in the country, a boon to an economy weakened by a decade-long debt crisis and the coronavirus pandemic.", "251", ["18", "Comments"]], ["The coronavirus pandemic has sparked a rush for plastic.", "249", ["48", "Comments"]], ["Trump could be discharged from the hospital where he is being treated for COVID-19 as soon as Monday, according to his doctors, although his condition remains unclear https://reut.rs/2SpdiI9", "187", ["86", "Comments"]], ["A victory for Democratic presidential nominee Joe Biden on Nov. 3 would spell the end of the party for the banking industry which has enjoyed more than $40 billion in regulatory cuts under U.S. President Donald Trump's business-friendly administration.", "569", ["371", "Comments"]], ["If Round One of the coronavirus relief effort was the economic equivalent of 'shock and awe,' new plans being developed by the world’s biggest economies for more assistance to businesses and consumers are taking a narrower and more tactical approach https://reut.rs/3niI9Ep", "47", ["8", "Comments"]], ["Danimer Scientific said on Monday it has agreed to go public by merging with blank-check acquisition company with Live Oak Acquisition Corp <LOAK.N> in a deal which values the U.S. bioplastics company at around $890 million.", "32", ["3", "Comments"]], ["President Trump briefly left the military hospital where he is being treated for COVID-19 in a motorcade on Sunday to wave to supporters gathered outside, sparking criticism that he was putting others at risk for a political stunt https://reut.rs/3leCYDI", "2.2K", ["1.1K", "Comments"]], ["Microsoft Corp. <MSFT.O> will invest in cloud services infrastructure in Greece, a boon to the country's economy that has been weakened by a decade-long debt crisis and the coronavirus pandemic, senior executives of the technology giant said on Monday.", "199", ["8", "Comments"]], ["Japanese Prime Minister Yoshihide Suga, under fire for rejecting six scholars for membership of a science advisory panel, defended the move on Monday amid growing criticism that it violated the constitution's principle of academic freedom.", "94", ["3", "Comments"]], ["COVID-19 has trashed the recycling dream: Since COVID-19, the largest single source of plastic pollution and the most commonly recycled, drinks bottles made of recycled plastic, have become less viable. The recycled plastic to make them is 83% to 93% more expensive than new bottle-grade plastic. https://reut.rs/3lfcbHj", "103", ["6", "Comments"]], ["The renewed effort in the U.S. Congress to reach a fresh deal to pump coronavirus relief funds into the pandemic-hit economy has been further complicated by the news that President Donald Trump and three Senate Republicans have tested positive.", "983", ["216", "Comments"]], ["Nine U.S. states have reported record increases in COVID-19 cases over the last seven days, mostly in the upper Midwest and West where chilly weather is forcing more activities indoors https://reut.rs/34rnnda", "83", ["32", "Comments"]], ["In Yemen’s gas-rich region of Marib, fighters loyal to the Saudi-backed government recited Koranic verses before launching a hail of mortar and machine gun fire towards rocky mountains, in a desperate bid to push back Houthi forces https://reut.rs/34rnyVS", "60", ["3", "Comments"]], ["See where COVID-19 infections are trending ⬆️ or ⬇️ relative to the size of the outbreak in each country https://reut.rs/2Sz9kwl", "128", ["104", "Comments"]], ["Ireland's government faced political and business resistance on Monday to a surprise recommendation by health chiefs for Europe's first major second wave national lockdown to prevent hospitals from being overwhelmed as coronavirus cases rise.", "92", ["2", "Comments"]], ["Indonesia's government is in early discussions with electric vehicles maker Tesla Inc <TSLA.O> about a potential investment in the Southeast Asia country, a major producer of nickel, an official said.", "1.1K", ["5", "Comments"]], ["Like hundreds of thousands of people in Egypt, and many dependents, 35-year-old Shaimaa Saleh faces a deadline at the end of October by which residents of buildings without permits must apply to regularize their property for a fee, or face demolition https://reut.rs/2SqmpYP", "68", ["2", "Comments"]], ["Armin Laschet is fast emerging as the frontrunner in the race to be the ruling Christian Democrats' (CDU) candidate for chancellor in Germany's federal election next year after Angela Merkel stands down, two dozen party sources say.", "94", ["11", "Comments"]], ["Google has extended its deadline for Indian app developers to comply with a new billing system for commission fees by six months, days after local startups voiced anger about the charges https://reut.rs/3ittCSN", "22", ["1", "Comment"]], ["LIVE: WHO Executive Board holds a meeting on COVID-19 following calls for reforms", "411", ["116", "Comments"]], ["As Britain’s negotiations with the European Union on a post-#Brexit trade deal go down to the wire, Prime Minister Boris Johnson says his country could trade with the bloc on similar terms to Australia, if no agreement is reached https://reut.rs/2HZ7rHt", "86", ["7", "Comments"]], ["Armenia and Azerbaijan accused each other of attacking civilian areas on a ninth day of fighting, the deadliest in the South Caucasus region for more than 25 years https://reut.rs/3nhQbx7", "773", ["690", "Comments"]], ["Scientists who helped identify Hepatitis C virus win 2020 #NobelPrize in Physiology or Medicine https://reut.rs/30znsui", "827", ["40", "Comments"]], ["Armenia and Azerbaijan accused each other on Monday of attacking civilian areas on a ninth day of fighting, the deadliest in the South Caucasus region for more than 25 years.", "197", ["233", "Comments"]], ["If Round One of the coronavirus relief effort was the economic equivalent of \"shock and awe,\" new plans being developed by the world's biggest economies for more assistance to businesses and consumers are taking a narrower and more tactical approach.", "80", ["6", "Comments"]], ["LIVE: 2020 Nobel Prize in Physiology or Medicine is announced This year's Nobel Prize in Physiology or Medicine is announced.", "528", ["140", "Comments"]], ["The combination of COVID-19 and a failure to secure a post-#Brexit trade deal with the European Union could cost the United Kingdom around $174 billion each year in lost GDP for a decade, research by law firm Baker & McKenzie showed https://reut.rs/2GiFkCN", "125", ["35", "Comments"]], ["Netflix has partially released its much-awaited series on four Indian tycoons facing fraud allegations after a state court lifted an injunction over the weekend, a lawyer representing Netflix said on Monday.", "25", ["8", "Comments"]], ["Prince William has expressed his concerns about rising sea levels and other impacts of climate change in a television documentary to be aired in Britain https://reut.rs/3jyNuF9", "424", ["76", "Comments"]], ["British new car registrations fell by around 4% year-on-year in September, usually one of the top two months of the year for sales, as the coronavirus pandemic continued to affect the sector, according to data from an industry group https://reut.rs/2Gtr5uP", "20", ["8", "Comments"]], ["Hidden between the skyscrapers of Singapore's urban jungle sits Kampong Lorong Buangkok - the only surviving traditional village in this modern city-state of 5.7 million people.", "50", ["6", "Comments"]], ["The British government launched a new employment programme aimed at helping those left jobless due to the COVID-19 pandemic to get back into work https://reut.rs/34tWIMC", "84", ["3", "Comments"]], ["Rovio Entertainment <ROVIO.HE> said on Monday that Chief Executive Kati Levoranta will leave the maker of the Angry Birds game series at the end of the year.", "24", ["1", "Comments"]], ["Cineworld will close all of its UK and U.S. movie theatres later this week, leaving as many as 45,000 workers unemployed for the foreseeable future as it strives to survive the impact of the coronavirus crisis on the film industry https://reut.rs/3d0djvr", "34", ["1", "Comments"]], ["Liverpool great Graeme Souness says Aston Villa may have let the grass grow on their home pitch a bit longer than usual in a bid to stop the Premier League champions hitting top gear https://reut.rs/3nik7cF", "74", ["34", "Comments"]], ["Stocks rose as signs that President Trump’s health was improving eased some of the political uncertainty caused by his coronavirus infection, which sent investors rushing for safety last week https://reut.rs/3jxE0ds", "103", ["31", "Comments"]], ["Manchester United forward Marcus Rashford has apologised to the club’s supporters following their 6-1 hammering by Tottenham Hotspur https://reut.rs/34qAdYV", "24", ["1", "Comment"]], ["As Britain’s negotiations with the European Union on a post-#Brexit trade deal go down to the wire, Prime Minister Boris Johnson says his country could trade with the bloc on similar terms to Australia, if no agreement is reached https://reut.rs/34n8jgw", "76", ["9", "Comments"]], ["Armin Laschet is fast emerging as the frontrunner in the race to be the ruling CDU candidate for chancellor in Germany’s federal election next year after Angela Merkel stands down, sources say https://reut.rs/2GCllhY", "116", ["3", "Comments"]], ["Tottenham Hotspur’s Jose Mourinho delivered a sharp riposte to critics of his 'defensive' style, saying after their 6-1 Premier League win over Manchester United that they would have scored 10 if only they had a more attacking coach https://reut.rs/2GzITUT", "17", ["5", "Comments"]], ["President Trump could be discharged from the hospital where he is being treated for COVID-19 as soon as Monday, according to his doctors, although his condition remains unclear and outside experts warn that his case may be severe https://reut.rs/36B4Y02", "260", ["206", "Comments"]], ["Former Manchester United defender Patrice Evra says his former side are a 'shambles' after their 6-1 defeat by Tottenham Hotspur https://reut.rs/2Ss4e57", "93", ["3", "Comments"]], ["China's Alibaba plans to acquire a stake of up to 9.99% in Swiss duty free group Dufry, Dufry said on Monday, as it announced a new Chinese joint venture with the tech giant.", "23", ["1", "Comment"]], ["As Britain's negotiations with the European Union on a post-Brexit trade deal go down to the wire, Prime Minister Boris Johnson says his country could trade with the bloc on similar terms to Australia, if no agreement is reached.", "105", ["12", "Comments"]], ["Here's what you need to know about the coronavirus right now:", "58", ["6", "Comments"]], ["The combination of COVID-19 and a failure to secure a post-Brexit trade deal with the European Union could cost the United Kingdom around 134 billion pounds ($174 billion) each year in lost GDP for a decade, research by law firm Baker & McKenzie showed.", "177", ["37", "Comments"]], ["Alphabet Inc's Google has extended its deadline for Indian app developers to comply with a new billing system by six months to March 31, 2022, the U.S. tech giant said in a blog post on Monday.", "32", ["1", "Comment"]], ["Japan's NEC Corp said on Monday it will buy Swiss financial software company Avaloq Group AG for 2.05 billion Swiss francs ($2.2 billion), a move that will spearhead its entry globally into finance software.", "113", ["7", "Comments"]], ["New Zealand Prime Minister Jacinda Ardern's centre-left government vowed on Monday to ban conversion therapy, which aims to change a person's sexual orientation, if returned to power, as widely expected, in polls on Oct. 17.", "3.6K", ["527", "Comments"]], ["The outbreak of Covid-19 is the best thing that ever happened to the mask industry, but it’s going to require a bit of cleaning up. Side effects of the boom include diplomatic spats, quality scandals, price gouging, and fraud. Dealing with excess capacity and a rising mountain...", "117", ["43", "Comments"]], ["In a sign of tennis's topsy-turvy 2020, Australia's Ash Barty will remain the women's world number one at the end of the year despite having skipped two Grand Slams and not playing a match since February.", "605", ["40", "Comments"]], ["Democratic presidential nominee Joe Biden tested negative again for COVID-19 on Sunday in a polymerase chain reaction (PCR) test, his campaign said, according to a press pool report.", "3.3K", ["382", "Comments"]], ["Fujitsu Ltd <6702.T>, the developer of the Tokyo Stock Exchange's trading system, is still investigating causes of the bourse's worse-ever outage last week, the company's chief executive said on Monday.", "29", ["2", "Comments"]], ["British finance minister Rishi Sunak warned that a further lockdown would cripple both the economy and society, in an interview with The Sun newspaper, stating that lockdowns have a very strong economic and social impact.", "71", ["15", "Comments"]], ["Syrian President Bashar al Assad said the continued presence of Russia's major naval and air bases in his country help counter the influence of Western powers in the region as the battle to crush insurgents was winding down.", "171", ["44", "Comments"]], ["Coronavirus restrictions in New Zealand's largest city will be lifted this week, Prime Minister Jacinda Ardern said on Monday as she expressed confidence a second wave of COVID-19 infections in Auckland has been almost eliminated.", "1.3K", ["174", "Comments"]], ["The final tanker in a flotilla of three Iranian fuel tankers docked at eastern Venezuela's Guaraguao port on Sunday, according to Refinitiv Eikon data and a person familiar with the matter, as President Nicolas Maduro promised to normalize fuel supply in the gasoline-starved...", "217", ["45", "Comments"]], ["Syrian President Bashar al Assad said the continued presence of Russia's major naval and air bases in his country help counter the influence of Western powers in the region as the battle to crush insurgents was winding down.", "451", ["160", "Comments"]], ["Wildfires in California have burned more than 4 million acres (1.6 million hectares) in 2020, over twice the previous record for any year and an area larger than Connecticut, the state's fire agency reported on Sunday.", "467", ["92", "Comments"]], ["The game between the reigning Super Bowl champion Kansas City Chiefs and New England Patriots that was postponed because of positive COVID-19 tests from both teams, has been rescheduled for Monday, the NFL said on Sunday.", "45", ["15", "Comments"]], ["A new three-tier lockdown is being planned for England, The Guardian reported, citing leaked government documents which revealed tougher measures that could be implemented locally or nationally if the government fails to get COVID-19 cases under control.", "254", ["43", "Comments"]], ["The COVID-19 pandemic could trigger a debt crisis in some countries, so investors must be ready for granting some form of relief that could also include debt cancellation, World Bank President David Malpass was quoted as saying on Sunday.", "373", ["37", "Comments"]], ["Britain's vaccine task force chair, Kate Bingham, said that vaccinating everyone in the country for the coronavirus was 'not going to happen', telling the Financial Times that they need to vaccinate only those at risk.", "240", ["88", "Comments"]], ["New Zealand's Fonterra <FCG.NZ> <FSF.NZ> said on Monday it has agreed to sell its farms in China for a total of NZ$555 million ($367.97 million) as the dairy producer continues to focus on the domestic market and reduce debt.", "1K", ["40", "Comments"]], ["Paris is to be placed on maximum COVID-19 alert, meaning bars will be forced to close for two weeks from Tuesday and restaurants will have to put in place new sanitary protocols to stay open, the prime minister's office said.", "601", ["30", "Comments"]], ["Christopher Nolan's \"Tenet\" willed itself past the $300 million mark globally this weekend even as the overall domestic box office appeared to be on the verge of collapse.", "155", ["30", "Comments"]], ["Ireland's National Public Health Emergency Team (NPHET) recommended to the government on Sunday that the country be moved to the highest level of COVID-19 restrictions and return to a full lockdown, national broadcaster RTE reported.", "361", ["70", "Comments"]], ["Twitter users are flooding the #ProudBoys hashtag on social media with images of LGBTQI+ pride, displacing posts made by neo-Nazis and white supremacists using the tag.", "21K", ["1.9K", "Comments"]], ["German Alexander Zverev, who said he played his French Open fourth-round match against Italian Jannik Sinner on Sunday with a fever and difficulties breathing, tested negative for COVID-19 on Sept. 29, organisers told Reuters.", "58", ["11", "Comments"]], ["France on Sunday reported 12,565 new confirmed coronavirus infections over the last 24 hours, falling from the previous daily toll that had a set a new record.", "273", ["39", "Comments"]], ["Israel's defence minister accused Turkey on Sunday of destabilising the region and working against peacemaking efforts, and called for international pressure to bring about a change in the NATO power's conduct.", "763", ["430", "Comments"]], ["It is not unusual for the French Open to throw up surprises in the women's draw but this year's re-scheduled tournament has been more wildly unpredictable than ever.", "65", ["6", "Comments"]], ["Eighteen Nagorno-Karabakh civilians were killed by fire from Azeri forces and more than 90 were wounded in the past week, RIA Novosti news agency cited an official in the breakaway region as saying on Sunday.", "1K", ["1.8K", "Comments"]], ["French Finance Minister Bruno Le Maire said on Sunday there had been progress in talks over French utility Suez <SEVI.PA>, of which rival Veolia wants to buy close to a third of the shares.", "78", ["16", "Comments"]], ["New York City Mayor Bill de Blasio, to contain the spread of COVID-19 in what was once the U.S. epicenter of the pandemic, said on Sunday he is moving to shut non-essential businesses as well as schools in nine neighborhoods identified as coronavirus clusters, starting on...", "367", ["73", "Comments"]], ["German Alexander Zverev, who said he played his French Open fourth-round match against Italian Jannik Sinner on Sunday with a fever and difficulties breathing, tested negative for COVID-19 on Sept. 29, organisers told Reuters.", "44", ["2", "Comments"]], ["Azerbaijan's President Ilham Aliyev demanded on Sunday that Armenia set a timetable for withdrawing from the enclave of Nagorno-Karabakh and surrounding Azeri territories, and said Azerbaijan would not cease military action until that happened.", "1.7K", ["1.1K", "Comments"]], ["German police on Sunday arrested a man who attacked and seriously injured a Jewish citizen near a synagogue in the northern town of Hamburg as the Jewish community celebrated Sukkoth.", "206", ["56", "Comments"]], ["Five bodies were discovered in northwestern Italy on Sunday, including four washed up on the shore close to the border with France, officials said, in deaths thought to be caused by severe storms in the region.", "501", ["20", "Comments"]], ["U.S. House Speaker Nancy Pelosi on Sunday said progress was being made on coronavirus relief legislation to respond to the economic fallout from a pandemic that has killed more than 207,000 Americans and thrown millions out of work.", "418", ["120", "Comments"]], ["American qualifier Sebastian Korda described being schooled by his idol Rafa Nadal on the French Open's biggest stage on Sunday as the \"coolest moment of my life\".", "258", ["5", "Comments"]], ["Joe Biden leads by 10 points as a majority of Americans say President Trump could have avoided infection if he had taken the virus more seriously, according to a Reuters/Ipsos poll https://reut.rs/2SqqvjL via @Cmkahn", "4.2K", ["1.1K", "Comments"]], ["German Alexander Zverev said he played with a fever and breathing difficulties during his fourth-round French Open defeat to Italian teenager Jannik Sinner on Sunday, raising questions about the COVID-19 protocols at the claycourt Grand Slam.", "1.2K", ["33", "Comments"]], ["President Trump’s condition is improving as he is being treated for COVID-19 at a military hospital, and he could return to the White House as early as Monday, the doctors leading his treatment said https://reut.rs/2GAEiSa", "307", ["235", "Comments"]], ["Bolivia's presidential candidates faced off late on Saturday in the first all-party campaign debate in almost two decades, but analysts chided the runners as having forgotten how to hold a proper discourse after a tepid event.", "76", ["2", "Comments"]], ["When race commentator Steve Cram announced \"this is not normal\" midway through Sunday's London Marathon it was something of an understatement as Eliud Kipchoge, the most dominant performer the distance has ever seen, was finally looking mortal.", "267", ["2", "Comments"]], ["Azerbaijan said on Sunday that Armenian forces fired rockets at its second city of Ganja, killing one civilian and wounding four, and threatened to retaliate by destroying military targets in Armenia https://reut.rs/3iulbGN", "517", ["700", "Comments"]], ["Two political parties, one of them close to President Sooronbai Jeenbekov, won roughly half the votes in Kyrgyzstan's parliamentary election on Sunday, preliminary data from the Central Election Commission showed.", "71", ["2", "Comments"]], ["Tens of thousands of people marched through the center of the Belarusian capital Minsk to demand that authorities free political prisoners https://reut.rs/2GileZk", "385", ["2", "Comments"]], ["Japanese fashion designer Kenzo Takada, better known as Kenzo, died Sunday from COVID-19, his spokesman told several French media outlets.", "1.3K", ["30", "Comments"]], ["Tens of thousands of people marched through the centre of the Belarusian capital Minsk on Sunday to demand that authorities free political prisoners, prompting police to turn water cannon on them.", "174", ["7", "Comments"]], ["Russian Foreign Minister Sergei Lavrov called for an immediate ceasefire in Nagorno-Karabakh on Sunday and said Moscow was ready to help seek a solution to the conflict via the Organization for Security and Co-operation in Europe.", "412", ["585", "Comments"]], ["House Speaker Nancy Pelosi said progress was being made on coronavirus relief legislation to respond to the economic fallout from a pandemic that has killed more than 207,000 Americans and thrown millions out of work https://reut.rs/3cVU7Po", "432", ["124", "Comments"]], ["The Italian government will likely impose new restrictions on the country in the coming week to try to beat back rising numbers of coronavirus cases, Health Minister Roberto Speranza said on Sunday.", "325", ["11", "Comments"]], ["London's Royal Opera House is to sell a 1970s painting by David Hockney as it seeks to raise cash to get through the COVID-19 pandemic, the worst crisis in its history.", "132", ["1", "Comment"]], ["The world’s second-biggest cinema operator said it was considering a temporary closure of all its sites in the U.S. and UK https://reut.rs/3d4vekH", "71", ["14", "Comments"]], ["White House Chief of Staff Meadows revealed that Trump’s condition on Friday was far worse than officials had made public, saying doctors recommended the president go to the hospital after seeing he had a fever and his blood oxygen level dropped rapidly https://reut.rs/2SmAbfg", "169", ["85", "Comments"]], ["U.S. House Speaker Nancy Pelosi on Sunday said progress was being made on coronavirus relief legislation to respond to the economic fallout from a pandemic that has killed more than 207,000 Americans and thrown millions out of work.", "278", ["110", "Comments"]], ["Trump's medical team says the president experienced two episodes of blood-oxygen drops during his illness. They said Trump has remained without fever since Friday morning and vital signs are stable", "1.5K", ["672", "Comments"]], ["Nine U.S. states have reported record increases in COVID-19 cases over the last seven days, mostly in the upper Midwest and West where chilly weather is forcing more activities indoors.", "323", ["30", "Comments"]], ["Pope Francis said on Sunday that the COVID-19 pandemic was the latest crisis to prove that market forces alone and \"trickle-down\" economic policies had failed to produce the social benefits their proponents claim.", "4.7K", ["815", "Comments"]], ["Polish teenager Iga Swiatek dumped top seed Simona Halep out of the French Open on Sunday with a crushing 6-1 6-2 victory to make her maiden Grand Slam quarter-final.", "404", ["5", "Comments"]], ["British Prime Minister Boris Johnson said he expected the next few months of the COVID-19 pandemic to be bumpy, but that things would look radically different in the spring https://reut.rs/3isgL2X", "58", ["16", "Comments"]], ["Malaysia reported 293 new coronavirus cases on Sunday, taking its total number of infections to 12,381. Fatalities remained at 137, with no new deaths recorded.", "91", ["5", "Comments"]], ["President Donald Trump said the next few days will be the \"real test\" of his treatment for COVID-19, after a series of contradictory messages from the White House caused widespread confusion about his condition.", "75", ["58", "Comments"]], ["Joe Biden opened his widest lead in a month in the U.S. presidential race after Donald Trump tested positive for the coronavirus, and a majority of Americans think Trump could have avoided infection if he had taken the virus more seriously, according to a Reuters/Ipsos poll. https://reut.rs/30xeWMm", "4.2K", ["870", "Comments"]], ["Coronavirus-wary animal owners in the Philippines had their pets blessed via a drive-through ceremony to mark #WorldAnimalDay and the feast of Saint Francis of Assisi, the patron saint of animals https://reut.rs/30wwRma", "159", ["13", "Comments"]], ["Nine U.S. states have reported record increases in COVID-19 cases over the last seven days, mostly in the upper Midwest and West where chilly weather is forcing more activities indoors.", "456", ["150", "Comments"]], ["Thousands of demonstrators in southern Germany protested against coronavirus restrictions over the weekend https://reut.rs/2Ssn1NE", "551", ["122", "Comments"]], ["Coronavirus-wary animal owners in the Philippines had their pets blessed via a drive-through ceremony on Sunday to mark World Animal Day and the feast of Saint Francis of Assisi, the patron saint of animals.", "159", ["19", "Comments"]], ["French utility Veolia <VIE.PA> said on Sunday it would not launch a hostile bid for the remaining shares of rival Suez <SEVI.PA>, following its move to buy the 29.9% Suez stake owned by power group Engie. <ENGIE.PA>", "16", ["4", "Comments"]], ["Martina Trevisan's career is taking off in spectacular fashion, with the Italian becoming the first qualifier in eight years to reach the quarter-finals of the French Open by beating Dutch fifth seed Kiki Bertens 6-4 6-4 on Sunday.", "78", ["5", "Comments"]], ["India and South Africa want the World Trade Organization (WTO) to waive intellectual property rules to make it easier for developing countries to produce or import COVID-19 drugs, a letter https://docs.wto.org/dol2fe/Pages/SS/directdoc.aspx…...", "109", ["10", "Comments"]], ["British Prime Minister Boris Johnson does not particularly wish for the Brexit transition period to end without a new trade deal in place but believes that Britain could live with such an outcome, he said on Sunday.", "102", ["8", "Comments"]], ["Polish teenager Iga Swiatek dumped top seed Simona Halep out of the French Open on Sunday with a crushing 6-1 6-2 victory to make her maiden Grand Slam quarter-final.", "1.1K", ["23", "Comments"]], ["White House Chief of Staff Mark Meadows acknowledges President Trump's condition on Friday had been worse than revealed https://reut.rs/33sJksN", "556", ["319", "Comments"]], ["The South Pacific archipelago of New Caledonia voted against independence from France in a referendum on Sunday, full provisional results showed.", "191", ["8", "Comments"]], ["Shareholders in Monte dei Paschi di Siena <BMPS.MI> approved on Sunday a long-awaited bad loan clean-up plan aimed at easing the sale of the state-owned bank to a healthier rival.", "40", ["1", "Comment"]], ["Chinese chipmaker Semiconductor Manufacturing International Corporation has undertaken \"preliminary exchanges\" with the U.S. Bureau of Industry and Security regarding export restrictions, the company said on Sunday in a filing.", "82", ["7", "Comments"]], ["Thousands of people from the Oromo, Ethiopia's largest ethnic group, celebrated their thanksgiving festival in Bishoftu city amid tight security on Sunday after the authorities said they had seized weapons and foiled attacks in previous days.", "147", ["11", "Comments"]], ["Ethiopian Shura Kitata outsprinted Kenya's Vincent Kipchumba to win a thrilling London Marathon on Sunday as a stunned world record holder Eliud Kipchoge faded late in the race to suffer his first defeat since 2013.", "593", ["22", "Comments"]], ["Azerbaijan will destroy military targets in Armenia from which Armenia is firing on Azeri cities, an aide to Azeri President Ilham Aliyev said on Sunday.", "750", ["588", "Comments"]], ["India hopes to receive up to 500 million doses of coronavirus vaccine by July to inoculate about 250 million people, health minister Harsh Vardhan said on Sunday, as infections in the world's second-worst affected country continue to surge.", "148", ["28", "Comments"]], ["Thousands of demonstrators in southern Germany protested against coronavirus restrictions over the weekend, police said on Sunday, although organisers failed to mobilise enough people for a planned human chain around Lake Constance.", "374", ["89", "Comments"]], ["British Prime Minister Boris Johnson said on Sunday he expected the next few months of the COVID-19 pandemic to be bumpy, but that things would look radically different in the spring.", "147", ["42", "Comments"]], ["Ethiopia's Shura Kitata wins London Marathon as favorite Eliud Kipchoge suffers first defeat since 2013", "205", ["27", "Comments"]], ["Voters on the South Pacific archipelago of New Caledonia were on course to reject breaking away from France after nearly 170 years of colonial rule in a referendum on Sunday, partial results showed.", "235", ["8", "Comments"]], ["Azerbaijan said on Sunday that Armenian forces had fired rockets at its second city of Ganja, killing one civilian and wounding four, and threatened to retaliate by destroying military targets inside Armenia.", "527", ["536", "Comments"]], ["The U.S. Supreme Court begins its new nine-month term on Monday buffeted by the death of liberal Justice Ruth Bader Ginsburg, a Senate confirmation battle over her successor, the coronavirus pandemic and the approaching presidential election whose outcome the justices may...", "196", ["8", "Comments"]], ["Pope Francis said on Sunday that the COVID-19 pandemic was the latest crisis to prove that market forces alone and \"trickle-down\" economic policies had failed to produce the social benefits their proponents claim.", "13K", ["1.5K", "Comments"]], ["Tottenham Hotspur's Eric Dier has said the new handball law has made things more difficult for defenders who now second guess themselves before going in for a challenge in the box.", "26", ["12", "Comments"]], ["Cineworld, the world's second-biggest cinema operator, will close all its screens in the United States, Britain and Ireland this week after studios pulled major releases such as the latest James Bond film, a person familiar with the situation said.", "174", ["18", "Comments"]], ["Tottenham Hotspur's Eric Dier has said the new handball law has made things more difficult for defenders who now second guess themselves before going in for a challenge in the box.", "772", ["7", "Comments"]], ["British Prime Minister Boris Johnson said on Sunday he did not particularly wish for the Brexit transition period to end without a new trade deal being in place, but that Britain could live with such an outcome.", "185", ["64", "Comments"]], ["As Myanmar's coronavirus infections soar, the work never seems to stop for volunteers who have stepped in to help carry those suspected of symptoms to quarantine centres or hospitals.", "121", ["10", "Comments"]], ["Poland's total number of coronavirus cases passed the 100,000 mark on Sunday, according to the health ministry's Twitter account, as infection rates surge in the country which has reported daily records three times in the past week.", "247", ["49", "Comments"]], ["Kuwait's new Emir Sheikh Nawaf al-Ahmad al-Sabah met on Sunday with senior U.S. and Iranian officials who separately paid respects over the death of the Gulf Arab state's former ruler.", "159", ["50", "Comments"]], ["Indonesia on Sunday reported 3,992 new coronavirus cases, the lowest daily increase in six days, taking its total number of infections to 303,498, health ministry data showed.", "102", ["65", "Comments"]], ["Mecca slowly stirred from a seven-month hibernation on Sunday as pilgrims trickled in after Saudi Arabian authorities partially lifted a coronavirus ban on performing umrah - a pilgrimage to Islam's two holiest sites that is undertaken at any time of year.", "124", ["60", "Comments"]], ["Cineworld, the world's second-biggest cinema operator, will close all its sites in the United States, the United Kingdom and Ireland this week because of the impact of the coronavirus crisis, a person familiar with the situation said on Sunday.", "60", ["25", "Comments"]], ["Russia reported 10,499 new coronavirus cases on Sunday, the highest number of daily infections since May 15, when the outbreak was at its peak and lockdowns were in place.", "218", ["34", "Comments"]], ["Cineworld, the world's second-biggest cinema operator, will close all its sites in the United States, the United Kingdom and Ireland this week because of the impact of the coronavirus crisis, a person familiar with the situation said on Sunday.", "169", ["15", "Comments"]], ["Azerbaijan said on Sunday that Armenian armed forces had shelled its second city of Ganja in a major new escalation of the conflict in the South Caucasus.", "2.4K", ["2K", "Comments"]], ["Breece Hall ran for 139 yards and two touchdowns to lift Iowa State to a historic 37-30 win over No. 18 Oklahoma on Saturday night in Ames, Iowa.", "59", ["4", "Comments"]], ["Wallabies prop James Slipper has left his young team mates with no illusions about their task over the next two weeks, saying their poor results of the past made the team the deserved underdogs in their Bledisloe Cup tests against the All Blacks.", "16", ["2", "Comments"]], ["New Orleans Saints fullback Michael Burton tested positive in Detroit on Saturday night, multiple outlets reported, and he is being retested in an effort to confirm the diagnosis.", "31", ["12", "Comments"]], ["Former major league pitcher Charlie Haeger, who police were seeking in connection with the shooting death of his ex-girlfriend, was found dead of a self-inflicted gunshot wound in Arizona, multiple outlets reported Saturday night.", "95", ["7", "Comments"]], ["Wallabies prop James Slipper has left his young team mates with no illusions about their task over the next two weeks, saying their poor results of the past made the team the deserved underdogs in their Bledisloe Cup tests against the All Blacks.", "21", ["5", "Comments"]], ["U.S. oil refineries are moving aggressively to produce renewable diesel, partly to cash in on Canada's greener fuel standard before Canadian refiners modify their own plants.", "58", ["0", "Comments"]], ["Royal Challengers Bangalore captain Virat Kohli said he has a love-hate relationship with cricket after rediscovering his form in the Indian Premier League (IPL) in the United Arab Emirates.", "30", ["3", "Comments"]], ["The Australian government said on Sunday it will earmark an additional A$1.2 billion ($859 million) in wage subsidies in the 2020/21 budget and that its frameworks assume that there will be a novel coronavirus vaccine next year.", "183", ["1", "Comment"]], ["U.S. oil refineries are moving aggressively to produce renewable diesel, partly to cash in on Canada's greener fuel standard before Canadian refiners modify their own plants.", "112", ["2", "Comments"]], ["Novak Djokovic's relationship with line officials has been difficult of late and the Serbian risked their wrath again on Saturday when he suggested they were unnecessary.", "375", ["115", "Comments"]], ["Royal Challengers Bangalore captain Virat Kohli said he has a love-hate relationship with cricket after rediscovering his form in the Indian Premier League (IPL) in the United Arab Emirates.", "32", ["3", "Comments"]], ["Thousands of protesters marched through central Mexico City on Saturday in one of the biggest demonstrations against President Andres Manuel Lopez Obrador since he took office nearly two years ago.", "264", ["47", "Comments"]], ["The Pittsburgh Penguins re-signed goaltender Tristan Jarry on Saturday to a three-year, $10.5 million contract.", "33", ["2", "Comments"]], ["The number of confirmed coronavirus cases in Germany increased by 2,279 to 299,237, data from the Robert Koch Institute (RKI) for infectious diseases showed on Sunday.", "94", ["1", "Comment"]], ["Mexico's confirmed coronavirus cases rose to 757,953 on Saturday, according to the health ministry, with a total reported death toll of 78,880.", "190", ["14", "Comments"]], ["New daily coronavirus infections in Australia's hotspot of Victoria climbed back to double digits on Sunday with 12 cases recorded but authorities said the state is on track to be able to ease its social distancing restrictions in coming weeks.", "82", ["6", "Comments"]], ["New daily coronavirus infections in Australia's hotspot of Victoria climbed back to double digits on Sunday with 12 cases recorded but authorities said the state is on track to be able to ease its social distancing restrictions in coming weeks.", "46", ["6", "Comments"]], ["Brazil on Saturday registered 599 new coronavirus deaths and 26,310 new confirmed cases, the health ministry said.", "122", ["14", "Comments"]], ["China on Sunday reported 16 new coronavirus cases in the mainland for Oct. 3, compared with 10 cases a day earlier, the health authority said.", "192", ["34", "Comments"]], ["Mexico's confirmed coronavirus cases rose to 757,953 on Saturday, according to the health ministry, with a total reported death toll of 78,880.", "222", ["10", "Comments"]], ["The British government will routinely deny asylum to migrants who board boats to cross the English Channel or come to Britain through illegal routes, the Sunday Times reported https://www.thetimes.co.uk/…/priti-patel-no-asylum-for-ille….", "743", ["213", "Comments"]], ["Indonesian President Joko Widodo defended his record of fighting the COVID-19 pandemic, asking for no \"polemics\" or \"commotion\" amid criticism that he is putting the economy over public health.", "64", ["17", "Comments"]], ["Japan's Sony Corp <6758.T> and memory chipmaker Kioxia Holdings Corp <6600.T> have applied for U.S. approval to continue supplying Huawei Technologies Co Ltd [HWT.UL], Nikkei reported on Sunday.", "237", ["63", "Comments"]], ["The next America's Cup has come firmly into focus with all of the challenging syndicates' second generation hulls of the AC75 foiling monohulls expected to be in New Zealand on Sunday.", "125", ["5", "Comments"]], ["Atlanta Falcons wide receivers Julio Jones and Calvin Ridley are listed as questionable to play in Monday's game against the undefeated Green Bay Packers.", "21", ["2", "Comments"]], ["The next America's Cup has come firmly into focus with all of the challenging syndicates' second generation hulls of the AC75 foiling monohulls expected to be in New Zealand on Sunday.", "98", ["3", "Comments"]], ["American Danielle Collins threw the kitchen sink at former champion Garbine Muguruza to force her way into the fourth round of the French Open with a 7-5 2-6 6-4 victory on Saturday.", "280", ["4", "Comments"]], ["Britain reported 12,872 new COVID-19 cases on Saturday, a record daily figure for the country, with the government blaming the jump on a reporting delay and saying the numbers in coming days would include additional cases.", "256", ["19", "Comments"]], ["Kyrgyzstan votes in a parliamentary election on Sunday that will test President Sooronbai Jeenbekov's political capital and his ability to forge new alliances amid the worst economic crisis in two decades.", "42", ["3", "Comments"]], ["British Prime Minister Johnson's government will try to look beyond the coronavirus pandemic and Brexit, and honour Conservative Party election commitments in its agenda for the next year, Johnson's office said in a statement on Sunday.", "78", ["7", "Comments"]], ["The United States said on Saturday that it welcomed the establishment of a transitional government in Mali as \"an initial step towards a return to constitutional order.\"", "123", ["22", "Comments"]], ["The outlook for the aviation industry has deteriorated again due to rising coronavirus infections and renewed travel restrictions, Airbus chief operating officer Michael Schoellhorn was quoted as saying on Saturday.", "76", ["9", "Comments"]], ["Cineworld, the world's second-biggest cinema operator, is set to close all its screens in the United Kingdom and Ireland as soon as the coming week, London's Sunday Times reported on Saturday.", "272", ["1", "Comments"]], ["American Danielle Collins threw the kitchen sink at former champion Garbine Muguruza to force her way into the fourth round of the French Open with a 7-5 2-6 6-4 victory on Saturday.", "43", ["3", "Comments"]], ["The New England Patriots game at the Kansas City Chiefs will not be played Sunday amid positive COVID-19 tests for both teams, the NFL said Saturday.", "62", ["13", "Comments"]], ["Having reached the third round on their French Open main draw debut, most teenagers might be content with merely pushing a two-time Grand Slam champion to the limit before losing.", "20", ["7", "Comments"]], ["Ireland is seeing a \"significant escalation\" in COVID-19 infections, the acting chief medical officer said on Saturday after reporting the highest number of daily cases since late April.", "286", ["30", "Comments"]], ["Thousands of Israelis protested across the country on Saturday, flouting a new law meant to curb anti-government demonstrations during a coronavirus lockdown.", "326", ["89", "Comments"]], ["The outlook for the aviation industry has deteriorated again due to rising coronavirus infections and renewed travel restrictions, Airbus chief operating officer Michael Schoellhorn was quoted as saying on Saturday.", "51", ["14", "Comments"]], ["Cineworld Group Plc is set to close all its theatre screens in the UK and Ireland, with plans to close its UK sites as soon as the coming week, London's Sunday Times reported.", "74", ["5", "Comments"]], ["Honda Motor Co <7267.T> said on Saturday it has confirmed a 17th U.S. death tied to a faulty Takata air bag inflator.", "74", ["16", "Comments"]], ["Former champion Jelena Ostapenko was knocked out of the French Open, beaten 6-4 6-3 by Spain's Paula Badosa in the third round on Saturday.", "18", ["5", "Comments"]], ["Having reached the third round on their French Open main draw debut, most teenagers might be content with merely pushing a two-time Grand Slam champion to the limit before losing.", "483", ["12", "Comments"]], ["Tunisian authorities will ban all gatherings and reduce working hours for employees in the public sector in order to stop the rapid spread of the coronavirus, Prime Minister Hichem Mechichi said on Saturday.", "215", ["8", "Comments"]], ["A look at the key facts and records of Germany's Alexander Zverev and Italian Jannik Sinner before their French Open fourth-round match on Sunday (prefix number denotes seeding):", "16", ["1", "Comment"]], ["Los Angeles Lakers forward Anthony Davis has been making the most of his first trip to the NBA Finals with a pair of spectacular performances that have left him two wins shy of a maiden championship and with a grip on the series' MVP trophy.", "659", ["10", "Comments"]], ["Just days after being fired by the Los Angeles Clippers, Doc Rivers was introduced as the new head coach of the Philadelphia 76ers on Saturday.", "1.2K", ["5", "Comments"]], ["Indonesia moved a step closer to passing President Joko Widodo's contentious \"Job Creation\" bill after parliament's legislation committee and government ministers on Saturday approved the latest version for a vote next week.", "40", ["7", "Comments"]], ["Novak Djokovic's relationship with line officials has been difficult of late and the Serbian risked their wrath again on Saturday when he suggested they were unnecessary.", "1.1K", ["228", "Comments"]], ["The outlook for the aviation industry has deteriorated again due to rising coronavirus infections and renewed travel restrictions, Airbus chief operating officer Michael Schoellhorn was quoted as saying on Saturday.", "172", ["29", "Comments"]], ["Britain reported 12,872 new COVID-19 cases on Saturday, a record daily figure for the country, with the government blaming the jump on a reporting delay and saying the numbers in coming days would include additional cases.", "271", ["52", "Comments"]], ["Egypt on Saturday put on show dozens of coffins belonging to priests and clerks from the 26th dynasty nearly 2,500 years ago, with archaeologists saying tens more were found in the vast Saqqara necropolis just days ago.", "1.8K", ["83", "Comments"]], ["Thousands of Israelis protested across the country on Saturday, flouting a new law meant to curb anti-government demonstrations during a coronavirus lockdown.", "620", ["55", "Comments"]], ["The U.S. Centers for Disease Control and Prevention (CDC) on Saturday reported 7,310,625 cases of the new coronavirus, an increase of 50,160 from its previous count, and said that the number of deaths had risen by 816 to 208,118.", "128", ["6", "Comments"]], ["The Nigerian unit of oil major Chevron <CVX.N> plans to cut its local workforce by 25% to reduce costs, it said on Saturday, due to weak demand for oil in the wake of the coronavirus pandemic.", "30", ["10", "Comments"]], ["India's federal police will investigate the alleged gang rape of a young woman in northern Uttar Pradesh state whose death sparked nationwide protests, the local government said in a statement on Saturday.", "238", ["32", "Comments"]], ["A protest in Chilean capital Santiago was marred by a controversial incident late on Friday when a teenage boy fell from a bridge into a river during police clashes, with demonstrators alleging security forces were to blame.", "45", ["8", "Comments"]], ["Guatemalan authorities sent more than 2,000 Honduran migrants back to their home country over the past few days, officials said on Saturday, appearing to dissolve much of a caravan aiming to reach the United States.", "258", ["16", "Comments"]], ["France on Saturday reported nearly 17,000 new confirmed coronavirus infections over the last 24 hours, setting a new daily record.", "167", ["28", "Comments"]], ["Ireland is seeing a \"significant escalation\" in COVID-19 infections, the acting chief medical officer said on Saturday after reporting the highest daily death toll since May and the third-highest number of daily cases recorded to date.", "313", ["25", "Comments"]], ["Pope Francis travelled outside Rome on Saturday for the first time since the coronavirus pandemic broke out to sign his latest encyclical in the crypt where St. Francis of Assisi is buried.", "60", ["16", "Comments"]], ["U.S. President Donald Trump is \"doing very well\" and is fever-free at a military hospital where he is being treated for COVID-19, the president's doctor said. But a person familiar with the situation said some of Trump's vital signs over the last 24 hours were very concerning...", "79", ["38", "Comments"]], ["British Prime Minister Boris Johnson and the head of the EU's executive, Ursula von der Leyen, agreed in a phone call on Saturday to step up Brexit talks to close \"significant gaps\" barring a new trade partnership.", "160", ["17", "Comments"]], ["Czech Prime Minister Andrej Babis' party won in 10 of 13 regional elections on Saturday in a vote seen as an indicator of support for his party's handling of the country's second wave of the fast-increasing coronavirus outbreak.", "74", ["13", "Comments"]], ["The reigning Super Bowl champions Kansas City Chiefs' game on Sunday against the visiting New England Patriots will be rescheduled after positive COVID-19 tests impacting both teams, the NFL said on Saturday.", "65", ["13", "Comments"]], ["U.S. Senate Majority Leader Mitch McConnell said on Saturday that all Senate floor activity would be rescheduled until after October 19, but committee work, like the confirmation hearing for President Donald Trump's Supreme Court nominee Amy Coney Barrett, would continue.", "1.4K", ["418", "Comments"]], ["Turkey rejected \"superficial\" demands for a ceasefire on Saturday in the South Caucasus, where it backs Azerbaijan, after a week of fierce fighting with ethnic Armenian forces in the breakaway Nagorno-Karabakh enclave.", "1K", ["1K", "Comments"]], ["Spain's Unicaja and Liberbank are holding informal talks about a potential tie-up to create the country's fifth-biggest lender with over 100 billion euros ($117.13 billion) in total assets, a source with knowledge of the matter said.", "53", ["3", "Comments"]], ["Tunisia's Ons Jabeur became the first Arab woman to reach the fourth round of the French Open as she beat eighth seed Aryna Sabalenka 7-6(7) 2-6 6-3 on Saturday.", "2.7K", ["41", "Comments"]], ["Prime Minister Viktor Orban's government agreed with the Hungarian Medical Chamber on a substantial wage hike for doctors on Saturday, as the country braces for a further rise in coronavirus cases that could strain its healthcare system.", "215", ["10", "Comments"]], ["Former New Jersey governor Chris Christie has tested positive for coronavirus and will be receiving medical attention, Christie wrote on Twitter on Saturday.", "775", ["315", "Comments"]], ["Armenia said on Saturday it would use \"all necessary means\" to protect ethnic Armenians from attack by Azerbaijan, as the opposing sides pounded each other for a seventh day and the latest international peace call fell on deaf ears.", "363", ["525", "Comments"]], ["Tunisia's Ons Jabeur became the first Arab woman to reach the fourth round of the French Open as she beat eighth seed Aryna Sabalenka 7-6(7) 2-6 6-3 on Saturday.", "137", ["14", "Comments"]], ["The final vessel in a flotilla of three Iranian fuel tankers entered gasoline-starved Venezuela's waters on Saturday, in the latest sign of cooperation between the two countries amid protests over shortages in the South American nation.", "247", ["31", "Comments"]], ["Britain has to make sure that British firms are not subject to predatory takeover bids from foreign states, trade minister Liz Truss said on Saturday.", "111", ["15", "Comments"]], ["Pope Francis travelled outside Rome on Saturday for the first time since the coronavirus pandemic broke out to sign his latest encyclical in the crypt where St. Francis of Assisi is buried.", "83", ["11", "Comments"]], ["Egypt on Saturday put on show dozens of coffins belonging to priests and clerks from the 26th dynasty nearly 2,500 years ago, with archaeologists saying tens more were found in the vast Saqqara necropolis just days ago.", "15K", ["499", "Comments"]], ["British foreign minister Dominic Raab said the European Union no longer has the power to treat Britain poorly, and any deal on its future relationship with the bloc must be fair.", "225", ["44", "Comments"]], ["Tunisia's Ons Jabeur became the first Arab woman to reach the fourth round of the French Open as she beat eighth seed Aryna Sabalenka 7-6(7) 2-6 6-3 on Saturday.", "11K", ["286", "Comments"]], ["Police set up controls and stopped cars on major roads into and out of Madrid on Saturday as the city went back into lockdown due to surging coronavirus cases.", "257", ["9", "Comments"]], ["Attackers set off a truck bomb in Afghanistan's eastern Nangarhar province on Saturday, killing at least 15 people and wounding dozens, according to provincial officials, as violence continues in the war-torn nation despite peace talks taking place in Qatar.", "259", ["24", "Comments"]], ["Business is booming at a sea dock in western Turkey, where five hulking cruise ships are being dismantled for scrap metal sales after the COVID-19 pandemic all but destroyed the industry, the head of a ship recyclers' group said on Friday.", "123", ["9", "Comments"]], ["Indonesia reported 4,007 new coronavirus infections and 83 more deaths on Saturday, bringing its total infections to 299,506 and fatalities to 11,055, health ministry data showed.", "99", ["6", "Comments"]], ["Poland reported a new record of 2,367 daily coronavirus cases on Saturday, the health ministry said on Twitter, the third day in a row that infections have hit new highs.", "293", ["15", "Comments"]], ["E-commerce firm Shopee has reversed a ban on a store linked to a dissolved opposition party in Thailand, a spokeswoman said, after online criticism of its perceived pro-government stance.", "84", ["1", "Comment"]], ["This text is one that federal agents say expressed excitement between two St. Louis police officers ahead of a shift where an undercover Black police officer posing as a demonstrator was later beaten and badly injured.  A top Trump official in St. Louis was rebuffed in an attempt to launch a wide probe of the local police. Reuters finds how the Justice Department retreated from policing America’s police https://reut.rs/2SlwiY4", "581", ["31", "Comments"]], ["Ukraine reported 4,661 new coronavirus cases on Saturday, a daily record number of infections, which spiked in late September.", "89", ["4", "Comments"]], ["Republican U.S. Senator Ron Johnson, who heads the Senate Homeland Security and Governmental Affairs Committee, tested positive for COVID-19 on Friday, a spokesman said on Saturday.", "673", ["134", "Comments"]], ["Piedmont Lithium said it signed a five-year deal with Tesla to supply high-purity lithium ore mineral to the U.S. electric carmaker, prompting an 83% surge in the Australian lithium miner's shares https://reut.rs/33bToGN", "76", ["2", "Comments"]], ["A long-delayed flood barrier system successfully protected Venice from a high tide for the first time on Saturday, bringing big relief to the lagoon city after years of repeated inundations.", "2.1K", ["88", "Comments"]], ["Concealing one's COVID-19 infection should carry the severest penalty, Iranian President Hassan Rouhani said on Saturday in announcing new measures to stem a rapid rise in cases.", "151", ["7", "Comments"]], ["President Tayyip Erdogan said on Saturday that Turkey supports the \"oppressed\" in the Caucasus, where Ankara has backed Azerbaijan in its week of fierce fighting against ethnic Armenian forces in the breakaway Nagorno-Karabakh enclave.", "679", ["607", "Comments"]], ["Britain's foreign minister Dominic Raab said he worried for Boris Johnson's life when the prime minister was hospitalised with COVID-19 in April.", "74", ["3", "Comments"]], ["The NBA is not likely to have a break next season when the postponed Olympics are held, league commissioner Adam Silver said, casting doubt on the availability of NBA players at the Tokyo Games.", "631", ["63", "Comments"]], ["Malaysia will not re-impose widespread coronavirus restrictions on travel despite a recent spike in infections, which a government minister said was partly caused by migrants from neighbouring countries.", "98", ["5", "Comments"]], ["A warm welcome and expressions of solidarity against China likely await U.S. Secretary of State Mike Pompeo next week when he visits East Asia for the first time in over a year, but the looming U.S. election means Asian allies will think twice before making concrete promises...", "90", ["49", "Comments"]], ["A French attempt to relaunch peace talks over Nagorno-Karabakh showed no sign of a breakthrough on Saturday as Azerbaijan blamed Armenia for re-igniting their decades-old conflict.", "116", ["140", "Comments"]], ["Singapore reported on Saturday new coronavirus cases in the single digits for the first time since March.", "221", ["11", "Comments"]], ["Malaysia reported a record daily increase in novel coronavirus cases for the second day in a row on Saturday, with 317 new infections.", "89", ["17", "Comments"]], ["British Prime Minister Boris Johnson launched a review aimed at improving transport links across the UK, including a possible bridge between Scotland and Northern Ireland, as part of a plan to boost the pandemic-hit economy and strengthen ties between its member nations.", "100", ["25", "Comments"]], ["Germany's Foreign Minister Heiko Maas has called for new European Union sanctions against Russia over the poisoning of opposition leader Alexei Navalny with an internationally banned nerve agent.", "1.1K", ["90", "Comments"]], ["South Korean police mobilised hundreds of buses to head off any political rallies in the capital, Seoul, on Saturday with authorities determined to prevent another cluster of novel coronavirus cases emerging from a protest.", "202", ["24", "Comments"]], ["Venice deployed its long-delayed flood barriers for the first time on Saturday as forecasters warned that storms could combine with high tides to inundate the city.", "709", ["22", "Comments"]], ["The Czech Republic recorded 3,793 new coronavirus cases on Friday, a second straight record for the highest daily count, data released by the Health Ministry on Saturday showed.", "237", ["13", "Comments"]], ["Hall of Fame pitcher and two-time World Series champion for the St. Louis Cardinals Bob Gibson died on Friday at the age of 84 from pancreatic cancer, Major League Baseball (MLB) said.", "224", ["6", "Comments"]], ["Britain's foreign minister Dominic Raab said he worried for Boris Johnson's life when the prime minister was hospitalised with COVID-19 in April.", "86", ["6", "Comments"]], ["Home rental company Airbnb Inc is aiming to raise around $3 billion in its upcoming initial public offering (IPO), people familiar with the matter said on Friday, taking advantage of the unexpectedly sharp recovery in its business after the COVID-19 pandemic roiled the travel...", "32", ["3", "Comments"]], ["Electric vehicle maker Polestar, owned by Volvo Cars and its parent China's Geely, is recalling all new Polestar 2 cars due to a software glitch, business daily Dagens Industri (DI) said on Friday.", "117", ["3", "Comments"]], ["U.S. employment growth slowed more than expected in September and over 300,000 Americans lost their jobs permanently, dealing a potential blow to President Donald Trump ahead of the fiercely contested Nov. 3 presidential election.", "564", ["393", "Comments"]], ["Investors on Wall Street can add another layer of uncertainty to a market already unnerved by last month's sell-off, stalled fiscal stimulus and President Donald Trump's COVID-19 diagnosis, which weighed on stocks on Friday.", "129", ["144", "Comments"]], ["LeBron James took another step toward his fourth championship title on Friday, as the dominant Los Angeles Lakers clinched Game 2 over the Miami Heat 124-114 to extend their lead to 2-0 in the NBA Finals.", "2.2K", ["58", "Comments"]], ["India's death toll from the novel coronavirus rose past 100,000 on Saturday, only the third country in the world to reach that bleak milestone, after the United States and Brazil, and its epidemic shows no sign of abating.", "404", ["44", "Comments"]], ["Sudan’s power-sharing government and several rebel groups are due to formalise a peace agreement on Saturday aimed at resolving decades of regional conflicts which left millions displaced and hundreds of thousands dead.", "129", ["1", "Comment"]], ["Police in Australia's coronavirus hotspot state of Victoria stepped up patrolling on Saturday as hundreds of people in the city of Melbourne breached stringent lockdown restrictions and flocked to beaches on the warmest weekend in months.", "96", ["6", "Comments"]], ["Italy's far-right leader Matteo Salvini goes to court on Saturday to try to persuade a judge not to charge him with illegally detaining migrants at sea - a crime that carries a maximum 15-year prison term.", "134", ["64", "Comments"]], ["Bogota, the Colombian capital, will see a second outbreak of coronavirus cases, possibly between November and December, which will hopefully be less severe than the first wave, Bogota's mayor, Claudia Lopez, said on Friday.", "62", ["2", "Comments"]], ["Mainland China reported 10 new COVID-19 cases on Friday, the same as a day earlier, the health authority said on Saturday.", "123", ["35", "Comments"]], ["The United States is opening an investigation into whether Vietnam has been undervaluing its currency and harming U.S. commerce, the U.S. Trade Representative's office said in a statement on Friday.", "396", ["74", "Comments"]], ["Early voting began in New Zealand on Friday with Prime Minister and Labour Party leader Jacinda Ardern seen securing a second term in office on the back of her success in handling the coronavirus pandemic and other crises.", "487", ["74", "Comments"]], ["Coronavirus survivors are gathering online Sunday to honor the more than 207,000 U.S. lives lost in the pandemic and call for a national strategy to halt its relentless march.", "698", ["82", "Comments"]], ["The U.S. labor market is recovering more slowly and it could take two to three years for the unemployment rate to return to levels seen in February as companies adjust to smaller staffs and workers retrain for new careers, Cleveland Federal Reserve Bank President Loretta...", "109", ["21", "Comments"]], ["Canada is probing allegations that Azeri forces involved in fighting with Armenia are using Canadian drone technology that was initially exported to Turkey, Prime Minister Justin Trudeau said on Friday.", "422", ["214", "Comments"]], ["At least 18 members of the U.S. House of Representatives and Senate - 10 Republicans and eight Democrats - have tested positive or are presumed to have had COVID-19, with Senator Mike Lee becoming the latest on Friday.", "834", ["230", "Comments"]], ["The chief executives of Facebook <FB.O, Twitter <TWTR.N> and Alphabet-owned Google <GOOGL.O> have agreed to voluntarily testify at a hearing before the Senate Commerce Committee on Oct. 28 about a key law protecting internet companies.", "104", ["13", "Comments"]], ["A mass roll-out of a COVID-19 vaccine in Britain could be finished in as little as three months, the Times reported, citing government scientists.", "197", ["15", "Comments"]], ["Republican Senator Thom Tillis, a member of the Senate Judiciary Committee, says he has tested positive for the coronavirus https://reut.rs/33nH7Pq", "937", ["194", "Comments"]], ["A mass roll-out of a COVID-19 vaccine in Britain could be finished in as little as three months, the Times reported, citing government scientists.", "154", ["9", "Comments"]], ["The following is a roundup of some of the latest scientific studies on the novel coronavirus and efforts to find treatments and vaccines for COVID-19, the illness caused by the virus.", "178", ["79", "Comments"]], ["California fire crews deploying water-dropping helicopters made a defensive stand on Friday against flames raging in the foothills of the Napa Valley wine region as forecasts called for a return of dangerous high winds and hot weather this weekend.", "422", ["1", "Comment"]], ["Electric vehicle maker Polestar, owned by Volvo Cars and its parent China's Geely, is recalling all new Polestar 2 cars due to a software glitch, business daily Dagens Industri (DI) said on Friday.", "574", ["6", "Comments"]], ["U.S. House Speaker Nancy Pelosi and Treasury Secretary Steven Mnuchin spoke for 65 minutes on Friday, her spokesman wrote in a post on Twitter, continuing their talks over a possible fresh coronavirus aid package.", "253", ["72", "Comments"]], ["The U.S. House of Representatives on Friday voted to condemn the online pro-Trump conspiracy theory known as “QAnon,” but 17 Republicans opposed the non-binding resolution, whose sponsor Democrat Representative Tom Malinowski said he has received death threats.", "2.1K", ["595", "Comments"]], ["Renault will meet their obligations under the rules if Red Bull ask for an engine supply after Honda leave Formula One at the end of 2021, the French team's boss Cyril Abiteboul said on Friday.", "64", ["2", "Comments"]], ["Google's bid to win EU approval for its $2.1 billion purchase of Fitbit faces headwinds as rivals and customers argue concessions to EU antitrust regulators do not go far enough, two people familiar with the matter said on Friday.", "30", ["2", "Comments"]], ["Tracing Trump's contacts: A look at the president's busy week before announcing his COVID-19 diagnosis. https://reut.rs/3cQFRYn", "261", ["165", "Comments"]], ["California's health secretary on Friday agreed to hear more input from theme park operators before issuing reopening guidelines, a step that further delays Walt Disney Co's <DIS.N> plans to welcome visitors back to Disneyland.", "101", ["6", "Comments"]], ["French President Emmanuel Macron said in a statement he had spoken on the phone successively with the prime minister of Armenia and the president of Azerbaijan about the situation in Nagorno-Karabakh and had proposed a new method to restart talks within the Minsk group.", "285", ["283", "Comments"]], ["China accused the United States on Friday of \"fabricating lies\" and trying to take the world back to the \"jungle age\" after Washington blamed Beijing and U.N. agencies for \"the murder of millions of baby girls.\"", "808", ["321", "Comments"]], ["The Speaker of the U.S. House of Representatives, Nancy Pelosi, said on Friday that negotiations with the White House on a coronavirus relief package are continuing, but she is waiting for a response from the White House on five key areas.", "745", ["183", "Comments"]], ["U.S. President Donald Trump said on Friday that he had tested positive for COVID-19 and was going into isolation.", "370", ["199", "Comments"]], ["The United States imposed sanctions on eight Belarusian officials on Friday, accusing them of involvement in rigging President Alexander Lukashenko's re-election victory in August or the violent crackdown on protests that followed.", "149", ["24", "Comments"]], ["Canada will maintain restrictions on non-essential travel with the United States until the coronavirus outbreak in both nations is much less serious, a senior government official said on Friday.", "437", ["40", "Comments"]], ["Home rental company Airbnb Inc is aiming to raise around $3 billion in its upcoming initial public offering (IPO), people familiar with the matter said on Friday, taking advantage of the unexpectedly sharp recovery in its business after the COVID-19 pandemic roiled the travel...", "27", ["8", "Comments"]], ["Business is booming at a sea dock in western Turkey, where five hulking cruise ships are being dismantled for scrap metal sales after the COVID-19 pandemic all but destroyed the industry, the head of a ship recyclers' group said on Friday.", "189", ["31", "Comments"]], ["French President Emmanuel Macron said in a statement he had spoken on the phone successively with the prime minister of Armenia and the president of Azerbaijan about the situation in Nagorno-Karabakh and had proposed a new method to restart talks within the Minsk group.", "579", ["422", "Comments"]], ["U.S. President Donald Trump said on Friday that he had tested positive for COVID-19 and was going into isolation.", "616", ["503", "Comments"]], ["The acting chief of the Department of Homeland Security's intelligence office on Friday said he agrees with the FBI director and other administration officials that white supremacists are an active threat to public order.", "5.9K", ["819", "Comments"]], ["This was a text U.S. federal agents say was sent by a police officer to his colleague ahead of a shift where both confronted a Black protestor. He was beaten and badly injured. No video footage but he was a credible witness: an undercover cop, posing as a demonstrator https://reut.rs/33m98qy", "964", ["173", "Comments"]], ["The U.S. Justice Department on Friday said it was appealing a judge's decision to block the government from barring Apple Inc <AAPL.O> and Alphabet Inc's <GOOGL.O> Google from offering Chinese-owned messaging app WeChat for download in U.S. app stores.", "95", ["13", "Comments"]], ["Disgraced film producer Harvey Weinstein has been charged with six more counts of forcible sexual assault in Los Angeles, the Los Angeles District Attorney said on Friday.", "811", ["64", "Comments"]], ["U.S. President Donald Trump said on Friday that he had tested positive for COVID-19 and was going into isolation.", "476", ["262", "Comments"]], ["Galvanised by the alleged gang-rape of a young woman who died of her injuries earlier this week, political parties representing India's downtrodden Dalit community held protests in several cities on Friday.", "374", ["18", "Comments"]], ["Democratic presidential candidate Joe Biden headed to the battleground state of Michigan to resume campaigning on Friday after testing negative for COVID-19, hours after President Donald Trump was sidelined by contracting the virus.", "2.3K", ["309", "Comments"]], ["How the U.S. Justice Department disarmed its police reform effort: The Trump administration opened just one investigation of alleged misconduct by police departments, sidelining the federal government's top way to watchdog cops at a time of growing outcry over use of force against civilians https://reut.rs/3cSYUkT", "341", ["32", "Comments"]], ["Republican U.S. Senator Mike Lee on Friday said he had tested positive for COVID-19 and would remain isolated for 10 days, but said he would be back to work in time to consider the Supreme Court nomination of Judge Amy Coney Barrett.", "470", ["135", "Comments"]], ["Investors on Wall Street can add another layer of uncertainty to a market already unnerved by last month's sell-off, stalled fiscal stimulus, and by President Donald Trump's COVID-19 diagnosis, which weighed on stocks on Friday.", "144", ["69", "Comments"]], ["Tesla Inc has agreed to acquire German ATW Automation, a supplier assembling battery modules and packs for the auto industry, a source familiar with the transaction said on Friday.", "241", ["4", "Comments"]], ["House Speaker Nancy Pelosi said Friday that agreement was \"imminent\" on a deal to provide another $25 billion in government assistance to keep tens of thousands of airline workers on the job for another six months.", "352", ["83", "Comments"]], ["How U.S. Justice Department disarmed its police reform effort: The Trump administration has opened just one investigation of alleged misconduct by America’s police departments, sidelining the federal government's chief means of watch-dogging police at a time of growing outcry over officers' use of force against civilians https://reut.rs/34kdSwb", "318", ["92", "Comments"]], ["Kentucky's attorney general on Friday released audio recordings of the grand jury proceedings that cleared three policemen of homicide charges in the shooting death of Breonna Taylor.", "277", ["89", "Comments"]], ["We’d like to hear your story if you’ve had to relocate due to California’s wildfires, once you’re safe. Contact us here: https://reut.rs/3jl2Ihd", "36", ["2", "Comments"]], ["Ford Motor Co <F.N> on Friday continued to show signs of a recovery from the COVID-19 pandemic as demand for sports utility vehicles and pickup trucks helped boost third-quarter sales in the United States.", "74", ["3", "Comments"]], ["The U.S. Supreme Court on Friday agreed to hear an appeal by energy companies including BP PLC, Chevron Corp, Exxon Mobil Corp and Royal Dutch Shell PLC contesting a lawsuit by the city of Baltimore seeking damages for the impact of global climate change.", "100", ["18", "Comments"]], ["If you feel that your perception of time has changed recently, you are not alone. Here are four ways to make time feel more meaningful https://reut.rs/2ScZzEa", "1.1K", ["6", "Comments"]], ["The U.S. Supreme Court on Friday agreed to hear a bid by Arizona Republicans to enforce two voting restrictions in the state that were struck down by a lower court as disproportionately burdening Black, Hispanic and Native American voters.", "576", ["103", "Comments"]], ["(The opinions expressed here are those of the author, a columnist for Reuters.)", "130", ["37", "Comments"]], ["Tesla Inc <TSLA.O> on Friday said it delivered 139,300 vehicles in the third quarter, a quarterly record for the electric carmaker, but shares fell 5.7% in pre-market trading.", "72", ["3", "Comments"]], ["WHO holds a coronavirus briefing hours after Trump tests positive Top officials from the World Health Organization give a press briefing on the latest developments in the COVID-19 pandemic.", "788", ["612", "Comments"]], ["Mexican President Andres Manuel Lopez Obrador on Friday said he suspected an ulterior motive behind a caravan of more than 2,000 migrants from Central America that set out just a month before the U.S. presidential election.", "635", ["318", "Comments"]], ["Galvanised by the alleged gang-rape of a young woman who died of her injuries earlier this week, political parties representing India's downtrodden Dalit community held small protests in several cities on Friday.", "218", ["50", "Comments"]], ["Galvanised by the alleged gang-rape of a young woman who died of her injuries earlier this week, political parties representing India's downtrodden Dalit community held small protests in several cities on Friday.", "238", ["22", "Comments"]], ["Denmark will cull around 1 million mink after finding further coronavirus infections among the animals at farms that breed them for their fur, authorities said.", "233", ["38", "Comments"]], ["Facebook's run-ins with EU privacy regulators may escalate as Europe's top court next week weighs arguments from the Belgian data protection watchdog that it should have the power to go after the U.S. social media giant for breaches in Belgium.", "70", ["6", "Comments"]], ["Jeannie Weber could probably rebuild her ruined house in the foothills of California's Sierra Nevada mountains. But as wildfires rage with increasing frequency, it doesn't seem safe.", "164", ["11", "Comments"]], ["Cesar Hernandez says he has made thousands of phone calls since June urging Latinos in the battleground state of Wisconsin to support Democratic presidential candidate Joe Biden.", "163", ["155", "Comments"]], ["A Philippine senator on Friday sought an inquiry into what he described as \"censorship\" by Facebook after the social media giant took down a network of accounts it said were inauthentic including one the government supports.", "157", ["35", "Comments"]], ["Madrid will become the first European capital to go back to lockdown on Friday night as some 4.8 million residents of Spain’s capital and nine satellite towns will be barred from leaving due to the resurgent coronavirus https://reut.rs/2GaWtyc", "323", ["49", "Comments"]], ["U.S. schools from kindergarten to high school have avoided a spike in COVID-19 cases, early data show, but medical experts say the real test is coming as students in large densely-populated cities such as New York and Miami return to classrooms.", "316", ["5", "Comments"]], ["President Emmanuel Macron pledged on Friday to fight \"Islamist separatism\" which he said was threatening to take control in some Muslim communities around France.", "791", ["300", "Comments"]], ["U.S. jobs report: The September jobs report showed continued increases in employment after record losses in April https://reut.rs/3cVlJ7h", "48", ["9", "Comments"]], ["LIVE: NYSE opens after Trump tests positive for COVID-19", "540", ["161", "Comments"]], ["Honda's exit from Formula One at the end of next year is bad news for all motorsport, the founder of the electric Formula E series Alejandro Agag said on Friday.", "29", ["3", "Comments"]], ["Wisconsin registered a record increase in new COVID-19 cases on Thursday, while New York state reported a worrisome uptick of positive coronavirus tests in 20 ‘hot spots’ https://reut.rs/3l6WUZ8", "111", ["126", "Comments"]], ["Walmart Inc <WMT.N> expects to record a non-cash loss of about $2.5 billion this fiscal year due to the sale of its British supermarket chain Asda, the retailer said on Friday.", "101", ["25", "Comments"]], ["U.S. Health Secretary Alex Azar testifies before the House Select Subcommittee on the coronavirus crisis.", "268", ["155", "Comments"]], ["U.S. job growth slows more than expected as the economic recovery shifts into a lower gear https://reut.rs/2EXfm74", "132", ["25", "Comments"]], ["Intel Corp on Friday said that it has won a second-phase contract in a project aimed at helping the U.S. military make more advanced semiconductors within the United States.", "65", ["6", "Comments"]], ["U.S. economy adds 661,000 jobs in September, unemployment rate falls to 7.9%", "206", ["63", "Comments"]], ["Like two U.S. presidents before him, President Trump could temporarily hand over power to his vice president should he become incapacitated. Here's how Mike Pence could temporarily assume control https://reut.rs/34itfFl", "187", ["132", "Comments"]], ["Uber Technologies Inc <UBER.N> said on Friday New York-based private equity firm Greenbriar Equity Group would invest $500 million in its logistics arm, Uber Freight, valuing the unit at $3.3 billion on a post-money basis.", "21", ["2", "Comments"]], ["Small rivals of Alphabet Inc's <GOOGL.O> Google say signs are emerging of more benevolent behavior from the online advertising leader amid accusations by the U.S. government and states that the company uses its dominance to thwart competition.", "219", ["2", "Comments"]], ["In his own words: President Trump is in quarantine after testing positive for COVID-19. Here is a timeline of some of the U.S. president's comments about the outbreak https://reut.rs/3laQKqD", "436", ["221", "Comments"]], ["The British billionaire Issa brothers and private equity group TDR Capital have agreed to buy the British supermarket chain Asda from Walmart <WMT.L> for an enterprise value of $8.8 billion and plan to roll out more smaller stores.", "904", ["6", "Comments"]], ["President Trump said he and First Lady Melania Trump had tested positive for the coronavirus and were entering quarantine, just a month before the presidential election. Here are some reactions around the world https://reut.rs/3naLe9v", "392", ["229", "Comments"]], ["U.S. Secretary of State Mike Pompeo said on Friday he was reconsidering his upcoming trip to Asia as a precaution after President Donald Trump and his wife tested positive to coronavirus.", "462", ["99", "Comments"]], ["Japan's Honda Motor will end its participation as an engine supplier in the FIA Formula One World Championship at the end of the 2021 season to focus on zero-emission technology, it said on Friday.", "1.3K", ["93", "Comments"]], ["The Republican governor of Texas said each county in the state will be limited to a single site for dropping off absentee ballots, drawing condemnation from Democrats and voting rights advocates https://reut.rs/3neZr5s", "1K", ["219", "Comments"]], ["The Federal Reserve would likely step-in to support financial markets if the outcome of the U.S. presidential election was contested, a move which would benefit stocks in the tech sector, BofA analysts wrote in their weekly fund flow report on Friday.", "71", ["3", "Comments"]], ["The House of Representatives approved a $2.2 trillion Democratic plan to provide more economic relief from the coronavirus pandemic, as a bipartisan deal continued to elude House Speaker Nancy Pelosi and the White House https://reut.rs/33kEWME", "317", ["109", "Comments"]], ["Red Bull respect engine supplier Honda's decision to leave Formula One at the end of 2021 and are well equipped to deal with the 'obvious challenges' presented by the departure, team boss Christian Horner said on Friday.", "86", ["6", "Comments"]], ["Police in Ethiopia's Oromiya region have arrested 503 people on accusations they planned to cause violence during an annual thanksgiving festival this weekend and seized guns and hand grenades, the state-run news agency reported.", "103", ["11", "Comments"]], ["Exclusive: A major non-profit health emergencies group has set up a global laboratory network to assess data from potential COVID-19 vaccines, allowing scientists and drugmakers to compare them and speed up selection of the most effective shots https://reut.rs/3naleeq", "64", ["2", "Comments"]], ["Tesla Inc chief executive Elon Musk indicated on Friday that the U.S. electric carmaker will make a foray into India in 2021.", "4.1K", ["145", "Comments"]], ["President Trump and the coronavirus: While facing sharp criticism for his response to the outbreak, the U.S. president has touted his management of the crisis. Here is a timeline of some of his comments https://reut.rs/3n5fbYB", "362", ["177", "Comments"]], ["A major non-profit health emergencies group has set up a global laboratory network to assess data from potential COVID-19 vaccines, allowing scientists and drugmakers to compare them and speed up selection of the most effective shots.", "78", ["3", "Comments"]], ["Norwegian oil and gas firm Equinor plans to cut its exploration staff by about 30% globally by 2023 to reduce costs as the COVID-19 pandemic reduces demand for petroleum, the company said on Friday.", "24", ["2", "Comments"]], ["Amazon said more than 19,000 of its U.S. frontline workers contracted the coronavirus this year, or 1.44% of the total, a disclosure sought by labor advocates who have criticized the COVID-19 response of the world’s largest online retailer https://reut.rs/33jtyk6", "212", ["5", "Comments"]], ["The Belarusian Foreign Ministry said on Friday it had compiled a list of people barred from entering Belarus in retaliation against sanctions imposed by the European Union.", "401", ["48", "Comments"]], ["President Donald Trump said he and first lady Melania Trump had tested positive for COVID-19 and were going into quarantine, upending the race for the White House https://reut.rs/3inTr6L", "2.9K", ["779", "Comments"]], ["An investigation by Finland's Financial Supervisory Authority has concluded that telecoms equipment maker Nokia's unexpected profit warning in October 2019 was in line with stock exchange rules on inside information, it said on Friday.", "91", ["2", "Comments"]], ["Armenia's foreign ministry said on Friday it was ready to engage with the Organization for Security and Cooperation in Europe (OSCE) to re-establish a ceasefire in Nagorno-Karabakh, where fighting has been raging since Sunday.", "903", ["614", "Comments"]], ["A wave of risk aversion swept markets after Trump said he had tested positive for COVID-19 and will isolate, weeks ahead of the U.S. presidential election https://reut.rs/3n9ws2P", "470", ["192", "Comments"]], ["More than 1 million people have died after contracting the novel coronavirus and over 33 million infected.", "167", ["68", "Comments"]], ["From Reuters Breakingviews: Trump’s COVID-19 diagnosis ends the virus immunity that markets have largely enjoyed. Investors are now on their own, writes Gina Chon https://reut.rs/36p1Xjt", "772", ["279", "Comments"]], ["President Trump’s tweet revealing that America’s first couple had tested positive for COVID-19 reverberated through world media and financial markets. Here are some reactions to the news https://reut.rs/36qopsw", "279", ["139", "Comments"]], ["EU leaders broke a diplomatic deadlock and imposed sanctions on Belarus after hours of summit talks, assuring Cyprus that the bloc would also punish Turkey if it continues oil and gas drilling in disputed areas of the Mediterranean https://reut.rs/33ncnOM", "154", ["32", "Comments"]], ["Kazakh banking and fintech firm Kaspi.kz said on Friday its proposed listing on the London Stock Exchange should go ahead this month.", "16", ["1", "Comment"]], ["Britain’s events industry warned Prime Minister Boris Johnson that more than 90,000 people in the exhibitions sector would be made redundant in the coming weeks unless he offered more support to replace a government job furlough scheme https://reut.rs/2ESIsV7", "57", ["3", "Comments"]], ["U.S. job growth likely slowed further in September as the recovery from the COVID-19 slump shifts into lower gear amid diminishing government money and a relentless pandemic, leaving many at the risk of being permanently unemployed.", "94", ["5", "Comments"]], ["European stocks slide after U.S. President Donald Trump tested positive for COVID-19, hitting equity markets globally https://reut.rs/3cS8vII", "590", ["105", "Comments"]], ["Many more British companies reported a fall in sales over the past three months than experienced an upswing, despite the lifting of lockdown restrictions for most parts of the economy, the British Chambers of Commerce said https://reut.rs/2HKvLfX", "36", ["4", "Comments"]], ["Exclusive: A major non-profit health emergencies group has set up a global laboratory network to assess data from potential COVID-19 vaccines, allowing scientists and drugmakers to compare them and speed up selection of the most effective shots https://reut.rs/2SfOMJg", "105", ["2", "Comments"]], ["Despite featuring the duo of LeBron James and Anthony Davis, and having two major-market teams playing in the Los Angeles Lakers and Miami Heat, Game 1 of the NBA Finals on Wednesday night drew record-low TV ratings.", "3.2K", ["793", "Comments"]], ["Scotland's First Minister Nicola Sturgeon lambasted one of her MPs who made a long train journey from London to Scotland despite having received a positive test result for COVID-19 https://reut.rs/3n9QDNT", "298", ["22", "Comments"]], ["Investments by China's Huawei are not regular market transactions but rather \"predatory actions\" and all countries should ban them, U.S. Secretary of State Mike Pompeo said in a newspaper interview on Friday.", "749", ["420", "Comments"]], ["Japan's financial watchdog will order the Tokyo Stock Exchange (TSE) to report swiftly on its system glitch that halted trading at the bourse for the whole day on Thursday, Finance Minister Taro Aso said.", "147", ["1", "Comment"]], ["Google has postponed the Australian roll-out of News Showcase citing regulatory complications, just three months after announcing the product, as the U.S. internet giant grapples with one of the most audacious attempts to police its activities.", "205", ["14", "Comments"]], ["U.S. stock futures extended losses after President Trump said he and his wife had tested positive for the coronavirus, weeks ahead of elections https://reut.rs/34io08H", "839", ["260", "Comments"]], ["President Trump said he and first lady Melania Trump had tested positive for COVID-19 and would immediately quarantine and begin the 'recovery process' https://reut.rs/2SkzByG", "4.9K", ["1.2K", "Comments"]], ["In the middle of a coronavirus lockdown in the Philippine capital, Grace Lagaday was struggling to breastfeed her newborn without milk storage bottles and nursing pads.", "41", ["2", "Comments"]], ["North Korean leader Kim Jong Un inspected recovery efforts in a flooded village, his latest visit to areas damaged by recent typhoons, while his sister reappeared in public for the first time in about two months, state media said on Friday.", "291", ["21", "Comments"]], ["Ahead of what's likely to be the world's largest initial public offering, China's Ant Group Co Ltd is asking lead bankers to personally sign confidentiality pacts and pressing some investors to explain why they should be allowed to attend marketing meetings, sources familiar...", "65", ["7", "Comments"]], ["If you’ve been forced to leave your home due to California’s wildfires, we’d like to hear your story once you’re in a safe place: https://reut.rs/3cM2zkl", "73", ["9", "Comments"]], ["Facebook Inc said on Thursday it would start promoting content from public Facebook Groups in users' news feeds and in search engine results, defying calls by watchdog groups to limit algorithmic recommendations ahead of U.S. elections next month.", "120", ["33", "Comments"]], ["The Tokyo Stock Exchange (TSE) resumed normal trading on Friday, with the main index starting slightly higher a day after the worst-ever outage brought the world's third-largest equity market to a standstill.", "50", ["7", "Comments"]], ["Cyber insurers and other financial institutions that facilitate payments to hackers to end cyberattacks risk running afoul of sanctions rules, the U.S. Treasury Department warned on Thursday.", "900", ["17", "Comments"]], ["Trump adviser Hope Hicks has tested positive for the coronavirus and is experiencing symptoms, a source says. Hicks traveled with Trump to Cleveland for the presidential debate along with other senior aides https://reut.rs/33lZ5SE", "1.4K", ["509", "Comments"]], ["Some 19,000 employees at American Airlines are in job purgatory. The Texas-based company’s chief executive, Doug Parker, said late on Wednesday that he was going ahead with furloughs and layoffs, though he could reverse the decision in the coming days if the U.S. Congress...", "112", ["23", "Comments"]], ["The U.S. House of Representatives on Thursday approved a $2.2 trillion Democratic plan for fresh relief from the coronavirus pandemic, though objections from the White House and top Republicans are likely to doom it in the Senate.", "330", ["166", "Comments"]], ["Armenian Prime Minister Nikol Pashinyan accused Turkey of \"once again advancing on a genocidal path\" and said Ankara's military was directly leading an offensive by Azeri forces against ethnic Armenian forces around Nagorno-Karabakh.", "958", ["836", "Comments"]], ["Fifty U.S. senators from both parties called on Thursday for President Donald Trump's administration to begin negotiating a bilateral trade agreement with Taiwan, part of a push by lawmakers for stronger U.S. action to counteract China.", "623", ["87", "Comments"]], ["The U.S. Environmental Protection Agency on Thursday reversed a Clinton administration-era policy that required major U.S. sources of hazardous air pollution like arsenic and lead to maintain pollution control technology throughout the lifetime of their operation, enabling...", "1.1K", ["99", "Comments"]], ["Oasis Petroleum Inc and Lonestar Resources US Inc's bankruptcy filings are the latest in a slew of restructurings that put oil-and-gas producers on track for their biggest year of bankruptcies since the 2016 shale downturn.", "150", ["27", "Comments"]], ["Democrat Joe Biden maintains a 9-point lead over President Donald Trump after their combative first debate, according to Reuters/Ipsos polling that shows most Americans have settled on their choice for president little more than a month before the Nov. 3 election.", "1.8K", ["638", "Comments"]], ["Corona Capital is a column updated throughout the day by Breakingviews columnists around the world with short, sharp pandemic-related insights.", "25", ["3", "Comments"]], ["Trading on the Tokyo Stock Exchange <.TOPX> was brought to a standstill by a hardware failure on Thursday, in the worst-ever outage for the world's third-largest equity market.", "25", ["4", "Comments"]], ["The CIA and National Security Agency directors opposed U.S. spy chief John Ratcliffe's decision to declassify and send to a top Republican lawmaker unverified Russian intelligence that may have been fabricated, according to current and former U.S. officials.", "426", ["91", "Comments"]], ["Welcome to The Great Reboot: All the latest on the #newnormal https://reut.rs/2SijzW0", "17", ["4", "Comments"]], ["Amazon.com Inc <AMZN.O> on Thursday said more than 19,000 of its U.S. frontline workers contracted the coronavirus this year, or 1.44% of the total, a disclosure long sought by labor advocates that had criticized its pandemic response.", "138", ["25", "Comments"]], ["Goldman Sachs Group Inc <GS.N> is buying General Motors Co's <GM.N> credit card business for about $2.5 billion, the Wall Street Journal reported on Thursday, citing people familiar with the matter.", "52", ["1", "Comment"]], ["U.S. coal baron Robert Murray, whose company Murray Energy filed for bankruptcy last year, has applied for federal benefits to treat his black lung disease after opposing more stringent coal dust regulations for years, according to report by West Virginia public radio.", "2.1K", ["527", "Comments"]], ["The Vatican's number two said on Thursday after talks with Mike Pompeo that the two sides' positions on China remained far apart and firmly asserted the Holy See's right to pursue an accord with Beijing denounced by the U.S. Secretary of State.", "543", ["106", "Comments"]], ["Washington state Governor Jay Inslee said on Thursday that Boeing Co's decision to shift all 787 production to South Carolina requires a review of the company's favorable tax treatment.", "158", ["36", "Comments"]], ["Armenia said on Thursday it had recalled its ambassador to Israel for consultations over Israeli arms sales to Azerbaijan.", "314", ["243", "Comments"]], ["Facilitating ransomware payments to sanctioned hackers may be illegal, the U.S. Treasury said on Thursday, signaling a crackdown on the fast-growing market for consultants who help organizations pay off cybercriminals.", "75", ["9", "Comments"]], ["A Belgian artist who has fought a seven-year legal battle to prove that Belgium's former King Albert II is her father secured a literally crowning success in court on Thursday when she officially became a princess.", "4.5K", ["205", "Comments"]], ["The U.S. economic recovery continued to advance at a slow pace over the past week, with signs that businesses were still rehiring workers but also that a gusher of government assistance earlier in the year may have run its course.", "42", ["5", "Comments"]], ["Exclusive: Before a judge halted a Trump panel from recommending new powers for police, it had been warned about shutting out public input by several of its own participants, internal records show https://reut.rs/33ilcZU", "370", ["110", "Comments"]], ["LIVE: Protests mark the anniversary of Catalan's failed independence declaration Members of Catalonia's separatist Committee for the Defense of the Republic (CDR) protest on the third anniversary of the region's failed declaration of independence from Spain.", "365", ["106", "Comments"]], ["U.S. airlines face a winter test of their finances and question marks over the reach of their domestic flight networks after failing, for now, to win fresh federal aid.", "44", ["11", "Comments"]], ["Texas counties will each be limited to a single site for voters to drop off their mail ballots ahead of Election Day, under a proclamation issued by Governor Greg Abbott on Thursday.", "5.9K", ["1.2K", "Comments"]], ["Large groups of Central American migrants heading to the United States from Honduras barged past armed Guatemalan security troops to force their way into Guatemala on Thursday.", "128", ["130", "Comments"]], ["The United States is entitled to more than $5.2 million from former National Security Agency contractor Edward Snowden's book royalties, a federal court ruled this week, according to the U.S. Department of Justice.", "939", ["164", "Comments"]], ["Russian President Vladimir Putin has fired off one appeal after another for a ceasefire between Azerbaijan and ethnic Armenian forces, but the new eruption of their old conflict highlights Moscow's declining leverage and the rising influence of Turkey.", "245", ["150", "Comments"]], ["Democratic presidential candidate Joe Biden has gained ground in betting markets over President Donald Trump following their first debate of the 2020 U.S. election campaign, two betting market aggregators said.", "2.3K", ["1K", "Comments"]], ["New York state reported an uptick of positive coronavirus tests in 20 \"hot spots\" on Thursday, while Midwest states also reported rising caseloads led by Wisconsin, where U.S. President Donald Tramp will hold rallies over the weekend.", "89", ["20", "Comments"]], ["The business of forecasting markets is fraught in the best of times, but 2020 has left many Wall Street strategists scrambling to make sense of the market https://reut.rs/3jnzdLI", "20", ["3", "Comments"]], ["European Union leaders need to tackle urgently disinformation on 5G technology, which is central to the bloc's economic recovery from COVID-19 and its plans to catch up with the United States and China, a study by telecoms lobby group ETNO showed.", "30", ["3", "Comments"]], ["Russia's two online platforms, retailer Ozon and online cinema ivi, are both considering initial public offerings in the United States later this year, two bankers familiar with the preparations told Reuters on Thursday.", "17", ["3", "Comments"]], ["Amazon appears to be taking the lead in making inroads with the Joe Biden camp, as Big Tech uses cash and connections to connect with the Democratic presidential candidate, a Reuters report reveals.", "171", ["141", "Comments"]], ["The French state will receive about 2.8 billion euros ($3.3 billion) in proceeds from the sale of the country's 5G spectrum sale following an auction that ended on Thursday, the country's telecoms regulator said.", "137", ["3", "Comments"]], ["Leading energy companies are hoping to sell dozens of oil and gas fields and refineries worth more than $110 billion to curb both their ballooning debt and their carbon footprints.", "72", ["4", "Comments"]], ["Are your hours getting sucked into oblivion lately? Create time affluence https://reut.rs/30nGsvz ✍️ Catalog it  💸 Buy more by delegating 🔧 Reshape your workday ... 🛀 Leisure time matters See More", "19", ["1", "Comment"]], ["LIVE: House Republican leader Kevin McCarthy gives his weekly briefing amid pandemic aid talks #coronavirus #COVID19 #economy", "282", ["222", "Comments"]], ["China's Huawei Technologies has failed to convince British security officials that the security risks of using its products in UK national infrastructure can be adequately managed, according to a government report released on Thursday.", "92", ["3", "Comments"]], ["Boeing Co said on Thursday it will move the rest of its 787 Dreamliner production to South Carolina in 2021, a cost-cutting strategy that raises questions over the future its giant Everett plant north of Seattle.", "279", ["71", "Comments"]], ["Sports File: While global sports finds a way to carry on, many events continue to grapple with how to show support and solidarity for social justice issues. Reuters' Christian Radnedge has more", "37", ["2", "Comments"]], ["Polish divers say they have found the wreck of a German World War Two ship which may help solve a decades-old mystery - the whereabouts of the Amber Room, an ornate chamber from a tsarist palace in Russia that was looted by the Nazis.", "642", ["13", "Comments"]], ["France's data privacy watchdog CNIL recommended on Thursday that websites operating in the country should keep a register of internet users' refusal to accept online trackers known as cookies for at least six months.", "57", ["1", "Comment"]], ["House Speaker Nancy Pelosi and Treasury Secretary Steven Mnuchin approach 11th hour on U.S. COVID-19 aid talks. A bipartisan deal has been long delayed by disagreements over Democratic demands for aid to state and local governments and Republican assistance for a provision protecting businesses from coronavirus-related lawsuits https://reut.rs/34gabHR", "2.6K", ["65", "Comments"]], ["The U.S. Senate Commerce Committee on Thursday unanimously voted to approve a plan to subpoena chief executives of Twitter, Alphabet's Google and Facebook for a hearing likely to be held before the election on a prized legal immunity enjoyed by internet companies.", "165", ["10", "Comments"]], ["Sweden's H&M has been fined 35 million euros ($41 million) by the German authorities for internal data security breaches at its customer service centre in Nuremberg, the fashion retailer said on Thursday.", "329", ["8", "Comments"]], ["- A Venezuelan father waits to plead his U.S. asylum case in Mexico  - A mother is sent back to Honduras after being separated from her children  - An Iranian couple kept apart under a U.S. travel ban Stories from separated families 👇 https://reut.rs/3nb0aEo", "143", ["109", "Comments"]], ["Two French journalists working for Le Monde newspaper were in a serious condition on Thursday after shelling by Azeri forces in the town of Martuni in the Nagorno-Karabakh region and will be repatriated to France as soon as possible, officials said.", "440", ["228", "Comments"]], ["The Trump administration said it intends to allow only 15,000 refugees to resettle in the United States in the 2021 fiscal year, setting another record low in the history of the modern refugee program https://reut.rs/2GrPGQ6", "645", ["336", "Comments"]], ["Exxon Mobil <XOM.N> could slip into a bigger-than-expected loss in the third quarter as the U.S. oil major struggles to cope with the effects of a pandemic-driven downturn in the energy industry.", "38", ["5", "Comments"]], ["Business software group SAP said on Thursday it would acquire Emarsys, a cloud-based marketing platform, in a deal that will round out companies' ability to tailor communication with customers across all online channels.", "46", ["9", "Comments"]], ["Exclusive: Volkswagen is drawing up plans to carve out Lamborghini, sources tell Reuters. The Italian sportscar brand, which is currently a division of Audi, could be partially listed, with VW retaining a controlling stake, a source said https://reut.rs/3l01p7J", "101", ["2", "Comments"]], ["House Speaker Nancy Pelosi and Treasury Secretary Steven Mnuchin were expected to try again to reach a deal on COVID-19 relief, while the House of Representatives stood ready for a second day to move a Democratic bill if talks fail https://reut.rs/33lwoF2", "659", ["74", "Comments"]], ["LIVE: House Speaker Pelosi holds briefing a day after aid talks with Treasury Secretary Mnuchin #coronavirus #COVID19 #economy", "696", ["318", "Comments"]], ["Sweden registered 752 new COVID-19 cases on Thursday, the highest daily rise since June, Health Agency statistics showed, the latest in a steady rise in infections in recent weeks after months of limited spread during the summer holiday season.", "206", ["81", "Comments"]], ["SpaceX launches next batch of 60 Starlink satellites from Kennedy Space Center in Florida.🛰", "3.9K", ["555", "Comments"]], ["LIVE: The U.N. holds a meeting on women's rights", "389", ["55", "Comments"]], ["U.S. weekly jobless claims fall; consumer spending solid in August https://reut.rs/3nbLuoS", "72", ["11", "Comments"]], ["Alphabet's Google plans to pay $1 billion to publishers globally for their content over the next three years, its CEO said on Thursday, a move that could help it win over a powerful group amid heightened regulatory scrutiny worldwide.", "187", ["4", "Comments"]], ["Facebook Inc <FB.O> identified an \"uptick\" in content related to the far-right Proud Boys on Wednesday, after President Donald Trump declined to condemn the group during Tuesday night's presidential debate, a company executive said on Twitter.", "709", ["295", "Comments"]], ["Facebook Inc <FB.O> on Wednesday banned ads on its flagship website and Instagram photo and video sharing service that claim widespread voting fraud, suggest U.S. election results would be invalid, or which attack any method of voting.", "2.4K", ["397", "Comments"]], ["American Airlines will begin furloughs of 19,000 workers, and the Association of Flight Attendants says other carriers plan to follow, as hopes faded for a last-minute bailout from Washington https://reut.rs/2EMtShK", "417", ["117", "Comments"]], ["Residents of infection hotspot Madrid are to be barred from leaving except on essential trips under new rules to fight the coronavirus resurgence, Spain's government said on Wednesday.", "260", ["33", "Comments"]], ["The Vatican said on Wednesday it had denied a request from Mike Pompeo for an audience with Pope Francis, and accused the Secretary of State of trying to drag the Catholic Church into the U.S. presidential election by denouncing its relations with China.", "9.7K", ["1.3K", "Comments"]], ["The Taiwan government faces a difficult balancing act. It wants to help Hong Kong activists who flee to the island, legally or illegally, people familiar with the government’s thinking say, but it is increasingly wary of doing so in an overt way in case this prompts a forceful backlash https://reut.rs/36jEEYk", "47", ["7", "Comments"]], ["LIVE: NASA's Jim Bridenstine testifies at Senate hearing", "395", ["43", "Comments"]], ["LIVE: Ex-FBI Director James Comey testifies on Russia probe", "650", ["229", "Comments"]], ["China's Huawei is ready to be thoroughly examined to show that its technology does not pose any risk to the countries that will include its equipment in the creation of 5G networks, the head of its Italian unit said on Wednesday.", "132", ["33", "Comments"]], ["‘It’s a choice between hope and hopelessness. Of course some have chosen to risk their lives at sea.’ Protesters left behind in Hong Kong had two options - to face trial or to flee after the city’s new security law, one activist says https://reut.rs/3kXH2be", "144", ["25", "Comments"]], ["LIVE: Biden and Trump face off in the first presidential debate #Debates2020", "3.1K", ["5.4K", "Comments"]], ["The death of Ruth Bader Ginsburg has raised the stakes of an upcoming legal battle over Obamacare. Here is a look at some of the vast differences on healthcare policy between Joe Biden and President Trump. https://reut.rs/3jg79K5", "83", ["88", "Comments"]], ["Disney will lay off about 28,000 employees in its theme parks division as its resorts take a hit from the coronavirus pandemic https://reut.rs/3l18J34", "662", ["312", "Comments"]], ["The United States is \"outraged\" by Monday's rocket attack in the Iraqi capital Baghdad that killed five civilians https://www.reuters.com/article/idUSKBN26J2LD, the U.S. State Department said on Tuesday, urging Iraqi authorities to take immediate action to hold the perpetrators...", "103", ["24", "Comments"]], ["Canadian Prime Minister Trudeau, U.N. Secretary General Guterres and Jamaican Prime Minister Holness hold a briefing.", "837", ["156", "Comments"]], ["VMware Inc and Nvidia Corp on Tuesday announced an effort to make VMware's software for managing data centers work better with Nvidia's artificial intelligence (AI) chips.", "28", ["3", "Comments"]], ["LIVE: NASA and SpaceX hold a briefing on the Commercial Crew program", "455", ["48", "Comments"]], ["LIVE: House committee holds hearing on white supremacy and police", "694", ["782", "Comments"]], ["LIVE: World leaders give speeches at the 75th U.N. General Assembly", "689", ["856", "Comments"]], ["Swatch Group <UHR.S> shut down some of its technology systems after detecting a cyberattack over the weekend, the world's biggest watchmaker said on Tuesday.", "34", ["2", "Comments"]], ["A suspect was shot dead by police and there were 'multiple fatalities' in a reported hostage situation at a home in Salem, Oregon, but no officers were injured, police reported https://reut.rs/3cJN24C", "77", ["54", "Comments"]], ["Britain’s Financial Conduct Authority said it has filed for an expedited appeal in its business interruption test case as a precaution against insurers not agreeing by Wednesday to pay out on claims made during the pandemic https://reut.rs/3cHyySH", "15", ["7", "Comments"]], ["When Lau Kai Fai, his wife and teenage son moved into a new Hong Kong flat last month, he thought the 290 square feet (27 square metres) of space in his \"module home\" felt like \"winning the lottery.\"", "633", ["29", "Comments"]], ["Germany's hard right Alternative for Germany (AfD) party fired an official on Monday who had been caught on a hidden camera discussing gassing refugees.", "339", ["57", "Comments"]], ["Fourth U.S. judge issues order blocking U.S. Postal Service cuts", "1.3K", ["202", "Comments"]], ["LIVE: WHO holds briefing on COVID-19 as global cases surpass 33 million", "573", ["432", "Comments"]], ["President Trump nominated Amy Coney Barrett to the Supreme Court, and she pledged to become a justice in the mold of the late staunch conservative Antonin Scalia, setting another milestone in Trump’s rightward shift of the top U.S. judicial body https://reut.rs/3kLHDN8", "484", ["425", "Comments"]], ["China's leaders are poised to endorse a lower economic growth target for Beijing's next five-year plan compared with 2016-2020, as authorities navigate growing challenges fuelled by a deepening rift with the United States, policy sources said.", "140", ["3", "Comments"]], ["LIVE: SpaceX launches it's 13th batch of Starlink satellites", "4.1K", ["574", "Comments"]], ["Andy Murray should consider whether he has the right to accept wild cards into major tournaments at the expense of emerging young players, seven-time Grand Slam champion Mats Wilander said after the Briton crashed out of the French Open.", "23", ["1", "Comment"]], ["Armenian and Azeri forces exchanged fierce fire for the second day on Monday morning, with both sides accusing each other of using heavy artillery https://reut.rs/33ai1mU", "342", ["117", "Comments"]], ["Taiwan expressed satisfaction on Monday and said the European Union had stepped in to help after a global alliance of mayors stopped referring to Taiwanese cities as part of China, in a rare win for the island amid growing Chinese pressure.", "266", ["14", "Comments"]], ["U.S. judge blocks Trump administration TikTok app store ban https://reut.rs/2HCMstS", "939", ["131", "Comments"]], ["A recent strengthening in the euro's exchange rate is a worry and will warrant a reaction from the European Central Bank if it drags inflation farther away from its goal, ECB policymaker Ignazio Visco said on Sunday.", "54", ["3", "Comments"]], ["Lewis Hamilton's bid for a record-equalling 91st career Formula One win took a huge hit at the Russian Grand Prix on Sunday after stewards imposed two five-second penalties for practice start infringements.", "95", ["18", "Comments"]], ["New Zealand Prime Minister Jacinda Ardern is poised to retain power at next month's election, a widely watched poll showed on Sunday, although it said a recent COVID-19 outbreak has dented her support slightly.", "393", ["10", "Comments"]], ["Former world number one Andy Murray chose to focus on the funny side of his French Open first-round draw against Stan Wawrinka as the pair brace themselves for another battle on the Parisian clay on Sunday.", "25", ["1", "Comment"]], ["U.S. appeals judge Amy Coney Barrett, President Donald Trump's third nominee to the Supreme Court, will face a series of informal and formal meetings with the Republican-controlled Senate, which has the power to install her in the lifetime role.", "404", ["248", "Comments"]], ["Crowds protested outside Israeli Prime Minister Benjamin Netanyahu's home on Saturday demanding he quit over his handling of COVID-19 - many angered by what they said were government attempts to use lockdown measures to stifle demonstrations.", "275", ["31", "Comments"]], ["As China and the United States feuded at the United Nations this week over COVID-19 and climate, one of the world's smallest states pleaded for detente.", "126", ["7", "Comments"]], ["President Trump announces conservative appellate judge Amy Coney Barrett as his nominee to succeed the late Justice Ginsburg https://reut.rs/2G6QhXr", "3.4K", ["1.2K", "Comments"]], ["France registered 14,412 new confirmed coronavirus cases on Saturday, not far from a daily record of 16,096 set earlier this week.", "242", ["26", "Comments"]], ["Argentina´s novel coronavirus infections were poised to top 700,000 on Saturday as new daily infections and deaths hit the top five globally, Reuters data showed, despite seven months of quarantine that have ravaged the frail economy.", "152", ["11", "Comments"]], ["The U.S. Centers for Disease Control and Prevention (CDC) on Saturday reported 7,009,216 cases of the new coronavirus, an increase of 50,584 from its previous count, and said that the number of deaths had risen by 851 to 203,180.", "357", ["88", "Comments"]], ["Veteran singer Van Morrison blew away the coronavirus blues in London on Friday night with a performance of stirring and soulful music that transported fans back to happier times - and kept the spirit of live music alive.", "119", ["11", "Comments"]], ["Ukrainian President Volodymyr Zelenskiy said on Saturday the causes of a military plane crash which killed 26 people would be investigated promptly and impartially.", "211", ["1", "Comments"]], ["With COVID-19 deaths in the U.S. topping 200,000 this week following a rise in new daily cases last week for the first time in eight weeks, the role of the economy in the looming presidential election could take on heightened importance -- but it is not clear how.", "153", ["241", "Comments"]], ["If you’ve had to evacuate your home due to the west coast fires, we’d like to hear your story https://reut.rs/3iaqGKI", "20", ["7", "Comments"]], ["The number of novel coronavirus cases in the United States topped 7 million - more than 20% of the world's total - as Midwest states reported spikes in COVID-19 infections in September, according to a Reuters tally.", "7K", ["331", "Comments"]], ["WHO gives an update on the global pandemic response", "634", ["108", "Comments"]], ["Voting by mail in North Carolina’s primary, William Hearn only got one witness to sign his ballot envelope. His ballot was rejected per a requirement, now loosened, that he secure two witnesses. Hearn had no idea his vote didn’t count until he was notified by @Reuters in September https://reut.rs/2G33EIm Full story: https://reut.rs/34eyYwb", "124", ["28", "Comments"]], ["Breonna Taylor's family speaks after more protests over grand jury ruling. Watch live 👉https://reut.rs/33Y79YP", "41", ["28", "Comments"]], ["Pioneering Justice Ginsburg makes history again as the first woman and the first Jewish person to lie in state in the U.S. Capitol", "4.9K", ["511", "Comments"]], ["LIVE: World leaders take part in the 75th U.N. General Assembly", "426", ["114", "Comments"]], ["An oil tanker captain's murder: In Venezuela's ports and dockyards, where decrepit vessels bob unattended and container lots sit empty, some workers have taken to stealing what little cargo comes through. Soldiers and sailors, who guard the facilities, earn little, forcing many to moonlight and tempting some to turn to crime. https://reut.rs/3iXyNv0", "175", ["10", "Comments"]], ["New York retained the top spot in a survey of global financial centres on Friday, with London strengthening its position in second place just over three months before Britain's full departure from the European Union.", "87", ["1", "Comments"]], ["Ant Group, owner of China's ubiquitous mobile payment app Alipay, launched a blockchain-powered platform for cross-border trade settlements on Friday, as it races to launch more technology products ahead of its blockbuster IPO.", "97", ["5", "Comments"]], ["COVID-19 infections are still rising in 72 countries. See where infections are trending ⬆️ or ⬇️ relative to the size of the outbreak in each country https://reut.rs/341dzGi", "210", ["157", "Comments"]], ["LIVE: Fridays for Future activists protest in Berlin", "895", ["52", "Comments"]], ["China's growing fascination with Tesla's sleek designs and cutting-edge technology is giving a string of second-wave home-grown startups the traction to raise more funding, expand production and boost sales. https://reut.rs/3mSRSkr", "109", ["45", "Comments"]], ["BMW AG and two U.S. subsidiaries agreed Thursday to pay an $18 million (£14.1 million) U.S. fine to resolve accusations that they disclosed misleading information about the German luxury automaker's retail sales volume in the United States while raising approximately $18...", "281", ["8", "Comments"]], ["Retired General Paul Selva, once one of Trump’s most senior military advisers, is joining a large group of former Pentagon leaders to publicly endorse Biden, a letter shows https://reut.rs/3065hvW", "5.1K", ["994", "Comments"]], ["Top democrat on U.S. Senate commerce committee Maria Cantwell said on Thursday she would not support the panel's efforts to subpoena chief executives of Twitter <TWTR.N>, Alphabet's Google <GOOGL.O> and Facebook <FB.O> for an Oct. 1 hearing.", "53", ["20", "Comments"]], ["China's electric vehicle startups are on the charge again, thanks to Tesla. The country's growing fascination with the U.S. pioneer's cutting-edge technology is giving a string of home-grown Tesla wannabes the traction to raise more funding. https://reut.rs/2Gcc0Nx", "43", ["10", "Comments"]], ["Vaccine worries, Olive Garden and oil woes: Catch up with the latest edition of Breakingviews’ Corona Capital for insights on the pandemic’s corporate and financial fallout. https://reut.rs/2RYRsuS", "20", ["1", "Comment"]], ["Tyler Technologies <TYL.N> said the hacking attack against it disclosed Wednesday used ransomware, which encrypts company files and demands payment to decrypt them again.", "33", ["3", "Comments"]], ["U.S. oil producer ConocoPhillips <COP.N> sees global demand returning to 100 million barrels per day and growing from there, with oil an \"important part of the energy mix in any scenario\" going forward, a senior executive said on Thursday.", "183", ["3", "Comments"]], ["Judge says U.S. must delay TikTok download ban or file legal papers by Friday at 2:30 p.m. EDT defending ban, court order says.", "233", ["18", "Comments"]], ["Police in Vietnam bust ring selling 'recycled condoms'. A woman detained during the bust told police that the used prophylactics were first boiled in water then dried and reshaped on a wooden phallus before being repackaged and resold https://reut.rs/3kLmoes", "963", ["346", "Comments"]], ["LIVE: United Nations convenes climate action roundtable on sidelines of UNGA On the sidelines of the UNGA, United Nations Secretary-General António Guterres convenes a roundtable to 'showcase high-impact solutions by governments and real economy leaders.'", "161", ["20", "Comments"]], ["House Republican leader Kevin McCarthy gives his weekly briefing, with 40 days until election.", "253", ["233", "Comments"]], ["House Speaker Nancy Pelosi gives her weekly briefing, with election 40 days away.", "611", ["243", "Comments"]], ["Climate scientist Katharine Hayhoe joins Reuters discussion on climate change Climate scientist Katharine Hayhoe joins Reuters to discuss to discuss climate change, our ability to tackle the challenge and whether society can adapt to a warming planet.", "216", ["60", "Comments"]], ["Police in Vietnam have confiscated an estimated 345,000 used condoms which had been cleaned and resold as new, state media reported https://reut.rs/3mMMhMA", "4.6K", ["1.4K", "Comments"]], ["LIVE: World leaders take part in the 75th U.N. General Assembly", "339", ["258", "Comments"]], ["LIVE: Justice Ruth Bader Ginsburg lies in repose at the U.S. Supreme Court", "1.5K", ["69", "Comments"]], ["LIVE: U.N. Security Council holds meeting on 'global governance post COVID-19'", "171", ["60", "Comments"]], ["North Korean troops shot dead a South Korean fisheries official who went missing earlier this week, before dousing his body in oil and setting it on fire in what was likely an effort to prevent a coronavirus outbreak, South Korea’s military said https://reut.rs/3mLqtkt", "140", ["25", "Comments"]], ["Chancellor of the Exchequer Rishi Sunak gives an update on COVID-19 job support.", "149", ["29", "Comments"]], ["Sir Harold Evans: 1928–2020. He exposed deadly corporate secrets and the spy scandal of the century - setting the world's gold standard for journalism in the public interest https://reut.rs/3iZDPXY", "508", ["25", "Comments"]], ["Sir Harold Evans: 1928–2020. He exposed deadly corporate secrets and the spy scandal of the century - setting the world's gold standard for journalism in the public interest https://reut.rs/3iY9lWr", "644", ["98", "Comments"]], ["LIVE: Justice Ruth Bader Ginsburg lies in repose at the U.S. Supreme Court", "3.8K", ["338", "Comments"]], ["Exclusive: A physician who heads the FDA vaccine advisory committee recused herself from the panel's review of COVID-19 vaccines because of her role overseeing a clinical trial for Moderna's candidate, her spokeswoman says https://reut.rs/32UA5kU", "119", ["10", "Comments"]], ["Kentucky Governor Andy Beshear responds to the grand jury decision in the case of Breonna Taylor. Watch live 👉https://reut.rs/2RZ85Gt", "54", ["5", "Comments"]], ["TikTok asked a U.S. judge to block a Trump administration order that would require Apple and Google to remove the app from its stores for new downloads starting Sunday https://reut.rs/2FXslpD", "157", ["23", "Comments"]], ["Kentucky grand jury indicts at least one police officer with 'wanton endangerment' in killing of Breonna Taylor in Louisville.", "573", ["311", "Comments"]], ["Kentucky attorney general expected to announce the grand jury decision on whether to charge Louisville police officers in the shooting death of Breonna Taylor. Watch live 👉https://reut.rs/3j3dCrO", "33", ["64", "Comments"]], ["Wall Street's main indexes fell on Wednesday as data showed domestic business activity slowed in September, although a record high for Nike following a strong quarterly earnings report capped declines on the blue-chip Dow.", "38", ["5", "Comments"]], ["Secretary of State Mike Pompeo speaks to Wisconsin political and business leader", "304", ["90", "Comments"]], ["LIVE: WHO hosts a virtual event on COVID-19LIVE: WHO hosts a virtual event on COVID-19", "144", ["49", "Comments"]], ["Major U.S. airlines launched a last-ditch bid to persuade Congress to grant them a new $25 billion bailout to help avert tens of thousands of employee furloughs set to begin Oct. 1 https://reut.rs/2FSWKpb", "68", ["7", "Comments"]], ["The U.S. Senate Committee on Health, Education, Labor and Pensions to hold a hearing on the U.S. coronavirus response featuring witness testimony from Dr. Anthony Fauci, director of NIAID, Dr. Robert Redfield, CDC director.", "749", ["534", "Comments"]], ["LIVE: Justice Ruth Bader Ginsburg lies in repose at the U.S. Supreme Court", "2.7K", ["115", "Comments"]], ["LIVE: World leaders take part in the 75th annual U.N. General Assembly", "454", ["15", "Comments"]], ["TOMORROW at 10 AM EDT: Climate scientist Katharine Hayhoe joins Reuters to discuss climate change, our ability to tackle the challenge and whether society can adapt to a warming planet. Register here 👉 https://reut.rs/3hILKHC", "55", ["38", "Comments"]], ["COVID-19 infections are still rising in 71 countries. See where infections are trending ⬆️ or ⬇️ relative to the size of the outbreak in each country https://reut.rs/303bpF5", "88", ["68", "Comments"]], ["U.S. federal law enforcement and cybersecurity agencies on Tuesday warned that \"foreign actors\" will likely try to discredit the November presidential election by taking advantage of the slow counting of mail-in ballots.", "510", ["198", "Comments"]], ["Vice President Mike Pence’s plane was forced to return to a Manchester, New Hampshire, airport after the plane struck a bird during takeoff, his office said https://reut.rs/2S3yQKh", "468", ["284", "Comments"]], ["Investors slashed $50 billion from Tesla’s market value after Elon Musk said his plan to cut electric vehicle battery costs and build a $25,000 self-driving car would not happen for at least three years https://reut.rs/2G0mxvg", "142", ["53", "Comments"]], ["If you’ve had to evacuate your home due to California’s wildfires, we’d like to hear your story: https://reut.rs/2RQjicI", "43", ["7", "Comments"]], ["Have you left your home due to California’s wildfires? We want to hear from you: https://reut.rs/33WZDxo", "26", ["1", "Comment"]], ["Exclusive: China is pushing growing numbers of Tibetan rural laborers off the land and into recently built military-style training centers where they are turned into factory workers. While there has been some evidence of military-style training and labor transfers in Tibet in the past, a new, enlarged program represents the first on a mass scale and the first to openly set quotas for transfers outside the region. For the full story: https://reut.rs/32R0tME", "308", ["75", "Comments"]], ["LIVE: House Democratic Caucus holds a briefing as U.S. coronavirus deaths surpass 200,000", "486", ["161", "Comments"]], ["Organisers of the Italian Open and the tennis Tours came under fire on social media after it emerged that Rome men's champion Novak Djokovic was paid 10 euros ($11.74) more than women's winner Simona Halep.", "1.7K", ["276", "Comments"]], ["Federal Reserve Chair Jerome Powell and Treasury Secretary Steven Mnuchin testify before the House Financial Services Committee virtual hearing on oversight of the pandemic response as U.S. coronavirus deaths surpass 200,000. #coronavirus #COVID19 #politics", "175", ["35", "Comments"]], ["EU antitrust regulators will decide by Oct. 26 whether to clear French telecoms operator Iliad's 3.5-billion-euro ($4.1 billion) bid for Polish mobile group Play, a filing on the European Commission's website showed on Tuesday.", "39", ["2", "Comments"]], ["LIVE: World leaders take part in the 75th annual U.N. General Assembly", "1K", ["484", "Comments"]], ["LIVE: World leaders take part in the 75th annual U.N. General Assembly", "191", ["30", "Comments"]], ["All eyes were on President Trump and Senate Republican Majority Leader Mitch McConnell to signal whether they will attempt a vote on Supreme Court Justice Ruth Bader Ginsburg's successor before or after the Nov. 3 election https://reut.rs/35YYFDs", "752", ["481", "Comments"]], ["NASA and Space Force discuss their collaboration in space U.S. Air Force Gen. John 'Jay' Raymond, chief of space operations at Space Force, and NASA Administrator Jim Bridenstine discuss their partnership in an online forum.", "267", ["39", "Comments"]], ["LIVE: World leaders take part in the 75th annual U.N. General Assembly", "623", ["140", "Comments"]], ["COVID-19 infections are still rising in 68 countries. See where infections are trending ⬆️ or ⬇️ relative to the size of the outbreak in each country https://reut.rs/3hOdUkB", "46", ["15", "Comments"]], ["Exclusive: China has expanded a mass labor program in Tibet as international pressure is growing over similar projects in Xinjiang, some of which have been linked to mass detention centers. A U.N. report has estimated that around one million people in Xinjiang, mostly ethnic Uighurs, were detained in camps and subjected to ideological education https://reut.rs/2RLN55Y", "471", ["66", "Comments"]], ["Taiwan President Tsai Ing-wen praised on Tuesday the \"heroic performance\" of air force pilots who have been intercepting Chinese jets that have approached the island, as Beijing steps up military pressure on democratic Taiwan.", "1K", ["124", "Comments"]], ["Heavily pregnant Taj Bibi prays for her fourth husband as the Afghan soldier sets off to battle the Taliban, hoping his fate won’t be the same as that of his three brothers, her first three husbands, all killed fighting the militants https://reut.rs/33HTgxu", "841", ["230", "Comments"]], ["Yiwu is a Chinese city dedicated to Christmas all year round, filled with factories, showrooms and stores that deliver decorations and toys to destinations all around the world. But the coronavirus is dampening seasonal cheer in this production hub https://reut.rs/2HnlCWz", "68", ["8", "Comments"]], ["China sharply expands mass labor program in Tibet. Moving surplus rural labor into industry is a key part of China's drive to boost the economy and reduce poverty. But in areas like Xinjiang and Tibet, with large ethnic populations and a history of unrest, rights groups say the programs include an outsized emphasis on ideological training. Read the full Reuters  report: https://reut.rs/2RP8Xxm", "460", ["162", "Comments"]], ["Investors are bracing for an extended period of market volatility, as worries over a potential resurgence in coronavirus cases and political uncertainty roil stocks.", "75", ["25", "Comments"]], ["LIVE: Colombian unions hold national strike Colombian unions hold a national strike in protest against President Ivan Duque's social and economic policies, as they seek to revive mass demonstrations after the end of the country's COVID lockdown and outrage over recent incidents of police brutality.", "691", ["30", "Comments"]], ["Global banks faced a fresh scandal about dirty money on Monday as they sought to limit the fallout from a cache of leaked documents showing they transferred more than $2 trillion in suspect funds over nearly two decades.", "155", ["29", "Comments"]], ["LIVE: Mitch McConnell and Chuck Schumer speak on the Senate floor after the death of Supreme Court Justice Ruth Bader Ginsburg Senate Majority Leader Mitch McConnell and Democratic leader Chuck Schumer speak on the Senate floor as the Trump administration pushes ahead with a plan to nominate a successor to Supreme Court Justice Ruth Bader Ginsburg just weeks before the U.S. election. #Senate #politics", "737", ["300", "Comments"]], ["Iranian Foreign Minister Javad Zarif speaks at a virtual event sponsored by the Council on Foreign Relations in New York.", "190", ["41", "Comments"]], ["LIVE: U.S. officials speak on Iran snapback sanctions at the State Department Secretary of State Mike Pompeo, Treasury Secretary Steve Mnuchin, Secretary of Defense Mark Esper, Secretary of Commerce Wilbur Ross, U.S. Representative to the United Nations Kelly Craft and National Secretary Advisor Robert O’Brien hold a news conference regarding Iran snapback sanctions at the State Department.", "365", ["91", "Comments"]], ["LIVE: WHO gives a COVID-19 update as U.S. deaths near 200,000", "367", ["87", "Comments"]], ["Ba N'Daou is named interim president of Mali and Assimi Goita is named interim vice president - state television", "27", ["1", "Comments"]], ["LIVE: Mourners pay tribute to Justice Ruth Bader Ginsburg outside the Supreme Court", "1.8K", ["328", "Comments"]], ["From Reuters Breakingviews: South Korean exports sputter back to life, and G4S’s results bolster its takeover defenses. Catch up with the latest financial insights https://reut.rs/2FNoXO7", "30", ["1", "Comments"]], ["World leaders mark the 75th anniversary of U.N. World leaders take part in an event to mark the 75th anniversary of the United Nations.", "636", ["230", "Comments"]], ["Boeing Co <BA.N> is nearing a decision to shift more 787 Dreamliner production to South Carolina, industry sources said, a cost-cutting strategy accelerated by the COVID-19 pandemic that would deplete its iconic factory north of Seattle.", "98", ["19", "Comments"]], ["LIVE: Mourners gather outside Supreme Court after Justice Ruth Bader Ginsburg's death", "1.4K", ["241", "Comments"]], ["China’s air force has released a video showing nuclear-capable H-6 bombers carrying out a simulated attack on what appears to be Andersen Air Force Base on the U.S. Pacific island of Guam, as regional tensions continue to rise https://reut.rs/32OE6Yn", "726", ["256", "Comments"]], ["Take a look at key winners of the 2020 #Emmys, a virtual ceremony that celebrated the best in television https://reut.rs/2FMAzRw", "44", ["7", "Comments"]], ["REGISTER: On September 24, climate scientist Katharine Hayhoe joins Reuters to discuss climate change, our ability to tackle the challenge and whether society can adapt to a warming planet. More here 👉 https://reut.rs/3ciiyGE", "52", ["11", "Comments"]], ["China, the world's biggest automobile market, rolled out fresh policies to support hydrogen fuel cell vehicles to improve the industry's supply chain and technologies, the finance ministry said on Monday.", "466", ["31", "Comments"]], ["Lebanon's top Christian cleric took a swipe at leaders of the Shi'ite Muslim community on Sunday for making demands he said were blocking the formation of a new government and causing political paralysis in a nation in deep crisis.", "117", ["7", "Comments"]], ["Relatives of some of the 12 Hong Kong people arrested by China at sea last month demanded the city's government check on their condition and ensure lawyers appointed by the families and not the Chinese government, can meet with them.", "291", ["50", "Comments"]], ["Britain is at a tipping point on COVID-19, health minister Matt Hancock said on Sunday, warning that a second national lockdown could be imposed if people don't follow government rules designed to stop the spread of the virus.", "271", ["49", "Comments"]], ["Rafa Nadal refused to make excuses for his shock defeat by Diego Schwartzman in the quarter-finals of the Italian Open, insisting that his focus is now on fine-tuning his game ahead of the French Open which begins Sept. 27.", "1.9K", ["44", "Comments"]], ["Slovenia's Tadej Pogacar pulled off a major upset at the Tour de France by stunning compatriot Primoz Roglic to claim the overall leader's yellow jersey with a monumental victory in the final individual time trial on Saturday.", "172", ["2", "Comments"]], ["A party founded by Lebanon's Christian president made a proposal to end a dispute that has blocked the formation of a new cabinet and threatened a French drive to lift the country out of its worst crisis since the 1975-1990 civil war.", "62", ["3", "Comments"]], ["London's police force said on Saturday it had suspended an officer tasked with guarding British Foreign Minister Dominic Raab, following a newspaper report that the officer had left a loaded gun on a plane.", "115", ["7", "Comments"]], ["Join Reuters discussion on September 24, with climate scientist Katharine Hayhoe to discuss climate change, our ability to tackle the challenge and whether society can adapt to a warming planet. Register now 👉 https://reut.rs/33zRJK0 #ReutersLive", "71", ["5", "Comments"]], ["On a cool night in a heated political year in Washington, several hundred people clutching candles, flowers and signs quietly gathered on the steps of the U.S. Supreme Court to mark the death Friday of liberal icon Justice Ruth Bader Ginsburg.", "2.4K", ["155", "Comments"]], ["LIVE: Schumer pushes for federal funds to save Broadway Senate Minority Leader Chuck Schumer speaks at an event to ask for federal funds to help Broadway after it has been closed for more than six months due to COVID-19. #Broadway #coronavirus #COVID19", "434", ["133", "Comments"]], ["LIVE: WHO holds a coronavirus briefing after global cases pass 30 million The World Health organization provides updates on COVID-19", "511", ["181", "Comments"]], ["LIVE: House Speaker Nancy Pelosi gives her weekly update amid coronavirus aid negotiations #coronavirus #COVID19 #economy #politics", "653", ["297", "Comments"]], ["A recent surge in COVID-19 cases is forcing Canadian Prime Minister Justin Trudeau to scale back his plan to outline an ambitious green economic recovery package next week.", "66", ["5", "Comments"]], ["Pennsylvania’s top court ruled that state officials dealing with a surge in mail-in ballots due to the coronavirus pandemic can accept them up to three days after the Nov. 3 election, as long as they were mailed by Election Day https://reut.rs/35OxL0O", "1.2K", ["354", "Comments"]], ["LIVE: U.N. holds briefing on Sustainable Development Goals and COVID-19", "416", ["91", "Comments"]], ["UK government announces restrictions for more areas in North West, West Yorkshire and Midlands to tackle rising infection rates", "246", ["30", "Comments"]], ["Infections are still rising in 73 countries. See where infections are trending ⬆️ or ⬇️ relative to the size of the outbreak in each country https://reut.rs/3iISUwW", "146", ["62", "Comments"]], ["Apple Inc will launch its first online store in India on Sept. 23, the iPhone maker said on Friday, coinciding with the country's festive season that rakes in some of the biggest sales for retailers every year.", "1.3K", ["1", "Comment"]], ["U.S. Senator Elizabeth Warren on Thursday blasted U.S. business leaders, including JPMorgan Chase & Co's <JPM.N> Jamie Dimon and Walmart's <WMT.N> Doug McMillon, for falling short on a \"splashy\" promise to look beyond profits when running their businesses.", "469", ["136", "Comments"]], ["France registered a record 10,593 new confirmed coronavirus in the past 24 hours, health ministry data showed on Thursday, the country's highest single-day count since the pandemic began.", "122", ["2", "Comments"]], ["Marriage is not as widespread in Haiti as in other Western countries, given the long-standing Creole tradition of 'plasaj,' an informal marital relationship that is common in rural areas but not legally recognized. Yet marriage has greater prestige https://reut.rs/2FNKy8E", "98", ["25", "Comments"]], ["With resources stretched to the limit, weary crews on Thursday fought from the air and on the ground against deadly wildfires sweeping the western United States, with a U.S. senator saying parts of Oregon now resemble the aftermath of World War Two firebombings.", "104", ["10", "Comments"]], ["Turkey's first flying car briefly hovered in the air, successfully completing its first test flight.", "240", ["47", "Comments"]], ["Global coronavirus cases surpass 30 million, a Reuters tally shows 👉 https://reut.rs/2FCMQb6", "178", ["137", "Comments"]], ["TikTok, already under scrutiny over its Chinese ownership and threatened with a possible ban by President Trump, is facing another major challenge: how to handle content around its first U.S. presidential election.", "57", ["14", "Comments"]], ["The head of the CDC, Dr. Robert Redfield, said face masks may be more effective in protecting against the coronavirus than even a vaccine.", "349", ["85", "Comments"]], ["Both Biden and Trump have blasted social media companies over their handling of political content. Here's where they stand on key tech policy issues. https://reut.rs/2ZO6qrL", "38", ["6", "Comments"]], ["LIVE: Pelosi, Schumer speak about COVID-19 as U.S. deaths near 200,000 As the nation approaches 200,000 coronavirus deaths, Speaker Nancy Pelosi, Senate Democratic Leader Chuck Schumer and Congressional Democrats ask for $75 billion in funding to crush the virus and reopen safely.", "700", ["560", "Comments"]], ["As deadly wildfires rage across the U.S. West Coast, millions of people have been left struggling with some of the world's worst air pollution https://reut.rs/3mFsFdo", "53", ["19", "Comments"]], ["LIVE: Top U.S. security officials testify in House hearing", "351", ["480", "Comments"]], ["Red Cross warned that the novel coronavirus is driving discrimination towards vulnerable communities in Asia, including migrants and foreigners https://reut.rs/2Ry5B1V", "71", ["6", "Comments"]], ["U.S. weekly jobless claims fell to 860,000 in the latest week, consensus 850,000, from 893,000 the prior week", "53", ["5", "Comments"]], ["EXCLUSIVE: How Bayer and the U.S. government teamed up against Thailand's glyphosate ban https://reut.rs/2FOOsy3", "69", ["7", "Comments"]], ["The Bank of England said Britain’s economy had performed better than it had expected as recently as last month but its policymakers had been briefed on how the central bank could cut rates below zero if needed https://reut.rs/2RC4sWQ", "90", ["1", "Comments"]], ["EU delivers plan for new 2030 climate target", "668", ["62", "Comments"]], ["As the coronavirus rippled across Indonesia, it also carried a stigma that public health experts say has stopped people from getting tested in fear of being shunned, and complicated the response to the pandemic https://reut.rs/2FKrWXn", "96", ["2", "Comments"]], ["Singapore's COVID-19 death rate of 0.05% is well below the global average of around 3%, according to a data compiled by @Reuters from countries that have recorded over 1,000 cases. Here’s why: https://reut.rs/3c67SL2", "272", ["98", "Comments"]], ["Elon Musk’s record shows he is a fast learner who forged alliances with firms that had technology Tesla lacked, hired some of their most talented people, and then powered through the boundaries that limited more risk-averse partners https://reut.rs/2FKAL3r", "198", ["52", "Comments"]], ["China’s ByteDance faces an uphill struggle to convince the White House to allow it to keep majority ownership of its popular short video app TikTok in the United States, according to former national security officials and regulatory lawyers https://reut.rs/3kqPOOA", "57", ["3", "Comments"]], ["Chinese consumers are rushing to buy smartphones from Huawei fearing curbs on the firm’s access to U.S. technology will soon cut off production of its premium handsets https://reut.rs/35KdU2I", "98", ["23", "Comments"]], ["EXCLUSIVE: Bayer and the U.S. government cooperated closely last year to lobby Thailand to reverse its ban on glyphosate, used in the company’s controversial weedkiller Roundup, documents show https://reut.rs/3msydrx", "182", ["31", "Comments"]], ["Mercury concentration in the Yukon River is expected to double by the end of the century if carbon emissions continue at present rates and fish in the river could become dangerous to eat within a few decades, according to a study https://reut.rs/3hBBRM8", "180", ["19", "Comments"]], ["Global coronavirus cases are expected to pass 30 million, according to a Reuters tally, with India in focus as the latest epicentre https://reut.rs/35KdWaM", "92", ["19", "Comments"]], ["A New York City man was arrested early on Wednesday after he was injured in a fire at his apartment, where authorities later found chemicals that could be used to make bombs and instructions on how to make them, police said.", "160", ["36", "Comments"]], ["From across the Philippines, nurses gathered on Zoom to pray to be allowed to take up jobs in countries where COVID-19 is killing thousands. In recent months, these care workers have taken to calling themselves 'priso-nurses' https://reut.rs/3iCARsr", "96", ["5", "Comments"]], ["LIVE: ORA Singers perform Spem in Alium from the Turbine Hall at the Tate Modern @TateModern", "1.4K", ["121", "Comments"]], ["LIVE: Federal Reserve Chair Jerome Powell speaks after leaving rates unchanged Fed leaves interest rates unchanged and seeks 2% inflation over the long run and a smaller economic hit in 2020 than expected #Fed #FederalReserve #economy", "273", ["59", "Comments"]], ["Barbados says it will remove Queen Elizabeth as its head of state and become a republic https://reut.rs/2RtakSq", "1.2K", ["155", "Comments"]], ["LIVE: WHO gives an update on COVID-19 in the Americas The World Health Organization and the Pan American Health Organization discuss the rapidly-evolving COVID-19 pandemic in the Americas region. #WHO #coronavirus #COVID19 #pandemic", "154", ["51", "Comments"]], ["The World Trade Organization found that the U.S. breached global trading rules by imposing multibillion-dollar tariffs in a trade war with China, a ruling that drew anger from Washington https://reut.rs/2FGBIK4", "210", ["30", "Comments"]], ["U.S. Secretary of State Mike Pompeo and British Foreign Secretary Dominic Raab hold a news conference after bilateral meeting.", "352", ["92", "Comments"]], ["LIVE: The WHO discusses COVID-19 testing, serological tests, reinfections and immunity #coronavirus #COVID19 #WHO #pandemic", "201", ["95", "Comments"]], ["Venezuelan security forces and allied groups have committed systematic human rights violations including killings and torture amounting to crimes against humanity, U.N. investigators said on Wednesday.", "358", ["99", "Comments"]], ["Nurses have been leaving the Philippines for decades, encouraged by the government to join other workers who send back billions of dollars each year. But an April ban has stopped many from leaving the country, and some are desperate https://reut.rs/3kij9dW", "28", ["3", "Comments"]], ["The U.S. Senate conducts a hearing to review coronavirus response efforts.", "422", ["399", "Comments"]], ["The World Trade Organization found that the United States breached global trading rules by imposing multibillion-dollar tariffs in President Donald Trump’s trade war with China, a ruling that drew anger from Washington https://reut.rs/3hHOk0U", "532", ["153", "Comments"]], ["Russia’s sovereign wealth fund has agreed a deal to sell 100 million doses of its COVID-19 vaccine, Sputnik-V, to a major listed pharmaceutical company in India, a source close to the deal said https://reut.rs/2RvVxpZ", "308", ["49", "Comments"]], ["Thousands of evacuees displaced by deadly wildfires in Oregon settled into a second week of life in shelters and car camping as fire crews battled on, and search teams scoured the ruins of incinerated homes for the missing https://reut.rs/2ZFk1li", "62", ["10", "Comments"]], ["Japan’s Yoshihide Suga was voted prime minister by parliament to become the country’s first new leader in nearly eight years, appointing a new cabinet that kept about half of the familiar faces from predecessor Shinzo Abe’s lineup https://reut.rs/2ZYSuLR", "207", ["6", "Comments"]], ["Tottenham Hotspur are in talks with Real Madrid to re-sign winger Gareth Bale, his agent said, as the Wales international looks to end his troubled spell at the Spanish club https://reut.rs/2FxfHgQ", "16", ["1", "Comment"]], ["Long-simmering tensions between the United States and China have hit boiling point at the United Nations over the coronavirus pandemic, spotlighting Beijing's bid for greater multilateral influence in a challenge to Washington's traditional leadership.", "158", ["108", "Comments"]], ["Yoshihide Suga elected as Japan's prime minister https://reut.rs/32xcXsw", "496", ["14", "Comments"]], ["Delivery fleet operators face regulatory pressure in California and other states to buy electric vehicles, but a surge in package deliveries thanks to coronavirus lockdowns has major firms itching to switch to electric right now.", "70", ["1", "Comment"]], ["Russian opposition politician Alexei Navalny shared a photograph from a Berlin hospital on Tuesday, sitting up in bed and surrounded by his family, and said he could now breathe independently after being poisoned in Siberia last month.", "734", ["28", "Comments"]], ["Apple unveiled new watches, iPads, subscription bundles and a virtual fitness service, focusing the launch on services that are the backbone of its growth strategy and cater to customers working at home; an iPhone announcement is expected next month https://reut.rs/2RqSdMO", "54", ["8", "Comments"]], ["Settlement with Breonna Taylor's family in wrongful-death lawsuit includes $12 million and Louisville police department reforms https://reut.rs/35DxkpX", "52", ["9", "Comments"]], ["From the halls of the Pentagon to the military academies, minorities who make up more than a third of the armed forces are starting to speak out about a culture that, they say, drives home a feeling of exclusion https://reut.rs/2FG6kLu", "90", ["14", "Comments"]], ["Officials in Louisville, Kentucky, announce a financial settlement with the family of Breonna Taylor, a Black woman fatally shot by police in March 👉https://reut.rs/3iF3rJO", "38", ["8", "Comments"]], ["LIVE: WHO gives an update on COVID-19 and children  Edited #coronavirus #COVID19 #WHO", "386", ["204", "Comments"]], ["LIVE: Q&A on the global race for a vaccine, with Harvard Health and @Reuters. Watch 👉 https://reut.rs/2E3LRjx", "19", ["2", "Comments"]], ["The United States has offered to exclude from President Donald Trump's executive order transactions that involve TikTok employees and contractors performing \"their regular job duties and responsibilities,\" according to a court document filed late Monday, granting a reprieve...", "66", ["7", "Comments"]], ["Coming up at 12 p.m. ET: Live Q&A with Harvard Health and @Reuters on the global race for a vaccine. Watch 👉 https://reut.rs/3hvG4kb", "27", ["1", "Comments"]], ["Joe Biden branded President Trump a 'climate arsonist' for refusing to acknowledge global warming’s role in deadly wildfires sweeping the western United States https://reut.rs/35KeKfM", "1.3K", ["621", "Comments"]], ["A stray cat dashes across the track towards the end of a 100-meter race and narrowly dodging the sprinters.", "1.9K", ["85", "Comments"]], ["Mozambique’s army has condemned the apparent execution of a naked woman by men wearing military uniforms, shown in video footage, where she is beaten with a stick before being shot in the back as she tries to flee https://reut.rs/2Fz29Bs", "125", ["24", "Comments"]], ["More than one-fifth of U.S. offshore oil production was shut and key exporting ports were closed ahead of Hurricane Sally’s landfall on the U.S. Gulf Coast, the second significant hurricane to shutter oil and gas activity over the last month https://reut.rs/2ZDTxjP", "20", ["2", "Comments"]], ["Track the COVID-19 spread 👉 https://reut.rs/3kfDKzN", "69", ["13", "Comments"]], ["Apple Inc <AAPL.O> shares have soared this year even as a pandemic has crippled economies around the world, thanks in large part to booming product sales that have beat Wall Street expectations.", "71", ["2", "Comments"]], ["As Japan’s next prime minister, Yoshihide Suga will face an early, and difficult, leadership decision: whether to call an general election before his honeymoon with voters fades or wait and risk seeing ratings slide https://reut.rs/32ygDKR", "141", ["5", "Comments"]], ["🇬🇧 🇨🇳 Britain has issued new a travel advisory for China, warning that its nationals may be at risk of arbitrary detention, after several foreigners were held on various charges including cases involving state secrets and national security https://reut.rs/32xYL2K", "185", ["18", "Comments"]], ["AstraZeneca's COVID-19 vaccine trial remains on hold in the United States pending a U.S. investigation into a serious side effect in Britain even as other trials of the vaccine resume, sources familiar with the details told Reuters.", "76", ["15", "Comments"]], ["Alphabet Inc's YouTube is rolling out its version of social media rival TikTok, a new short-form video service called Shorts, enabled within its video-sharing platform.", "247", ["12", "Comments"]], ["Coronavirus update:  🇺🇸 Trump holds campaign rally indoors despite virus concerns 🇮🇹 Italy's Berlusconi leaves hospital after 'dangerous' COVID-19 battle 🇫🇷 Crowded Marseille soccer celebrations condemned by French minister https://reut.rs/2ZDLHa1", "149", ["72", "Comments"]], ["A tantalizing sign of potential life beyond Earth, scientists said they have detected in the harshly acidic clouds of Venus a gas called phosphine that indicates microbes may inhabit Earth’s inhospitable neighbor https://reut.rs/2FsmrwB", "2.3K", ["6", "Comments"]], ["U.S. puts forward its initial objections to a lawsuit launched by Iran at the World Court The United States puts forward its initial objections to a lawsuit launched by Iran at the World Court.", "373", ["181", "Comments"]], ["Nvidia’s $40 billion agreement to acquire Arm Ltd from SoftBank is likely to meet strong opposition from its chip industry rivals, according to analysts https://reut.rs/33nTiKU", "50", ["31", "Comments"]], ["Myanmar casualties may represent war crimes, U.N. High Commissioner for Human Rights Michelle Bachelet says https://reut.rs/32ptP4y", "94", ["6", "Comments"]], ["French vaccine maker Valneva said it would supply the UK with up to 190 million doses of its coronavirus vaccine candidate over a five-year period https://reut.rs/3kglFRY", "72", ["9", "Comments"]], ["Britain’s leading business group has called on the government to implement green measures to help the economy recover from the coronavirus pandemic, and bring forward policies to enable to country to meet its climate targets https://reut.rs/3iwKLvq", "50", ["1", "Comment"]], ["ByteDance will not sell TikTok's U.S. operations to Oracle Corp <ORCL.N> or Microsoft Corp <MSFT.O> and will not give the source code for the video platform to any U.S. buyers, China's state-run English television channel CGTN reported on Monday, citing sources.", "119", ["6", "Comments"]], ["Nvidia will buy UK-based chip designer Arm from Japan’s SoftBank for as much as $40 billion, in a deal set to reshape the global semiconductor landscape https://reut.rs/35xB9wU", "77", ["11", "Comments"]], ["Oil-rich Gulf nations are relying on spending less and borrowing more to get through the coronavirus crisis, but with the outlook for oil clouded by uncertainty the strategy is riskier than before https://reut.rs/35yo6LJ", "79", ["12", "Comments"]], ["President Trump will travel to California to be briefed about wildfires and Democratic rival Joe Biden plans a speech on the matter from Delaware, bringing climate change to the forefront of the presidential campaign https://reut.rs/33FBlYD", "246", ["274", "Comments"]], ["The mayor of Bogota on Sunday begged forgiveness and called for reconciliation after protests in Colombia's capital left 10 civilians dead and hundreds injured.", "168", ["9", "Comments"]], ["British and European Union negotiators are likely to have a few weeks to avoid a breakdown of trade talks, but that window will close if a contentious British bill becomes law, Irish Foreign Minister Simon Coveney said on Sunday.", "49", ["9", "Comments"]], ["Six-times Formula One world champion Lewis Hamilton took a knee before the start of the Tuscan Grand Prix on Sunday with a message on his shirt declaring \"Arrest the cops who killed Breonna Taylor\".", "4.5K", ["1.3K", "Comments"]], ["Crisis-weary residents of the Greek island of Lesbos and the thousands of migrants stranded there after this week's refugee centre fire are united by one thing - they all want to see the migrants moved off the island.", "165", ["112", "Comments"]], ["Hundreds of people thronged a central square in Taiwan's capital Taipei for a Pride event on Sunday, unfurling a giant rainbow flag in front of the main memorial hall for late autocratic leader Chiang Kai-shek before being ushered away by police.", "629", ["49", "Comments"]], ["Global coronavirus cases exceeded 10 million on Sunday according to a Reuters tally, marking a major milestone in the spread of the respiratory disease that has so far killed almost half a million people in seven months https://reut.rs/2BIftBx", "397", ["82", "Comments"]], ["Workers at California's Disneyland Resort protested from their cars on Saturday, arguing that the Walt Disney Co has not agreed to adequate protections for employees when the destination reopens to the public amid a pandemic.", "889", ["63", "Comments"]], ["A pledging summit on Saturday raised 6.15 billion euros ($6.9 billion) to tackle COVID-19. The event was part of a joint initiative by the European Commission and the advocacy group Global Citizen and included a star-studded globally televised and streamed concert.", "200", ["13", "Comments"]], ["Iran launched a campaign on Saturday to motivate a reluctant public to use face masks as the country faces a sharp increase in infections and deaths from the coronavirus.", "178", ["47", "Comments"]], ["A World Health Organization (WHO)-led coalition fighting COVID-19 is asking government and private-sector donors to help raise $31.3 billion in the next 12 months to develop and deliver tests, treatments and vaccines for the disease. https://reut.rs/2Vmj9jc", "60", ["16", "Comments"]], ["Gap has entered a 10-year deal with Kanye West to create a Yeezy-Gap clothing line, sending shares of the retailer soaring. https://reut.rs/2ZbYa3R", "78", ["37", "Comments"]], ["📰 Subscribe to our newsletter https://reut.rs/2AbiBp4", "82", ["12", "Comments"]], ["Governor Gavin Newsom gives an update as COVID-19 cases spike. Watch live here: https://reut.rs/2A7ZhsP​​​​​​​", "24", ["6", "Comments"]], ["Governor Ron DeSantis gives an update on Florida's COVID-19 response as cases surge. Watch live here: https://reut.rs/3eDJkcC", "36", ["15", "Comments"]], ["House Speaker Nancy Pelosi holds her weekly news conference", "412", ["358", "Comments"]], ["UK coronavirus death toll from confirmed cases rises by 186 to 43,414", "116", ["13", "Comments"]], ["Reuters Newsmaker discussion with Managing Director of the International Monetary Fund Kristalina Georgieva, Breakingviews Global Editor Rob Cox and Global Economics Editor Swaha Pattanaik, on how the pandemic is reshaping expectations for global economic growth, financial stability, debt relief and social unrest.", "86", ["44", "Comments"]], ["From Special Reports: As the world approaches 10 million coronavirus infections, doctors across the globe share the techniques that work, the breakthroughs in research and which treatments may work for certain patients https://reut.rs/3gd06jx", "166", ["7", "Comments"]], ["WHO gives an update on the latest coronavirus developments.", "84", ["41", "Comments"]], ["Exclusive: Support for year-long democracy protests in Hong Kong has slipped, now getting the backing of a slim majority, a survey conducted for Reuters showed https://reut.rs/2ZidThU", "60", ["8", "Comments"]], ["NASA Astronauts Chris Cassidy and Bob Behnken take part in spacewalk to upgrade International Space Station power systems.👩‍🚀", "1.7K", ["265", "Comments"]], ["London police will crackdown on illegal street parties after officers came under attack for the second night running as they tried to disperse an unauthorised gathering, the capital’s police chief said https://reut.rs/2NvUfJx", "34", ["1", "Comment"]], ["Lending to euro zone companies continued to surge in May as firms relied heavily on bank credit to stay afloat amid the continent's coronavirus-related lockdown, data from the European Central Bank showed on Friday.", "56", ["1", "Comment"]], ["British police officers were attacked while attempting to disperse an illegal party overnight in west London, the second such incident in two days https://reut.rs/3g1gvXU", "59", ["25", "Comments"]], ["Liverpool fans celebrated their Premier League title win outside the club’s Anfield Stadium as their 30 year wait for the league crown finally came to an end https://reut.rs/3g49eXh", "143", ["14", "Comments"]], ["The coronavirus outbreak has now reached 220 countries and territories. 189 of those have reported fatalities. Track the spread of COVID-19 with our interactive map https://reut.rs/3g0BzOe", "85", ["16", "Comments"]], ["📰 Subscribe to our newsletter https://reut.rs/3hY7tNr", "49", ["12", "Comments"]], ["U.N. Secretary-General Antonio Guterres gives a briefing amid the global pandemic and economic uncertainty", "575", ["283", "Comments"]], ["FIFA announces the host of 2023 Women's World Cup FIFA announces the host of 2023 Women's World Cup.", "569", ["65", "Comments"]], ["U.S. Secretary of State Pompeo speaks at Brussels Forum virtual conference", "407", ["256", "Comments"]], ["Speaker Nancy Pelosi and the Congressional Black Caucus hold an event at the U.S. Capitol House Speaker Nancy Pelosi and the Congressional Black Caucus hold an event at the U.S. Capitol", "630", ["379", "Comments"]], ["UK coronavirus death toll from confirmed cases rises by 149 to 43,230", "81", ["29", "Comments"]], ["Reuters Newsmaker discussion with Former British Prime Minister Tony Blair and Reuters Editor-at-Large Axel Threlfall.", "315", ["160", "Comments"]], ["A sculptor in Latvia has unveiled a 19-foot statue of a female doctor to honor healthcare workers.", "515", ["32", "Comments"]], ["Communities from the Niger Delta take their case against oil major Shell to Britain's Supreme Court.", "105", ["3", "Comments"]], ["Australia's second most populous state deployed ambulances and mobile test centres in a coronavirus testing blitz as the country recorded the biggest daily rise in cases in two months.", "234", ["8", "Comments"]], ["WHO chief Tedros holds joint news conference with France and Germany health ministers Dr Tedros Adhanom Ghebreyesus, Director-General of the World Health Organization, holds joint news conference with France and Germany health ministers", "633", ["234", "Comments"]], ["The Indian unit of Unilever said on Thursday it will drop the word \"fair\" from its \"Fair & Lovely\" range of products, which have long been criticised for promoting negative stereotypes against people with darker skin.", "26", ["2", "Comments"]], ["India-China dispute: China appears to have added new structures near the site of a deadly border clash with India in the western Himalayas, fresh satellite pictures show https://reut.rs/31afl8u", "132", ["15", "Comments"]], ["Stuck at home, armed only with a phone and a laptop, senior advisors are finding out just how strong their relationships with clients really are while frustrated juniors are left to crunch numbers in the shadows, deprived of the personal access to the rainmakers who could give their careers a boost https://reut.rs/2B7zjpL", "27", ["5", "Comments"]], ["📰 Subscribe to our newsletter https://reut.rs/2zZiVXI", "120", ["36", "Comments"]], ["CrossFit Inc founder and former chief executive Greg Glassman has decided to sell the fitness company to Eric Roza, two weeks after stepping down amid widespread criticism for his tweet on the death of African American George Floyd in police custody.", "258", ["35", "Comments"]], ["From Breakingviews: A U.S. martini tax may dent the spirit of those seeking a drop of lockdown relief. https://reut.rs/3fSNIVw", "74", ["11", "Comments"]], ["Join Reuters for a virtual event this Thursday with Tony Blair in an exclusive conversation on global leadership https://reut.rs/3fU7H69", "77", ["36", "Comments"]], ["With impersonal anti-coronavirus masks rapidly becoming items of everyday use, a Belgian businessman decided it was time to give them a human face. Literally.", "539", ["52", "Comments"]], ["California Governor Gavin Newsom holds a briefing on the state's response to COVID-19 https://reut.rs/37VgdiH", "41", ["2", "Comments"]], ["NASA holds briefing ahead of a scheduled spacewalk", "951", ["162", "Comments"]], ["LIVE: Department of Justice employees testify to Congress about political interference on law enforcement activity", "696", ["1.1K", "Comments"]], ["WHO gives an update on the global COVID-19 outbreak", "268", ["281", "Comments"]], ["The governors of New York, New Jersey and Connecticut announced that visitors from states with high coronavirus infection rates must self-quarantine for 14 days on arrival York City.", "344", ["199", "Comments"]], ["Jamaal Bowman, a liberal Black middle-school principal, was ahead in early Democratic primary election results in his bid to oust long-time U.S. Representative Eliot Engel from a congressional seat https://reut.rs/2Z2KmZp", "276", ["45", "Comments"]], ["Gold prices surged to their highest in nearly eight years, while global shares cooled as signs of an acceleration in coronavirus cases kept investors on edge https://reut.rs/3fRRMVZ", "128", ["13", "Comments"]], ["Australia’s second most populous state said a man in his 80s died overnight from the coronavirus, the country’s first death from the virus in more than a month, as concerns about a second wave of infections saw thousands line up for COVID-19 tests https://reut.rs/2CCRwfh", "218", ["32", "Comments"]], ["The U.S. government sees no loopholes in a new rule aimed at crimping global chip sales to #Huawei and will 'aggressively' crack down on any bid to disobey the intent of the curb, Commerce Secretary Wilbur Ross said https://reut.rs/3fPQECg", "39", ["11", "Comments"]], ["Exclusive: U.S. government financing for projects to return critical supply chains to the United States as part of coronavirus response efforts could reach tens of billions of dollars. @davelawder reports https://reut.rs/3fPP1Vh", "63", ["3", "Comments"]], ["Join @Reuters for a virtual event this Thursday with Tony Blair, Executive Chairman of @InstituteGC, in an exclusive conversation on global leadership with @axelthrelfall https://reut.rs/2Z5gKuo #reuterslive", "74", ["71", "Comments"]], ["Premium cinema group Everyman Media Group said it will begin opening venues from July 4, just in time for big Hollywood releases https://reut.rs/3fRRxKx", "21", ["2", "Comments"]], ["📰 Subscribe to our newsletter https://reut.rs/3ev1Gwm", "123", ["23", "Comments"]], ["China National Biotec Group (CNBG) has won approval to run a large-scale \"Phase 3\" clinical trial of its novel coronavirus vaccine candidate in the United Arab Emirates (UAE), the company said on Tuesday.", "398", ["54", "Comments"]], ["As Saudi Crown Prince Mohammed bin Salman moved to tighten his grip on power, detaining senior royals and opponents, one person has eluded him: a former top-ranking intelligence official who was close to a key rival https://reut.rs/2Z5c2gh", "157", ["51", "Comments"]], ["Protesters gather in Washington, D.C., near the White House", "1.5K", ["968", "Comments"]], ["Out of 31 pupils in one of Clara Mijares' online classes last month, eight were missing – two had not been seen for a while. Mijares, a teacher in Madrid, said this was a fairly typical ratio these days for her lockdown sessions for 12 to 16-year-olds https://reut.rs/3hSQfAJ", "48", ["2", "Comments"]], ["Following the death of George Floyd, protests erupted across the U.S. and cellphone footage of police using force against protesters went viral. Two incidents led to firings and four led to criminal charges against officers https://reut.rs/319eg0s", "49", ["35", "Comments"]], ["Dr. Fauci, health officials testify on U.S. COVID-19 response to House panel", "841", ["718", "Comments"]], ["Italian tax police arrested 13 people, including executives of the Italian units of Germany's Siemens and France's Alstom , in an investigation into alleged bribery relating to Milan subway contracts, prosecutors said on Tuesday.", "280", ["6", "Comments"]], ["U.S. stock index futures rose on Tuesday after President Donald Trump reassured investors the trade agreement with China was intact, while upbeat business activity data from Europe boded well for U.S. surveys due later.", "46", ["9", "Comments"]], ["Novak Djokovic, the men's world number one tennis player, has tested positive for COVID-19", "1K", ["165", "Comments"]], ["JUST IN: England's social distancing rule cut to '1 metre plus'; pubs, restaurants and hairdressers to re-open", "194", ["33", "Comments"]], ["Germany's private sector recession eased further in June but coronavirus-related disruptions and uncertainty continued to weigh on demand, a survey showed on Tuesday, suggesting that Europe's largest economy is set for a slow recovery.", "96", ["1", "Comment"]], ["UK Prime Minister Boris Johnson unveils coronavirus lockdown easing plans", "716", ["468", "Comments"]], ["Former U.S. marine Paul Whelan, who was sentenced to 16 years in a Russian prison for espionage last week, will not appeal against his sentence, the Interfax news agency reported on Tuesday, citing Whelan's lawyer.", "56", ["13", "Comments"]], ["Two more staff members of President Trump’s campaign who were in Tulsa, Oklahoma for his rally over the weekend have tested positive for the coronavirus, a campaign spokesman said. https://reut.rs/2V80Jm6", "231", ["61", "Comments"]], ["Japan has given the UK just six weeks to strike a post-Brexit deal, putting Boris Johnson’s government under pressure to agree one of the fastest trade negotiations in history, the Financial Times reported.", "119", ["13", "Comments"]], ["📰 Subscribe to our newsletter https://reut.rs/2NoFRmt", "119", ["51", "Comments"]], ["Three months after the World Health Organization recommended singing \"Happy Birthday\" twice during hand washing to fight the coronavirus, Japan's Fujitsu Ltd has developed an artificial intelligence monitor it says will ensure healthcare, hotel and food industry workers scrub properly.", "65", ["14", "Comments"]], ["New Zealand extended a ban on cruise ships arriving in the country and tightened measures for visitors to exit coronavirus quarantine. https://reut.rs/2B24W43", "121", ["10", "Comments"]], ["U.S. home sales dropped to their lowest level in more than 9-1/2 years in May, strengthening expectations for a sharp contraction in housing market activity in the second quarter following disruptions caused by the COVID-19 pandemic.", "88", ["28", "Comments"]], ["NASCAR has launched an investigation after a noose was found in a garage stall at Talladega belonging to Bubba Wallace. https://reut.rs/2YnpvR7", "88", ["56", "Comments"]], ["WHO gives an update on COVID-19 as worldwide cases on brink of 9 million", "737", ["344", "Comments"]], ["D.C. Mayor Muriel Bowser gives a coronavirus update", "344", ["154", "Comments"]], ["The lack of global leadership and unity to fight the coronavirus is a bigger threat that the outbreak itself, the head of the World Health Organization said on Monday, adding that politicisation of the pandemic had made it worse.", "1K", ["241", "Comments"]], ["Prime Minister Boris Johnson will unveil the latest easing of Britain's coronavirus lockdown on Tuesday when he will also announce the conclusion of a review into whether a two-metre rule on social distancing should be relaxed, his office said.", "100", ["24", "Comments"]], ["Hundreds of thousands of Egyptian high-school pupils armed with masks, gloves and hand sanitizers started their final exams on Sunday, despite objections from some parents worried about spreading the coronavirus.", "140", ["12", "Comments"]], ["The Trump administration is doing \"a great job\" reopening the country after lockdowns to contain the novel coronavirus outbreak, Acting Homeland Security Secretary Chad Wolf said on Sunday, as infections continued to spike in some key states.", "611", ["125", "Comments"]], ["Italy is close to unveiling the approval of guarantees for a 6.3 billion euro ($7 billion) financing of Fiat Chrysler (FCA), two sources familiar with the matter said, paving the way for the largest crisis loan for a European carmaker.", "107", ["3", "Comments"]], ["A U.S. judge on Saturday denied a request by the Trump administration for an injunction to block publication of a book by President Donald Trump’s former national security adviser John Bolton that alleges the president sought China’s help to win re-election https://reut.rs/2Ngcq5Y", "353", ["49", "Comments"]], ["Saudi Arabia will end a nationwide curfew and lift restrictions on businesses from Sunday morning after three months of lockdown to curb the spread of coronavirus, state news agency SPA quoted a source in the interior ministry as saying on Saturday.", "306", ["14", "Comments"]], ["Russian President Vladimir Putin is concerned about how much he can trust arrangements with U.S. President Donald Trump amid protests in the United States, the Interfax news agency quoted Kremlin spokesman Dmitry Peskov as saying on Saturday.", "381", ["174", "Comments"]], ["Four-month-old Abdul Rahman, propped up on pillows on a blue blanket in his family's tent. Two-year-old Walid, striking a boxer's pose in the center of the mat.", "285", ["23", "Comments"]], ["From Damascus to Berlin: Reuters journalist Riham Alkousaa has spent the past few years asking refugees to share their personal stories. This time she's sharing her own.", "176", ["11", "Comments"]], ["Four-month-old Abdul Rahman, propped up on pillows on a blue blanket in his family's tent. Two-year-old Walid, striking a boxer's pose in the centre of the mat.", "227", ["10", "Comments"]], ["Russia on Saturday reported 7,889 new cases of the novel coronavirus, pushing its nationwide case tally to 576,952 since the crisis began.", "326", ["52", "Comments"]], ["Louisville’s police chief said he would fire one of three officers involved in the shooting death of Breonna Taylor, an African-American woman killed in a burst of gunfire when drug investigators mistakenly entered her home https://reut.rs/2YgWXJ5", "156", ["53", "Comments"]], ["Reverend Al Sharpton delivers a speech in Tulsa to mark Juneteenth https://reut.rs/2NgcNgV", "47", ["23", "Comments"]], ["People gather for a Black Lives Matter protest to mark Juneteenth in Washington, D.C.", "639", ["359", "Comments"]], ["People gather for Black Lives Matter protest in Washington D.C. to mark Juneteenth", "1K", ["552", "Comments"]], ["Reverend Al Sharpton marks Juneteenth in Tulsa, Oklahoma", "851", ["523", "Comments"]], ["LIVE: Juneteenth marked in Washington, D.C.", "1K", ["610", "Comments"]], ["Louisville, Kentucky, police on Friday initiated dismissal of one of three police officers involved in the March 13 shooting death of Breonna Taylor, the Louisville Metro Police Department said on Twitter.", "278", ["52", "Comments"]], ["Thousands of protesters mark 'Juneteenth' in Washington, D.C.", "1K", ["422", "Comments"]], ["British Prime Minister Boris Johnson said on Friday that people should focus less on symbols and more on the substance of racism, adding that he saw no reason for any ban on the rugby song \"Swing Low, Sweet Chariot\".", "175", ["110", "Comments"]], ["New York Governor Cuomo holds his last daily coronavirus briefing Google, Facebook and Twitter officials testify at a House panel hearing on foreign influence and election security in the tech industry.", "1.6K", ["337", "Comments"]], ["Elmo, Cookie Monster and Muppets from around the globe are joining forces for a special episode of ‘Sesame Street’ https://reut.rs/2BkFmqQ", "51", ["9", "Comments"]], ["Business sentiment among Japan's big manufacturers in the second quarter likely tanked to levels last seen during the 2009 global financial crisis as the coronavirus pandemic crushed global demand and paralysed factory output, a Reuters poll showed.", "93", ["4", "Comments"]], ["The \"Into the Wild\" bus is no longer in the wild.", "2.3K", ["324", "Comments"]], ["📰 Subscribe to our newsletter https://reut.rs/2N9iih8", "118", ["27", "Comments"]], ["China's attitude in talks with the United States this week in Hawaii cannot be described as forthcoming, although it did commit to following through on Phase One of the U.S.-China trade deal, the senior U.S. diplomat for East Asia said on Thursday.", "81", ["23", "Comments"]], ["Standing apart on either side of a strip of red carpet outside Number 10 Downing Street, Prime Minister Boris Johnson and French President Emmanuel Macron demonstrated the unusual reality of international diplomacy in the coronavirus era.", "139", ["12", "Comments"]], ["Kentucky Attorney General Daniel Cameron discusses his office's role as special prosecutor in the investigation involving the death of Breonna Taylor https://reut.rs/3fIyCC5", "31", ["7", "Comments"]], ["Google, Facebook and Twitter officials testify at a House panel hearing on foreign influence and election security in the tech industry.", "580", ["663", "Comments"]], ["Asylum-seekers like Dharamveer Solanki are the main beneficiaries of a law that Indian Prime Minister Modi's Hindu nationalist government introduced late last year. https://reut.rs/2UVePXP", "40", ["1", "Comments"]], ["New York Governor Cuomo gives an update on the state's COVID-19 recovery measures", "345", ["186", "Comments"]], ["House Speaker Nancy Pelosi holds her weekly news conference", "471", ["553", "Comments"]], ["Melvin Evans, a Memphis man whose car was struck by a bullet from the gun of an Atlanta police officer who was firing at Rayshard Brooks, holds a news conference https://reut.rs/30SlZzU", "26", ["3", "Comments"]], ["New York City Mayor de Blasio provides a coronavirus update", "205", ["126", "Comments"]], ["Exclusive: A newly discovered spyware effort attacked users through 32 million downloads of extensions to Google’s market-leading Chrome web browser, researchers at Awake Security told Reuters https://reut.rs/2ACqjJ7", "244", ["13", "Comments"]], ["Britain will keep pushing for a global solution on taxing international digital companies such as Google and Facebook Inc after the United States left negotiations, a spokesman for the British Treasury said on Thursday.", "82", ["5", "Comments"]], ["‘I had become one of the 700,000 refugees who have fled Syria and its war without end to Germany.’ Reuters journalist Riham Alkousaa’s reunification with her family after five years apart https://reut.rs/3fCLWYA", "189", ["9", "Comments"]], ["A newly discovered spyware effort attacked users through 32 million downloads of extensions to Google's market-leading Chrome web browser, researchers at Awake Security told Reuters, highlighting the tech industry's failure to protect browsers as they are used more for email, payroll and other sensitive functions.", "200", ["7", "Comments"]], ["Black mothers share the constant mental anguish of raising black sons in America https://reut.rs/30Vzmzo", "329", ["214", "Comments"]], ["📰 Subscribe to our newsletter https://reut.rs/30QbtJC", "119", ["38", "Comments"]], ["LIVE: Fulton County's district attorney announces decision on charges in fatal police shooting of Rayshard Brooks in Atlanta https://reut.rs/3dbSdJd", "49", ["34", "Comments"]], ["New York Governor Cuomo is expected to make an announcement at his daily COVID-19 briefing", "559", ["500", "Comments"]], ["WHO holds its COVID-19 briefing as the virus accelerates in the Americas", "283", ["193", "Comments"]], ["The United Nations Human Rights Council holds a debate on allegations of \"systemic racism and police brutality\" in the United States.", "357", ["280", "Comments"]], ["Republicans unveil their police reform bill.", "665", ["794", "Comments"]], ["The U.N. Human Rights Council discusses 'systemic racism and police brutality' in the U.S. The Senate Judiciary Committee holds a hearing to examine issues involving race and policing practices raised by the death of George Floyd and the civil unrest that has swept the U.S.", "627", ["357", "Comments"]], ["The World Health Organization moves to update its guidelines on treating people stricken with COVID-19 after 'great news' in drug study https://reut.rs/2URs2kA", "241", ["13", "Comments"]], ["South Korea says will no longer accept unreasonable behavior by North Korea https://reut.rs/30QlrLa", "1.1K", ["124", "Comments"]], ["A widely used steroid called dexamethasone has become the first drug shown to be able to save the lives of COVID-19 patients in what scientists said is a ‘major breakthrough’ https://reut.rs/2ChQ0zb", "717", ["106", "Comments"]], ["A bipartisan group of U.S. senators introduced a bill on Tuesday to reform aircraft certification following two fatal Boeing Co 737 MAX crashes, lawmakers said in a statement.", "117", ["6", "Comments"]], ["After 15 years working as a hair stylist in other people's salons, Gary Connell opened his \"Healthy Hair\" studio in Montgomery County, Maryland in early March, sinking his savings into a two-chair shop in a busy mall.", "134", ["55", "Comments"]], ["Minority leader Chuck Schumer and other Democratic senators hold a news conference", "510", ["396", "Comments"]], ["Senate Judiciary hearing on race and policing practices amid civil unrest The Senate Judiciary Committee holds a hearing to examine issues involving race and policing practices raised by the death of George Floyd and the civil unrest that has swept the U.S.", "510", ["831", "Comments"]], ["Virginia Governor Ralph Northam holds a briefing on the coronavirus pandemic and is expected to make an announcement with musician Pharrell Williams https://reut.rs/3hBEcrm", "27", ["2", "Comments"]], ["UK COVID-19 death toll hits 53,077, including suspected cases - @Reuters tally", "220", ["55", "Comments"]], ["A cheap and widely-used steroid called dexamethasone has become the first drug shown to be able to save lives among COVID-19 patients in what scientists said is a “major breakthrough” in the coronavirus pandemic. https://reut.rs/3d4uVVh", "1.6K", ["95", "Comments"]], ["New York Governor Cuomo holds his daily COVID-19 briefing", "461", ["176", "Comments"]], ["WHO briefing on the COVID-19 pandemic in the Americas", "410", ["133", "Comments"]], ["Federal Reserve Chair Jerome Powell testifies before Congress", "506", ["232", "Comments"]], ["New York City Mayor Bill de Blasio holds a briefing on coronavirus and discusses the city's re-opening.", "154", ["66", "Comments"]], ["Atlanta Mayor Keisha Bottoms said police officers should use 'de-escalation techniques to gain voluntary compliance and avoid or minimize the use of physical force'.", "90", ["76", "Comments"]], ["Young people set vehicles and garbage cans on fire in Dijon overnight, in a fourth night of trouble for the French city https://reut.rs/37D12ub", "42", ["16", "Comments"]], ["📰 Subscribe to our newsletter https://reut.rs/2N44SDj", "106", ["63", "Comments"]], ["Six former eBay Inc employees have been criminally charged with cyberstalking a Massachusetts couple who published an online newsletter viewed as critical of the e-commerce company, federal prosecutors in Boston said on Monday.", "112", ["10", "Comments"]], ["California Governor Gavin Newsom holds a briefing as COVID-19 infections and hospitalizations rise", "802", ["470", "Comments"]], ["Some black business owners on Washington, D.C.'s U Street say protesters against racism and police brutality are fighting for the same rights they were 52 years ago, when riots erupted in the city.", "78", ["1", "Comments"]], ["Reuters has found black people make up a disproportionate share of those who die in police encounters involving Tasers. https://reut.rs/3d2LKjD", "221", ["80", "Comments"]], ["The widow, family and lawyers of Rayshard Brooks, a black man whose death reignited protests in Atlanta over the weekend after he was shot in the back by police, hold a news conference https://reut.rs/2N2jt1U. For more @Reuters live video, watch here: https://reut.rs/2Y3wyP5", "40", ["5", "Comments"]], ["New York Governor Cuomo is set to make an announcement from Tarrytown during his COVID-19 update", "648", ["316", "Comments"]], ["The American Road: Israel is building a ring road in East Jerusalem that will cost over a quarter of a billion dollars. It says the project will cut travel times for all. Palestinians say it’s another obstacle to making East Jerusalem the capital of a future state https://reut.rs/2B6nj7J", "43", ["12", "Comments"]], ["WHO gives an update on COVID-19 as worldwide cases near 8 million", "396", ["245", "Comments"]], ["The NAACP hold a rally and march in Atlanta to demand an end to racism https://reut.rs/2Y0Svya. For more live video, follow @Reuters https://reut.rs/2ULaZ3L channel:", "42", ["19", "Comments"]], ["‘We lived in a paradise, and now we will live under a highway’: East Jerusalem resident Khader Attoun on a new ring road Israel is building. ‘Israel wants to squeeze us out of or land,’ he says. Israeli officials say the new road will cut travel times for all https://reut.rs/2UNyuJr", "80", ["32", "Comments"]], ["Before the novel coronavirus brought its pandemic to New Delhi, Aamir was one of tens of thousands of people making a living in the Indian capital as a taxi driver. Now his days are spent transporting corpses from the hospital to cremation pyres and cemeteries, sometimes stacked on top of each other six at a time, their names written in permanent marker on their burial shrouds https://reut.rs/2YEVew6", "99", ["5", "Comments"]], ["Patrick Hutchinson, the black man who carried a suspected far-right protester to safety in a viral photo captured by Reuters during protests in London, says he and his friends ‘did what we had to do.’ https://reut.rs/3hsQn9T", "291", ["55", "Comments"]], ["The crowded daily commute in London has long been a source of misery for millions. But getting to work will be even more of a challenge following Britain’s coronavirus lockdown https://reut.rs/2V0V9Cf", "50", ["1", "Comment"]], ["A Russian court found former U.S. marine Paul Whelan guilty of spying for the United States on Monday and sentenced him to 16 years in jail, a move the U.S. ambassador to Moscow called an egregious violation of human rights that would harm ties.", "157", ["19", "Comments"]], ["BP will take a writedown of up to $17.5 billion in its second-quarter earnings after sharply lowering its long-term oil and gas price outlook as it now expects a faster transition away from fossil fuels.", "118", ["5", "Comments"]], ["Before the novel coronavirus brought its pandemic to New Delhi, this 38-year-old was one of tens of thousands of people making a living in the Indian capital as a taxi driver. Now his days are spent transporting the dead https://reut.rs/30UvDCr", "85", ["2", "Comments"]], ["The number of publicly accessible charging points for electric vehicles (EV) jumped 60% in 2019, the biggest increase in three years and outpacing sales of battery-powered cars, according to the International Energy Agency (IEA).", "150", ["9", "Comments"]], ["Crunch time for China's robot startups as pandemic brings pain and opportunities https://reut.rs/2Yz3aiG", "39", ["1", "Comment"]], ["Hong Kong's Disneyland theme park said on Monday it will reopen on June 18 to a reduced number of visitors and with enhanced health measures after the coronavirus outbreak forced it to close in late January.", "33", ["1", "Comment"]], ["Oil prices fell on Monday, with U.S. oil dropping more than 2%, as a spike in new coronavirus cases in the United States raised concerns over a second wave of the virus which would weigh on the pace of fuel demand recovery.", "195", ["12", "Comments"]], ["📰 Subscribe to our newsletter https://reut.rs/3hmYZPz", "130", ["23", "Comments"]], ["The U.S. Centers for Disease Control and Prevention (CDC) on Sunday reported 2,063,812 cases of the new coronavirus, an increase of 25,468 cases from its previous count, and said that the number of deaths had risen by 646 to 115,271.", "516", ["152", "Comments"]], ["La Liga's organising body has said it is filing for criminal action against the man who ran on to the pitch during Real Mallorca's behind-closed-doors match against Barcelona on Saturday to try to get a photo with Lionel Messi.", "64", ["3", "Comments"]], ["Britain's government is looking at options for its two-week quarantine for people entering the country and might be able to make changes to the rules, finance minister Rishi Sunak said on Sunday.", "60", ["9", "Comments"]], ["Brazil has registered 850,514 confirmed cases of new coronavirus and the total death toll reached 42,720, the Ministry of Health said on Saturday.", "630", ["61", "Comments"]], ["Chanting \"We are culture\", matadores and bullfighting supporters demonstrated on Saturday across Spain, seeking government support for the sector after the coronavirus pandemic halted its season.", "170", ["63", "Comments"]], ["Financial aid has slowly trickled in for tennis players in the lower echelons of the sport during the COVID-19 shutdown but the vast majority of men and women who coach them for a living have been left to fend for themselves.", "45", ["3", "Comments"]], ["Google and the NFL have joined a growing list of companies choosing to commemorate Juneteenth https://reut.rs/37mXlZE", "129", ["6", "Comments"]], ["The U.S. Department of Health and Human Services issued a rule that would lift anti-discrimination protections under Obamacare for transgender people and women seeking abortions. https://reut.rs/37qS4QT", "385", ["109", "Comments"]], ["From Cecil Rhodes in England and Captain James Cook in Australia to Christopher Columbus in the United States and King Leopold II in Belgium, the imperialists are under attack. https://reut.rs/2XUvT2f", "270", ["47", "Comments"]], ["Hiding from Myanmar's police, journalist Aung Marm Oo refuses to conceal his anger with the civilian government led by Nobel Laureate Aung San Suu Kyi as his country prepares for an election later this year.", "114", ["1", "Comments"]], ["Yves Hanoulle has been working from home throughout Belgium's coronavirus lockdown, but he has still managed to walk about 1,500 km (930 miles) by pacing through each day on a treadmill installed under his desk.", "359", ["22", "Comments"]], ["New York Governor Cuomo is set to make an announcement at his daily briefing", "779", ["551", "Comments"]], ["The World Health Organization gives an update on the global COVID-19 outbreak", "319", ["234", "Comments"]], ["Mong Kok marks anniversary of Hong Kong demonstrations", "814", ["140", "Comments"]], ["New York City Mayor de Blasio gives coronavirus update New York Governor Cuomo gives a COVID-19 response update", "396", ["153", "Comments"]], ["Cirque du Soleil Entertainment Group is exploring debt restructuring options that include a potential bankruptcy filing, after it was forced to cancel shows because of the coronavirus outbreak, people familiar with the matter said.", "178", ["14", "Comments"]], ["Prototypes of a coronavirus antibody test which could be a game-changer in the fight against the pandemic are being assessed and are ready to be optimized, the developer of the technology said. https://reut.rs/2UJGlXI", "417", ["27", "Comments"]], ["Follow live updates: https://reut.rs/2JjLbWi and see more video here: https://reut.rs/2y647VT", "238", ["51", "Comments"]], ["New York Governor Cuomo provides a coronavirus update", "1.8K", ["596", "Comments"]], ["Russian hostel manager Valerie Azure has spent the past three nights sleeping on the floor of a Malaysian airport along with her young son, after Southeast Asian nations sealed borders and cancelled flights in the wake of the coronavirus pandemic.", "174", ["8", "Comments"]], ["Norway's sovereign wealth fund, the world's largest, has lost 1.33 trillion Norwegian crowns ($124 billion) so far this year as stock markets have plunged due to the coronavirus pandemic, it said on Thursday.", "238", ["15", "Comments"]], ["Local analysts in China choose credibility over cheerleading and Heineken tests the liquidity of Europe’s corporate bond market. @Breakingviews columnists across the globe tackle the latest financial fallout from Covid-19 https://reut.rs/3dtQKz6", "38", ["4", "Comments"]], ["Cruise ships told to 'immediately' leave Australian waters, after the country’s worst outbreak of the coronavirus was traced to a cruise liner that docked in Sydney Harbour last week https://reut.rs/2WHJ728 Follow our live blog for the latest updates on coronavirus: https://reut.rs/3dAO7Mb", "135", ["6", "Comments"]], ["'Apocalypse now': Airlines turn to cargo for revenue as U.S. Senate approves aid package https://reut.rs/3dxZB2C Follow the latest news on coronavirus with our live blog: https://reut.rs/3dybB4f", "83", ["1", "Comment"]], ["Kat Volpe laid out an exercise mat and tried to sync her iPhone with her big screen TV for a fitness class webcast on Instagram last week during New York's coronavirus lockdown.", "75", ["25", "Comments"]], ["WHO gives an update on the global coronavirus outbreak", "1.5K", ["940", "Comments"]], ["Senate expected to vote on coronavirus relief package today", "364", ["359", "Comments"]], ["Follow live updates: https://reut.rs/2QM7fgb", "471", ["154", "Comments"]], ["The U.S. Senate on Tuesday was negotiating a nearly $2 trillion emergency bill that aims to counter some of the economic toll of the coronavirus pandemic.", "155", ["178", "Comments"]], ["Anheuser-Busch InBev , the world's largest brewer, said on Tuesday it was scrapping its 2020 outlook as the scale of the coronavirus increased.", "71", ["5", "Comments"]], ["German customs officials are trying to track down about 6 million face masks, ordered to protect health workers from the coronavirus, that they say went missing at an airport in Kenya.", "1.2K", ["185", "Comments"]], ["Follow live updates: https://reut.rs/2y6XmTV", "311", ["22", "Comments"]], ["New York Governor Cuomo gives an update on coronavirus from New York City's Javits Center", "2.2K", ["1.2K", "Comments"]], ["Singapore-based Lazada's latest coronavirus measures have led to widespread anger among staff and illustrate how Alibaba’s business practices have sometimes played poorly abroad and hindered its overseas ambitions https://reut.rs/33KPLpJ", "22", ["1", "Comment"]], ["A nighttime curfew imposed by the Bolivian president to try to slow the spread of the coronavirus in the Andean country faces opposition from sex workers, who say their already precarious livelihoods are at stake.", "288", ["43", "Comments"]], ["Exclusive: Elite hackers tried to break into the WHO earlier this month as cyberattacks against the agency soar", "618", ["75", "Comments"]], ["The United States should lift sanctions if it wants to help Iran to contain the coronavirus outbreak, Iranian President Hassan Rouhani said on Monday, adding that Iran had no intention of accepting Washington's offer of humanitarian assistance.", "416", ["198", "Comments"]], ["WHO holds a briefing on the coronavirus outbreak", "1.5K", ["631", "Comments"]], ["Follow live updates here: https://reut.rs/2xVo1Ts", "319", ["65", "Comments"]], ["New York Governor Cuomo gives a coronavirus update", "1K", ["463", "Comments"]], ["With the coronavirus pandemic in the United States intensifying, Senate Democrats and Republicans will scramble on Monday to come to an agreement on a far-reaching $1 trillion-plus coronavirus stimulus package after a procedural vote to advance the measure failed and left the massive relief effort in legislative limbo.", "114", ["181", "Comments"]], ["With more employees working from home to help slow the spread of the coronavirus, demand jump for chips, laptops and network goods https://reut.rs/3ag93Ga Follow the latest news on coronavirus with our live blog: https://reut.rs/39d3neL", "46", ["4", "Comments"]], ["Canada became the first country to boycott the Tokyo Games due to the coronavirus pandemic and Australia told its athletes to prepare for an Olympics next year as Japan and the IOC flagged the prospect of a postponement for the first time https://reut.rs/2QCPDDy", "353", ["46", "Comments"]], ["Prime Minister Narendra Modi tells Indians to stay at home and save themselves from coronavirus as Delhi locks down https://reut.rs/2QF4P2R Follow our live blog for the latest updates on coronavirus: https://reut.rs/3bnWrwv", "111", ["15", "Comments"]], ["A Senate Republican coronavirus stimulus package would provide financial aid to U.S. airports, transit systems and passenger railroad Amtrak, but $50 billion for struggling U.S. airlines would be a loan, not a cash payout, the proposal showed.", "91", ["99", "Comments"]], ["Russia did not seek an end to cooperation with OPEC or a sharp drop in oil prices, a senior Russian official told the TASS news agency, saying the Gulf nations are to blame for the crisis on global oil markets.", "278", ["63", "Comments"]], ["Follow live updates here: https://reut.rs/2QCWvRa", "498", ["105", "Comments"]], ["In normal times massive unemployment and a collapse in economic output would be tragic.", "161", ["18", "Comments"]], ["Spain's death toll from the coronavirus epidemic soared to 1,720 on Sunday from 1,326 the day before, according to multiple media outlets citing the latest health data.", "461", ["38", "Comments"]], ["Russia never sought a sharp oil price fall or an end to cooperation with Organization of Petroleum Exporting Countries (OPEC), and the Gulf nations are to blame for the crisis on the global oil markets, a senior Russian official said.", "227", ["55", "Comments"]], ["The Spanish government said on Saturday it would do whatever was needed to combat the coronavirus pandemic and warned that \"the worst is yet to come\" after the national toll surpassed 1,300 deaths and reached close to 25,000 cases.", "776", ["35", "Comments"]], ["Follow live updates here: https://reut.rs/2wsLnPV", "453", ["127", "Comments"]], ["Live updates on the coronavirus outbreak: https://reut.rs/2xjQEcD", "468", ["63", "Comments"]], ["A Belgian distillery has switched from producing gin to disinfectants after medical authorities sought additional supplies to cope with coronavirus spreading in the country.", "1.1K", ["71", "Comments"]], ["The Trump administration plans to send a special energy envoy to Saudi Arabia to work with the kingdom on stabilizing the global oil market, officials said on Friday, as the U.S. scrambles to deal with a price crash so deep that regulators in Texas considered curbing production there for the first time in nearly 50 years.", "298", ["94", "Comments"]], ["North Korea fired two projectiles that appeared to be short-range ballistic missiles into the sea off the east coast of the Korean peninsula, South Korea’s military said. Analysts say the move is a show of confidence amid the coronavirus pandemic. https://reut.rs/3dlfvgL", "675", ["188", "Comments"]], ["For the last few days, unease and paranoia have followed Ann Ostberg like a black cloud, as the coronavirus swept through the United States, reaching all 50 states by this week.", "172", ["20", "Comments"]], ["Sri Lanka imposed a nationwide weekend curfew as South Asian countries escalated efforts to check the spread of coronavirus across the densely populated region of 1.9 billion people. https://reut.rs/2wdKpHr", "92", ["18", "Comments"]], ["WHO holds briefing on coronavirus pandemic", "2.3K", ["674", "Comments"]], ["The number of journeys on London’s underground train network has fallen by around 70% and on buses by roughly 40% as the authorities advised against all but essential travel due to the coronavirus outbreak. https://reut.rs/2Wx52ZU", "58", ["4", "Comments"]], ["Follow our liveblog for the latest developments around the outbreak https://reut.rs/3demnfT", "194", ["45", "Comments"]], ["Prime Minister Trudeau addresses Canada's coronavirus plans", "189", ["165", "Comments"]], ["Governor Cuomo gives an update on coronavirus plans in New York state", "465", ["282", "Comments"]], ["Sri Lanka imposed a nationwide weekend curfew on Friday as South Asian countries escalated efforts to check the spread of coronavirus across the densely populated region of 1.9 billion people.", "97", ["5", "Comments"]], ["Normally bustling Times Square is free of crowds amid coronavirus outbreak", "4.8K", ["491", "Comments"]], ["The United States sent Iran a blunt message this week: the spread of the coronavirus will not save it from U.S. sanctions that are choking off its oil revenues and isolating its economy.", "1.2K", ["527", "Comments"]], ["Britain’s Price Harry told army veterans on Thursday that he was “really sorry” his Invictus Games international sporting event was postponed by at least a year due to the coronavirus outbreak, in a video posted on Twitter. https://reut.rs/392yRnz", "59", ["7", "Comments"]], ["EXPLAINER: The outbreak of disease caused by coronavirus has raised questions about a phenomenon known as 'herd immunity.' What is it and will it affect the pandemic? https://reut.rs/391OLP3 Follow the latest news on coronavirus with our live blog: https://reut.rs/391ylX7", "67", ["9", "Comments"]], ["Follow Reuters liveblog for the latest developments around the coronavirus outbreak https://reut.rs/2xUwKFE", "464", ["105", "Comments"]], ["Love in the time of coronavirus? As governments invoke emergency powers to combat the coronavirus pandemic, and social distancing measures preclude meeting people in bars, cafes or restaurants, love - or at least lust - is still finding a way via dating apps https://reut.rs/3b6nIDJ", "41", ["6", "Comments"]], ["The NYSE is putting its tech ambitions on the spot by finally going all-electronic. Meanwhile, investors are hungry for Blue Apron, but the meal-kit service faces stiff competition. Catch Breakingviews’ latest commentary on the financial impact of coronavirus in one place: https://reut.rs/2U3eoKZ", "50", ["3", "Comments"]], ["New York City Mayor de Blasio gives coronavirus update", "670", ["382", "Comments"]], ["Canadian Prime Minister Justin Trudeau said that he expects the closure of the United States-Canada border to come into effect overnight on Friday and was working with domestic carriers to bring home citizens stranded overseas. https://reut.rs/2J1jNw0", "181", ["37", "Comments"]], ["Ford Motor Co on Thursday moved to hoard cash on its balance sheet, drawing down $15.4 billion from two credit lines and suspending its dividend, in a move to bolster reserves to ride out damage to its business from the coronavirus pandemic.", "95", ["7", "Comments"]], ["From their windows and porches across Israel, people support medical teams fighting coronavirus", "1.1K", ["296", "Comments"]], ["Follow live updates here: https://reut.rs/3dhkqzA", "370", ["70", "Comments"]], ["Canada's Trudeau gives coronavirus update", "667", ["170", "Comments"]], ["New York's Governor Andrew Cuomo provides a coronavirus update", "525", ["251", "Comments"]], ["The United Kingdom was bracing on Thursday for the virtual shut down of London as underground train stations across the capital closed and Prime Minister Boris Johnson mulled tougher measures to tackle the coronavirus crisis.", "87", ["5", "Comments"]], ["The most recent data available shows 475 more people have died from coronavirus in Italy. That's the largest single-day increase in the country since the pandemic began https://reut.rs/2vDbKCA", "884", ["203", "Comments"]], ["The U.S. Food and Drug Administration on Wednesday granted Abbott Laboratories approval to sell a test for the new coronavirus, as more companies begin producing much needed diagnostics for the pathogen that has set off a global pandemic.", "168", ["46", "Comments"]], ["Hundreds of millions of people faced a world turned upside down on Wednesday by unprecedented emergency measures against the coronavirus pandemic that is killing the old and vulnerable and threatening prolonged economic misery.", "133", ["20", "Comments"]], ["U.S. regulators are considering giving banks additional regulatory points for lending to mid- to low-income Americans hurt by the coronavirus, as they seek to mitigate the economic impact of the pandemic, an official within a banking agency told Reuters.", "77", ["18", "Comments"]], ["South Korea’s health officials summoned medical companies to a Seoul train station conference room, during lunar New Year celebrations, to come up with an effective test immediately to detect the novel coronavirus which was already running rampant in China.", "263", ["79", "Comments"]], ["WHO holds briefing on coronavirus pandemic The World Health Organization provides updates on the global coronavirus outbreak.", "954", ["417", "Comments"]], ["Follow live coronavirus updates here: https://reut.rs/2WqCtNA", "386", ["103", "Comments"]], ["Governor Cuomo provides an update on coronavirus actions in New York", "503", ["139", "Comments"]], ["The northern region of Lombardy, on the frontline of Italy's battle against the coronavirus, appealed to recently retired doctors and nurses on Wednesday to return to work and help colleagues overwhelmed by the crisis.", "270", ["57", "Comments"]], ["Biden projected to win Arizona, according to media networks, giving him a sweep of all three of tonight's primaries https://reut.rs/2IUM6fx", "329", ["175", "Comments"]], ["U.S Senate Majority Leader Mitch McConnell said on Tuesday \"we're not leaving town\" until senators have passed another coronavirus aid bill.", "359", ["160", "Comments"]], ["Biden is projected to win Illinois, according to media networks. Follow live updates from tonight's primary contests: https://reut.rs/2UiaI71. Track the delegates awarded to candidates so far: https://reut.rs/3a0mJVw", "356", ["176", "Comments"]], ["A win in Florida gives front-runner Biden the biggest delegate haul of the night. Follow live updates on tonight's primary contests: https://reut.rs/3d9PReQ", "421", ["153", "Comments"]], ["Turkey has identified 93 suspects who have made \"unfounded and provocative\" postings on social media about the coronavirus outbreak and has detained 19 of them, the Turkish Interior Ministry said.", "413", ["180", "Comments"]], ["Wall Street reacts to Fed moves related to #coronavirus", "780", ["134", "Comments"]], ["If it takes two to tango, then the national dance of Argentina may come up one short in the age of #coronavirus. Classes, shows and traditional gatherings have been suspended in Buenos Aires for at least 15 days as the community adheres to the government https://reut.rs/3b9111T", "165", ["13", "Comments"]], ["Governor Cuomo gives a #coronavirus update on New York", "784", ["356", "Comments"]], ["U.S. drugmaker Pfizer Inc has signed a deal with Germany's BioNTech SE <22UAy.F> to co-develop a potential vaccine for the coronavirus using BioNTech's mRNA-based drug development platform, the companies said on Tuesday.", "335", ["25", "Comments"]], ["The coronavirus shockwaves rippling through U.S. stocks are forcing investors to contemplate outcomes more dire than a recession, including several quarters of declining economic activity, a credit crisis or even a depression.", "61", ["24", "Comments"]], ["Australian researchers map immune response from one of country’s first coronavirus patients https://reut.rs/3d76h7K Follow the latest news on #coronavirus with our live blog: https://reut.rs/39W2YOZ", "255", ["8", "Comments"]], ["Hong Kong to quarantine all visitors entering the city starting midnight on Thursday to prevent an 'explosion' of coronavirus cases around the world https://reut.rs/2IQFGOt Follow our live blog for the latest updates on #coronavirus: https://reut.rs/2ISxT2B", "147", ["3", "Comments"]], ["France is to introduce restrictions on movement starting from midday (1100 GMT) on Tuesday, and for 15 days, to try to curb the spread of coronavirus, French President Emmanuel Macron said in a televised address to the nation.", "395", ["53", "Comments"]], ["#Coronavirus Task Force updates Americans on virus measures", "874", ["1.2K", "Comments"]], ["Canada's Trudeau provides a #coronavirus update outside his home", "647", ["287", "Comments"]], ["Madrid's streets were eerily quiet on Monday as Spaniards spent their first working day under a state of emergency which a minister said will need to be extended beyond the two weeks initially envisaged.", "136", ["3", "Comments"]], ["U.S. stocks plunge at NYSE open U.S. stocks plunge amid fears of the global economy tipping into a coronavirus-driven recession", "1.8K", ["579", "Comments"]], ["Follow live #coronavirus updates: https://reut.rs/2w2ry21", "520", ["158", "Comments"]], ["Dow Jones down 9.7%, S&P 500 down 8% and Nasdaq down 6% as markets open post Fed interest rate cut", "532", ["193", "Comments"]], ["Philippine President Rodrigo Duterte will impose \"enhanced community quarantine\" across the country's entire main island of Luzon, his spokesman said on Monday, adding to existing measures aimed at containing the spread of coronavirus.", "109", ["11", "Comments"]], ["Vietnam has confirmed four more cases of coronavirus, all among foreign nationals, its health ministry said on Sunday, bringing its total number of cases to 57.", "311", ["51", "Comments"]], ["Morocco on Sunday suspended day all international passenger flights to and from its airports as a protective measure against the spread of coronavirus, the foreign ministry said.", "513", ["38", "Comments"]], ["Spain's Prime Minister Pedro Sanchez confirmed a 15-day nationwide lockdown on Saturday as part of state of emergency measures to control the spread of the coronavirus.", "393", ["67", "Comments"]], ["Russian President Vladimir Putin has formally asked the country's constitutional court if it is legal for him to change the constitution, the Kremlin said on Saturday, a move that could allow him to remain in power until 2036.", "895", ["224", "Comments"]], ["Swedish teen Greta Thunberg, the founder of the Fridays for Future youth movement, on Wednesday called on fellow climate activists to move their weekly rallies online due to the spreading coronavirus outbreak.", "745", ["180", "Comments"]], ["Microsoft Corp co-founder Bill Gates has stepped down from the company's board to dedicate more time to his philanthropic priorities including global health, education and tackling climate change, the company said on Friday.", "1K", ["79", "Comments"]], ["Air pollution over northern Italy fell after the government introduced a nationwide lockdown to combat coronavirus, satellite imagery showed on Friday, in a new example of the pandemic's potential impact on emissions.", "555", ["42", "Comments"]], ["British cases of coronavirus rose 35% to 798 over the past 24 hours, health authorities said.", "949", ["143", "Comments"]], ["House Speaker Pelosi speaks on #coronavirus economic relief bill", "838", ["447", "Comments"]], ["Follow live #coronavirus updates here: reut.rs/31RorVL", "587", ["176", "Comments"]], ["WHO gives #coronavirus update", "1.2K", ["792", "Comments"]], ["All of Russia's 85 regional parliaments have voted in favor of constitutional amendments that would allow Vladimir Putin to run for president again in 2024, the RIA news agency cited senior Russian lawmaker Andrei Klishas as saying on Friday.", "637", ["224", "Comments"]], ["Britain's foreign minister Dominic Raab said the U.S.-led response to the attack on coalition forces in Iraq was \"swift, decisive and proportionate\" and warned that anyone seeking to harm those forces could expect a strong response.", "144", ["40", "Comments"]], ["Stuck at home because of China’s tough measures to rein in the spread of #coronavirus, millions of people are discovering the joy of cooking https://reut.rs/2Qd0Nyr Follow our live blog for the latest updates on #coronavirus: https://reut.rs/3aOt5Y7", "83", ["5", "Comments"]], ["Canadian Prime Minister Justin Trudeau's wife, Australia's minister for home affairs and a Chelsea soccer player are among new cases of the coronavirus that has infected almost 135,000 people and killed more than 4,900 worldwide.", "85", ["8", "Comments"]], ["U.S. shale producers are seeking sharp service costs cuts to deal with plummeting prices and shrinking demand, according to executives and a letter sent to top providers, driving home the oil industry's desperate efforts to cope with a market dive.", "89", ["23", "Comments"]], ["Disneyland will close its theme parks in California starting on Saturday. More coronavirus updates: https://reut.rs/2W6MXBt", "230", ["14", "Comments"]], ["Colombia on Thursday declared a health emergency to contain an outbreak of the novel coronavirus, suspending public events with more than 500 people - including the football league - and preventing cruise ships from docking at its ports.", "169", ["25", "Comments"]], ["Brazil President Jair Bolsonaro's communications secretary, who attended a meeting at Donald Trump’s Florida resort on Saturday and posted a photo of himself standing next to the U.S. president, has tested positive for coronavirus, a Brazil newspaper says.", "337", ["57", "Comments"]], ["CDC says 36 people with #coronavirus have died in the U.S., up from 29 https://reut.rs/2vTcSCe", "35", ["44", "Comments"]], ["U.S. health officials testify at House committee hearing on coronavirus", "629", ["479", "Comments"]], ["After importing medical supplies to Lebanon for 20 years, Hassan Hamdan shut his business in December. Sales were plummeting, clients couldn't pay, and the dollars he needed to buy imports had dried up. Now he drives an Uber.", "75", ["1", "Comments"]], ["Brazil has become one of the top cocaine suppliers to Europe, transforming the Latin American country’s role in the trans-Atlantic drug trade at a speed that has stunned anti-narcotics authorities https://reut.rs/2vZWnUQ", "338", ["42", "Comments"]], ["The National Basketball Association suspends season until further notice after a Utah Jazz player tested positive for the coronavirus https://reut.rs/38I9nM4 Follow our liveblog for the latest developments around the new #coronavirus outbreak: https://reut.rs/39Ixxax", "69", ["13", "Comments"]], ["The National Basketball Association said it was suspending the season until further notice after a Utah Jazz player tested positive for coronavirus. Live updates: https://reut.rs/38N5cOZ", "397", ["38", "Comments"]], ["New York Governor Cuomo provides update on coronavirus pandemic", "601", ["206", "Comments"]], ["Thailand will temporarily suspend issuing visas on arrival to visitors from 19 countries and territories, including China, to contain the spread of the coronavirus, its interior minister said on Wednesday.", "265", ["54", "Comments"]], ["WHO classifies coronavirus as a pandemic", "1.8K", ["544", "Comments"]], ["Live updates: https://reut.rs/2ICdHBQ", "578", ["206", "Comments"]], ["Watch the NYSE in real time", "456", ["155", "Comments"]], ["Former movie producer Harvey Weinstein, whose sexual assault conviction last month was hailed as a victory for the #MeToo movement against sexual misconduct by powerful men, is expected to be sentenced at a criminal court in Manhattan on Wednesday.", "173", ["85", "Comments"]], ["Air freight rates are skyrocketing after the grounding of many passenger flights in Asia has left shippers scrambling to book limited spots on cargo planes as Chinese industrial production restarts, according to industry insiders.", "49", ["13", "Comments"]], ["Watch the NYSE in real time", "360", ["234", "Comments"]], ["U.S. President Donald Trump has not been tested for coronavirus - White House https://reut.rs/2TBLqlc Follow our live blog for the latest updates on #coronavirus: https://reut.rs/38IQ9Gp", "274", ["288", "Comments"]], ["China should replace its ambassador in the Czech Republic after the Chinese embassy sent a threatening letter to Czech authorities, Prime Minister Andrej Babis said, a position that may further strain relations between the two countries.", "188", ["55", "Comments"]], ["The 24-hour update on #coronavirus. More here: https://reut.rs/2xljMQR", "1.1K", ["472", "Comments"]], ["Protesters take to the streets of Hong Kong for New Year's Day march. More here: https://reut.rs/2MJeHa3", "3.9K", ["485", "Comments"]], ["Thousands in New York City watch the ball drop in Times Square to mark a new decade #2020NewYear", "3.4K", ["623", "Comments"]], ["As a global clean-fuel mandate takes effect Jan. 1, testing companies examining newer, low-sulfur marine blends acquired in Antwerp, Belgium; Houston and Singapore have found sediment at levels that could damage the engines of ocean-going vessels.", "66", ["1", "Comments"]], ["French President Emmanuel Macron said on Tuesday he wanted a strong relationship with post-Brexit Britain.", "123", ["41", "Comments"]], ["Israel's $3.6 billion offshore Leviathan field started production on Tuesday, paving the way for multi-billion dollar gas export deals with Egypt and Jordan in the coming weeks.", "290", ["126", "Comments"]], ["Britain's Prince William launched a multi-million pound prize on Tuesday to encourage the world's greatest problem-solvers to find answers to Earth's biggest environmental problems, saying the planet was now at a tipping point.", "1.1K", ["158", "Comments"]], ["The results of a survey conducted for Reuters in Hong Kong show little public support for the denunciations of China by hardline protesters, some of whom have called for independence or scrapping the ‘one country, two systems’ model. More here: https://reut.rs/37pYuOI", "32", ["7", "Comments"]], ["We're breathing microplastic, eating it and drinking plastic-infused water every day. Reuters Graphics illustrates what this amount of plastic actually looks like over various periods of time. More here: https://reut.rs/2ZEa7ip", "154", ["17", "Comments"]], ["Amounts of microplastic ingested by humans over different time periods were calculated from estimates in a recent WWF study. Reuters Graphics visualizes the findings. More here: https://reut.rs/2ZG3UCt", "200", ["11", "Comments"]], ["A plateful of plastic: Reuters Graphics visualizes the amount of microplastic we consume over various periods of time. More here: https://reut.rs/2SQFULV", "354", ["32", "Comments"]], ["Ousted Nissan boss Carlos Ghosn confirms he is in Lebanon, saying he refused to be “held hostage” by a “rigged” Japanese justice system, raising questions about how one of the world’s most-recognized executives exited Japan months before his trial. More here: https://reut.rs/2F6pkj1", "259", ["59", "Comments"]], ["Swiss food giant Nestle said on Monday it had completed a 20 billion Swiss franc ($20.7 billion) share buyback program and reiterated plans for a new one up to the same amount starting next year.", "63", ["27", "Comments"]], ["Netflix Inc's original film \"Murder Mystery,\" starring Jennifer Aniston and Adam Sandler, topped a list of the streaming service's most popular releases of 2019 in the United States, Netflix said in a statement on Monday.", "80", ["30", "Comments"]], ["South African telecoms firm MTN on Monday said it was reviewing allegations raised in a U.S. complaint which accuses several firms of paying protection money to extremist groups in Afghanistan.", "27", ["6", "Comments"]], ["A Cyprus court found a British woman guilty of lying about being gang-raped by Israeli youths six months ago. https://reut.rs/2SOgSNt", "153", ["124", "Comments"]], ["The New England Patriots were stunned by the Miami Dolphins on Sunday, costing them a first-round bye in the playoffs, while the Philadelphia Eagles won the National Football Conference (NFC) East division on the final day of the NFL regular season.", "384", ["28", "Comments"]], ["Russian President Vladimir Putin and his German counterpart Angela Merkel agreed to further support the Nord Stream 2 gas pipeline project in a phone call on Sunday, the Kremlin said.", "314", ["166", "Comments"]], ["South Africa swept to a 107-run victory over England on the fourth day of the first test at Centurion Park on Sunday after taking seven wickets in the second session to go ahead in the four-match series.", "47", ["4", "Comments"]], ["India’s tourism industry has been hit by a wave of violent anti-government protests against a new citizenship law that have rocked several cities this month, with at least seven countries issuing travel warnings. More here: https://reut.rs/2t8skIW", "129", ["17", "Comments"]], ["Turkey's foreign minister warned that the Libyan conflict risks sliding into chaos and becoming the next Syria, as he sought to speed up legislation to allow it to send troops to the North African country.", "158", ["132", "Comments"]], ["An attacker stabbed five people at a Hasidic rabbi’s home in New York state and fled before apparently being arrested. More here: https://reut.rs/2u168Rm", "534", ["67", "Comments"]], ["Fired-up paceman James Pattinson smashed through New Zealand's top order with three quick wickets as New Zealand's chase of an improbable 488-run victory target got off to a disastrous start on day four of the Boxing Day test on Sunday.", "24", ["1", "Comment"]], ["The South Pacific island nation of Samoa has lifted a six week-state of emergency after the infection rate from a measles outbreak that has swept the country started to come under control.", "344", ["72", "Comments"]], ["German cabin crew will go on strike from Monday to Wednesday next week at Lufthansa's < LHAG.DE> budget airline Germanwings, the UFO labor union said Friday.", "51", ["4", "Comments"]], ["A liquid nitrogen explosion at a Textron Aviation plant near Wichita, Kansas, injured 11 people on Friday, potentially setting back the introduction of a new aircraft under development, county and company officials said.", "245", ["39", "Comments"]], ["A firm run by the daughter of Bruce Lee has sued a Chinese fast food for using the late kungfu star’s image in its logo without permission and is seeking over 210 million yuan ($30 million) in compensation, Chinese media outlet reported. https://reut.rs/2Zsmzln", "121", ["35", "Comments"]], ["UPDATE: A Bek Air plane with 93 passengers and five crew members on board crashed near the city of Almaty in Kazakhstan shortly after taking off, killing at least 15 people. More here: https://reut.rs/2sqv1oZ", "1.6K", ["61", "Comments"]], ["Former Los Angeles Galaxy star Zlatan Ibrahimovic has decided on a second stint with AC Milan, per a published report on Thursday.", "69", ["3", "Comments"]], ["Communities across Asia commemorated the more than 230,000 victims of the Indian Ocean tsunami on the 15th anniversary of one of the world's most deadly disasters. More here: https://reut.rs/2tT5Dsv", "444", ["12", "Comments"]], ["Hundreds of anti-government protesters and their supporters gathered outside a tiny restaurant in Hong Kong for an unconventional Christmas dinner, sharing paper plates piled high with food under neon street signs.", "225", ["6", "Comments"]], ["Brazilian President Jair Bolsonaro said on Tuesday night that he briefly lost his memory after falling at his presidential residence in Brasilia, the capital, earlier this week.", "465", ["179", "Comments"]], ["Thousands of Algerians gathered on Wednesday for the funeral procession of the country's powerful army chief, who fought for independence from France as a young man and this year became the country's de facto leader.", "95", ["12", "Comments"]], ["Indian Muslims protesting against a citizenship law which they say is discriminatory are carrying national flags and copies of the constitution, aiming to prevent supporters of the Hindu nationalist government from painting them as anti-India.", "666", ["178", "Comments"]], ["U.S. Open champion Bianca Andreescu is still dealing with a left knee injury with the start of the Australian Open less than four weeks away.", "47", ["4", "Comments"]], ["In a working-class corner of south Delhi, a nearly 1-kilometre (half mile) stretch of a wide, six-lane highway connecting India's capital city with a burgeoning suburb has been blockaded for 10 days.", "103", ["45", "Comments"]], ["China and the United States have agreed terms of a Phase 1 trade deal under which the United States reduced some tariffs and Beijing canceled retaliatory duties that were scheduled to take effect on Dec. 15.", "39", ["19", "Comments"]], ["Tim Clark will retire as the president of Emirates Airline at the end of June 2020 after more than three decades at the state-controlled business that has helped to transform Dubai into one of the world's major travel crossroads.", "96", ["6", "Comments"]], ["World stocks flatlined near record highs on Tuesday and remained on track for their best year in a decade, as China's latest policy easing pledges added to the optimism generated by signs of detente in the 17-month long Sino-U.S. trade war.", "66", ["53", "Comments"]], ["Dubai's Emaar to sell the view from the world's tallest skyscraper - the Burj Khalifa. More here: https://reut.rs/2Sldlpr", "91", ["20", "Comments"]], ["The biggest news events of the past decade have been chronicled from space.", "66", ["1", "Comment"]], ["German automaker BMW AG said on Monday it was being investigated by the U.S. Securities and Exchange Commission following a report of a probe related to the company's sales practices.", "41", ["4", "Comments"]], ["Saudi Arabia on Monday sentenced five people to death and three more to jail terms totaling 24 years over the killing of Saudi journalist Jamal Khashoggi in Istanbul in October last year.", "74", ["56", "Comments"]], ["As Christmas pilgrims pore over the intricately carved Nativity scenes in Bethlehem shop windows, few pause to consider that some of the wood used comes from olive trees older than the events of the ancient story they depict.", "97", ["24", "Comments"]], ["About 1,500 people were killed during the less than two weeks of unrest that started in mid November, interior ministry officials told Reuters. That includes at least 17 teenagers and about 400 women as well as some members of the security forces and police. Tehran has blamed last month’s unrest in Iran on people linked to its opponents in exile and the country’s main foreign foes, namely the U.S., Israel and Saudi Arabia. https://reut.rs/35LOKho", "184", ["50", "Comments"]], ["With a week until the implementation of International Maritime Organization (IMO) rules that will slash the permitted level of sulfur in marine fuels, shippers appear to be favoring very low-sulfur fuel oil (VLSFO) mixes over distillate fuels.", "34", ["5", "Comments"]], ["The $2.2 trillion repurchase agreement market - part of the inner workings of the U.S. financial system - is facing what could be another strain as the year comes to a close. That could have wider implications than just Wall Street.", "65", ["2", "Comments"]], ["About 1,500 people were killed during the recent November unrest in Iran, government officials tell Reuters, significantly more than estimates from rights groups and from U.S. State Department. More here: https://reut.rs/2SpXAgO", "194", ["21", "Comments"]], ["In our latest #Backstory, Zeba Siddiqui made the trip to a village in northern India’s rural heartland to tell the story of a young woman who told police she was set ablaze by five men, including two she had accused of rape last year. More here: https://reut.rs/35T4CyA", "92", ["2", "Comments"]], ["The NFL's competition committee is expected to discuss how to simplify what players need to say following the coin toss, ESPN's Adam Schefter reported Sunday.", "55", ["42", "Comments"]], ["China has lifted a ban on deboned beef from Japanese cows under 30 months old, the General Administration of Customs said in a notice, ending an almost two-decade long restriction on beef imports from the country.", "95", ["20", "Comments"]], ["Real Madrid's Zinedine Zidane still believes Pep Guardiola is the best in the business despite the Manchester City boss being questioned in England for the first time with his side trailing Premier League leaders Liverpool by 14 points.", "51", ["12", "Comments"]], ["Armilla Yanti was returning from her regular Sunday trip to the market in this Indonesian city when a towering tsunami wave crashed ashore. She and her parents survived, but her two sisters were killed on that fateful day on Dec. 26, 2004.Fifteen years on, she frequently relives the traumatic events when recounting her story to visitors at the Aceh Tsunami Museum, where she works as a guide.", "35", ["5", "Comments"]], ["Brazil's President Jair Bolsonaro said on Friday that U.S. President Donald Trump told him in a phone conversation that his administration will not levy additional tariffs on Brazilian steel and aluminum as threatened earlier this month.", "170", ["77", "Comments"]], ["The Democratic U.S. presidential hopefuls headed back to the campaign trail on Friday after a debate that featured attacks on rising contender Pete Buttigieg's lack of political experience and fundraising from wealthy donors.", "30", ["15", "Comments"]], ["How murder, kidnappings and miscalculation set off Hong Kong’s revolt: An inside look at how Hong Kong's now withdrawn extradition bill was launched, promoted and ultimately unravelled - based on more than 50 interviews with mainland Chinese officials, current and former Hong Kong government officials, members of Carrie Lam’s cabinet, associates and friends of the Hong Kong leader, and police officers https://reut.rs/2s5admM", "121", ["14", "Comments"]], ["Boeing launched its new astronaut capsule on an unmanned debut journey to the International Space Station, but the #Starliner capsule had not yet reached the orbit required for it to get to the station. More here: https://reut.rs/34GlwPB", "232", ["66", "Comments"]], ["Ethiopia launched its first satellite into space on Friday, as more sub-Saharan African nations strive to develop space programs to advance their development goals and encourage scientific innovation.", "1.7K", ["245", "Comments"]], ["How murder, kidnappings and miscalculation set off Hong Kong’s revolt: An inside look at how Hong Kong's now withdrawn extradition bill was launched, promoted and ultimately unravelled - based on more than 50 interviews with mainland Chinese officials, current and former Hong Kong government officials, members of Carrie Lam’s cabinet, associates and friends of the Hong Kong leader, and police officers https://reut.rs/35COIs9", "83", ["12", "Comments"]], ["Australia's competition regulator said the federal court has penalized Volkswagen AG a record A$125 million ($86 million) for allegedly making false representations about compliance with the country's diesel emission standards.", "65", ["3", "Comments"]], ["Semiconductor company Mellanox Technologies has received approval from EU antitrust and Mexico for its proposed acquisition by chipmaker Nvidia for $6.8 billion, a regulatory filing showed on Thursday.", "58", ["1", "Comment"]], ["The U.S. Senate, rushing to meet a looming deadline, approved and sent to President Donald Trump a $1.4 trillion package of fiscal 2020 spending bills that would end prospects of government shutdowns at week's end when temporary funding expires.", "95", ["39", "Comments"]], ["Alarms sound and then screens and mics are shut off during U.N. headquarter meetings, forcing ambassadors to shout their speeches across the chamber. It’s the result of new measures to cut costs at U.N. centers such as Geneva and New York https://reut.rs/2Z7wrki", "49", ["9", "Comments"]]]