[["“Given the president’s refusal to participate on October 15th, we hope the Debate Commission will move the Biden-Trump Town Hall to October 22nd, so that the president is not able to evade accountability.”", "51", ["31", "Comments"]], ["Americans got a dose of politics and debate as they used to know it last night. The Campaign 2020 Podcast welcomes Washington Times legal affairs and politics reporter Alex Swoyer to recap and discuss the vice presidential debate, including the economy, taxes, COVID-19, and the upcoming confirmation hearings for Supreme Court nominee Amy Coney Barrett. Listen below, and visit http://www.washingtontimes.com/elections for all of our #Campaign2020 coverage", 0, ["4", "Comments"]], ["“Just as PETA sent humane bug catchers to candidate Hillary Clinton and President Barack Obama after their televised insect encounters, we’re sending one to Joe Biden in the hope that his team will market these cruelty-free contraptions to kindhearted Americans, rather than taking their frustrations out on insects.”", "42", ["14", "Comments"]], ["The sheriff’s department stuck an undercover officer at the post office to watch the box, and said they struck pay dirt Wednesday when someone came to collect the ballots.", "298", ["58", "Comments"]], ["The debate reportedly cut out for nearly three minutes on CNN in China, which is typically restricted to some hotels and residential compounds but not in most homes.", "403", ["107", "Comments"]], ["“We’ve told the White House we are at the table. We are at the table. We want to continue the conversation.\"", "284", ["253", "Comments"]], ["They demanded a briefing for members of Congress on whether any political interference is discovered.", "108", ["86", "Comments"]], ["In an open letter to the more than 100,000 employees of the US Justice Department, Lawyers Defending Democracy said they will have the backs of anyone who stands against Barr’s policies.", "274", ["149", "Comments"]], ["“Come here tomorrow. We’re going to be talking about the 25th Amendment.”", "670", ["352", "Comments"]], ["In an affidavit, an FBI agent said members of a Michigan militia had planned to assassinate Whitmer and overthrow the government. The militia was not identified in the court filing.", "455", ["335", "Comments"]], ["“They come within an inch of my face, sometimes. They want to hug me and they want to kiss me and they do. And frankly, I’m not telling them to back up. I’m not doing it.”", "274", ["235", "Comments"]], ["The new timeline laid out by the president, should it become reality, would mark a much quicker exit than initially planned.", "83", ["24", "Comments"]], ["“We’ll pass on this sad excuse to bail out Joe Biden and do a rally instead.”", "1.4K", ["441", "Comments"]], ["The WHCA board also said any journalists who have been at the White House since Sept. 26 should be tested for COVID-19.", "87", ["48", "Comments"]], ["Vice President Mike Pence and California Sen. Kamala Harris clash cordially in the lone vice presidential debate in Utah, President Trump returns to work in the Oval Office following his coronavirus diagnosis, and more on today's Front Page Podcast. Listen below, or visit http://www.washingtontimes.com/frontpage to read these stories and subscribe for free.", "5", ["6", "Comments"]], ["Across the country, hiring has slowed just as federal rescue aid has run out, hampering an economy still climbing out of the deep hole created by the pandemic.", "18", ["80", "Comments"]], ["“Do you care about Black lives? I do. Unlike people who currently run Baltimore, I actually have a plan to make life better for the people here. A broken Baltimore does not have to be our future.\"", "929", ["21", "Comments"]], ["The commission said they made the move “in order to protect the health and safety of all involved” with the debate.", "676", ["505", "Comments"]], ["Attorneys for Michael Flynn on Wednesday demanded U.S. District Judge Emmet Sullivan recuse himself from the case.", "412", ["102", "Comments"]], ["“Polls consistently show that people don’t like Donald Trump or Joe Biden. We have a situation where two people are running for office who nobody likes. People should notice, ‘Oh my gosh, I have an alternative.’”", "132", ["121", "Comments"]], ["“This administration has forfeited their right to re-election,” she said.", "2.6K", ["1.3K", "Comments"]], ["President Trump on Wednesday weighed in on the first and only vice presidential debate Wednesday.", "1.1K", ["813", "Comments"]], ["Mike Pence looked more presidential than his boss.", "360", ["455", "Comments"]], ["There was briefly another participant swooping into Wednesday night’s vice presidential debate.", "249", ["244", "Comments"]], ["Sen. Kamala Harris refused to say Wednesday during the vice presidential debate if a Biden administration would pack the Supreme Court with new justices.", "1.1K", ["580", "Comments"]], ["Kamala Harris and Mike Pence are running with the two oldest presidential candidates in history: Democratic nominee Joe Biden is 77, and President Trump is 74.", "182", ["201", "Comments"]], ["“When I look at their plan that talks about advancing testing, creating new PPE and developing the vaccine, it looks a little bit like plagiarism, which is something Joe Biden knows a little bit about.”", "3.8K", ["790", "Comments"]], ["Vice President Mike Pence pushed Sen. Kamala Harris on undermining a COVID-19 vaccine during Wednesday’s vice presidential debate in Utah, suggesting she’s trying to score political points.", "1.2K", ["426", "Comments"]], ["Biden has changed course on China and is trying to outflank President Trump, accusing his Republican rival of being weak on Beijing.", "264", ["111", "Comments"]], ["“I think it’s a tragedy the president deals with COVID like it is something not to be worried about when already 210,000 people have died.”", "288", ["166", "Comments"]], ["“Katie Hill took advantage of her subordinates,” one tweet said. “She caused immense harm to the people who worked for her, many of whom were young women.”", "50", ["3", "Comments"]], ["Missouri Gov. Mike Parson said Wednesday he “most certainly would” pardon a St. Louis couple if they are convicted of gun charges after waving guns at protesters walking in front of their home.", "1.7K", ["257", "Comments"]], ["Donald Trump Jr. accused House Speaker Nancy Pelosi of having “substance issues” Wednesday after she reportedly suggested that coronavirus treatment has mentally affected his father.", "773", ["313", "Comments"]], ["A prosecutor who declined to file charges after a white bar owner fatally shot a Black man during protests has switched political parties after fellow Democrats criticized his handling of the case.", "332", ["30", "Comments"]], ["Liberal commentator Keith Olbermann announced he is leaving ESPN so he can focus on political commentary ahead of the election.", "568", ["183", "Comments"]], ["It’s a stunning strategy to match the extraordinary times.", "725", ["281", "Comments"]], ["“What a great gift, what a tremendous opportunity, we are so lucky.\"", "772", ["496", "Comments"]], ["“Harris is a danger to law and order because she refuses to condemn loudly and clearly the lawlessness and the violence that has beset our nation in so many cities.”", "610", ["132", "Comments"]], ["“The president told us that he had learned from this, and obviously he has not. Instead, he’s ramping up his deception in a last-ditch effort because of his electoral prospects. It’s just very disappointing.”", "278", ["143", "Comments"]], ["The doctor said Trump’s oxygen levels and respiratory rate are normal, too, so he hasn’t required supplemental oxygen since the weekend.", "1.1K", ["368", "Comments"]], ["“It’s hard to see any clear sane path on what he’s doing, but the fact is he saw the political downside of his statement of walking away from the negotiations.”", "511", ["509", "Comments"]], ["“Biden is a good man, Donald Trump is not.”", "2.7K", ["1.5K", "Comments"]], ["Graham is now one of six Republican incumbent senators in that “Toss-Up” category, along with Sens. David Perdue of Georgia, Joni Ernst of Iowa, Susan Collins of Maine, Steve Daines of Montana and Thom Tillis of North Carolina.", "66", ["81", "Comments"]], ["The court, though, is keeping the subpoena seeking the records at bay, for now, so the president can appeal its decision to the Supreme Court.", "233", ["273", "Comments"]], ["President Trump 'works from home' at the White House, the Trump campaign's push to capture a greater share of LGBTQ voters, and more on today's Front Page Podcast. Listen below, or visit http://www.washingtontimes.com/frontpage to read these stories and subscribe for free.", "6", ["3", "Comments"]], ["“Hopefully we can convince Speaker Pelosi to do something on a stand-alone basis…she’d rather spend zero than $1.6 trillion and I don’t know if the American people will accept that.”", "227", ["71", "Comments"]], ["The NFL’s COVID-19 problem didn’t become any easier Wednesday as more positive tests raise questions about this week’s slate of games.", "13", ["15", "Comments"]], ["“I hate knocking a Democrat, but Tim Kaine didn’t bring anything to the table. Now we have somebody who we are excited about who is running for vice president.\"", "857", ["442", "Comments"]], ["As the movement enters the mainstream, its sympathizers are escalating the violence from throwing rocks and blocking doors to physical assaults and, for the first time, killing.", "517", ["353", "Comments"]], ["Today, Moscow’s armed forces may still be no match for U.S. and NATO power, but analysts say that is exactly the way Kremlin wants it.", "38", ["15", "Comments"]], ["Acosta complained that it’s “so damn frustrating” to report on Trump’s White House because the people around him operate in “a different reality.”", "115", ["99", "Comments"]], ["Liban Osman said that Omar Jamal, a Project Veritas source and Minneapolis community activist, told him the undercover investigative outfit would pay him $10,000 to say that he was rounding up ballots for the Minnesota congresswoman.", "154", ["56", "Comments"]], ["The Republican Party chairwoman of a county that provided 12 percent of President Trump’s winning margin in Pennsylvania four years ago criticized the president’s state campaign for ignoring her requests.", "78", ["35", "Comments"]], ["In the midst of an hours-long Twitter tear on the “Russia Hoax,” the stimulus bill and charges of election fraud, President Trump took time out to take a shot at Nancy Pelosi’s attractiveness.", "379", ["157", "Comments"]], ["A recent survey finding that 45% of gay men in the U.S. plan to support President Trump has spurred double-takes and furious debate over whether the left-skewing LGBTQ electorate may be taking a Trumpian turn.", "449", ["142", "Comments"]], ["President Trump pulled the nuclear option Tuesday, ordering mass declassification of all documents related to Russia and Hillary Clinton.", "2.4K", ["762", "Comments"]], ["Prosecutors lacked evidence to continue pursuing the rioting charges against state Rep. Attica Scott, Jefferson County Attorney Mike O’Connell said during an arraignment hearing.", "533", ["136", "Comments"]], ["Stuck in the White House residence, President Trump is campaigning by tweet and barking out orders from his sickbed and rooms that have morphed into a makeshift Oval Office.", "201", ["241", "Comments"]], ["Democratic presidential candidate Joe Biden says he and President Donald Trump “shouldn’t have a debate” as long as the president remains positive for the coronavirus.", "1.1K", ["794", "Comments"]], ["Stephen Miller, President Donald Trump’s senior adviser and speechwriter, tested positive for the coronavirus Tuesday.", "311", ["307", "Comments"]], ["UPDATE: Vice President Mike Pence has reportedly relented on the use of plexiglass screens at Wednesday’s debate in Salt Lake City.", "687", ["363", "Comments"]], ["President Trump is reporting no symptoms of COVID-19 and is doing “extremely well,” his doctor said Tuesday.", "615", ["101", "Comments"]], ["Roger Montoya, a Democratic candidate in an open state House race, has acknowledged his participation in two pornographic films.", "137", ["90", "Comments"]], ["From @Washington Times Opinion: It's fear mixed with politics. Cheryl Chumley sits down with South Dakota Gov. Kristi Noem for her take on shutting down an entire nation, an entire economy, entire school and church and business communities.", "42", ["6", "Comments"]], ["A Honolulu police officer cited Jerome Adams after seeing him with two men “looking at the view taking pictures.”", "57", ["20", "Comments"]], ["A Texas grand jury has indicted streaming giant Netflix on child pornography charges.", "1.9K", ["234", "Comments"]], ["A grand jury on Tuesday indicted Mark and Patricia McCloskey, the St. Louis couple who displayed guns while hundreds of racial injustice protesters marched on their private street.", "2.2K", ["1K", "Comments"]], ["The CIA wrote a highly classified three-page memo to FBI Director James Comey and Agent Peter Strzok telling them candidate Hillary Clinton had approved a plan to blame Russian computer-hacking on Donald Trump.", "3.5K", ["1K", "Comments"]], ["Eddie Van Halen, the guitar virtuoso whose blinding speed, control and innovation propelled his band Van Halen into one of hard rock’s biggest groups, has died. He was 65.", "143", ["12", "Comments"]], ["Wolf called the move “a gradual adjustment to our lives as we learn how we can do things safely,” until a vaccine for the virus is available.", "51", ["16", "Comments"]], ["The president blamed the collapse on House Speaker Pelosi, who he said was asking for too much funding for state and local governments.", "2.3K", ["1.1K", "Comments"]], ["“This is the most complete indictment of media bias ever.”", "275", ["32", "Comments"]], ["“As this outbreak continues to grow, it is critical that the public and those who may have been exposed have access to accurate and transparent information.”", "100", ["36", "Comments"]], ["The Vice Commandant of the Coast Guard, Admiral Charles Ray, tested positive for COVID-19 on Monday. He was tested after feeling mild symptoms over the weekend.", "77", ["18", "Comments"]], ["The companies said Trump violated their policies about misinformation surrounding COVID-19.", "800", ["344", "Comments"]], ["“Chairman Powell’s warning could not be more clear: robust action is immediately needed to avert economic catastrophe from the devastation of the coronavirus pandemic.”", "243", ["154", "Comments"]], ["Dr. Conley, in a memo, said the president enjoyed a “restful first night at home” and his vital signs remain stable, with an oxygen saturation level of 95%-97%.", "743", ["245", "Comments"]], ["“I am looking forward to the debate on the evening of Thursday, October 15th in Miami. It will be great!”", "872", ["253", "Comments"]], ["“Our country is in chaos because of a president who isn’t up to the job, and if we want to regain any kind of stability, we’ve got to ensure that every eligible voter is informed and engaged in this election.”", "4.2K", ["2.5K", "Comments"]], ["President Trump returns to the White House from his coronavirus hospitalization at Walter Reed Medical Center, some parents aren't happy with the speed of schools reopening for in-person learning, and more on today's Front Page Podcast. Listen below, or visit http://www.washingtontimes.com/frontpage to read these stories and subscribe for free.", "10", ["6", "Comments"]], ["The group that works to support President Trump’s judicial picks is expecting a bitter nomination battle when next week’s Senate hearings on the nomination begin, so it added muscle with expert knowledge of the Senate and federal courts to advocate for Judge Barrett’s appointment.", "422", ["59", "Comments"]], ["Some Catholics are urging caution against misreading Pope Francis‘ latest encyclical letter, which denounces runaway capitalism and capital punishment, but also lambastes a “throwaway” culture that harms the unborn and the elderly.", "79", ["81", "Comments"]], ["Senate Democrats have said the nomination of a Supreme Court nominee is a high-stakes process, and the hearings should be done in person.", "858", ["144", "Comments"]], ["More school districts are beginning to open up for in-person classes, but for many parents, the pace of reopening remains too slow, driven by teachers unions and politics rather than what is best for children.", "164", ["95", "Comments"]], ["Baldwin also stated on Twitter that he wants the president to be OK so he can be voted out of office next month.", "177", ["151", "Comments"]], ["The Trump administration is seizing on regional unease over China’s construction of military bases on artificial islands in the South China Sea, as well as Beijing’s growing use of “wolf warrior” diplomacy and its crackdown on domestic dissent in places such as Hong Kong.", "114", ["26", "Comments"]], ["“The only responsible response to that would be to pass legislation making Roe the law of the land. That’s what I would do.”", "751", ["451", "Comments"]], ["“If the numbers dictate it, then we would have to. You wouldn’t take anything off the table if the numbers dictate it.”", "217", ["171", "Comments"]], ["The push to put conservative Judge Amy Coney Barrett on the high court before Nov. 3 is like nothing seen in U.S. history so close to a presidential election.", "1.6K", ["243", "Comments"]], ["The Supreme Court on Monday reinstated a requirement that South Carolina residents voting by mail in November’s election get a witness to sign their ballots.", "701", ["43", "Comments"]], ["“Trump people are completely secret. They whisper. My right hand to God, they’ll open the curtain and say, ‘I can’t have a Trump sign. They’ll vandalize my home.’”", "1.5K", ["563", "Comments"]], ["Michigan’s health department issued a mask requirement and other coronavirus restrictions Monday, just days after the state Supreme Court invalidated Gov. Gretchen Whitmer’s orders.", "357", ["131", "Comments"]], ["The GOP has unleashed a secret weapon against Democrats: Rep. Ilhan Omar.", "847", ["229", "Comments"]], ["“Anybody who contracts the virus by essentially saying, ‘masks don’t matter, social distancing doesn’t matter,’ I think is responsible for what happens to them,” Joe Biden said.", "569", ["483", "Comments"]], ["“Instead of talking about, the only thing I heard was one of the tweets saying that ‘don’t be so concerned about all this’ essentially. There’s a lot to be concerned about.”", "397", ["171", "Comments"]], ["New York Gov. Andrew Cuomo says he’s ready and willing “to close the synagogues” over continued resistance to coronavirus rules by the Orthodox Jewish community.", "1K", ["399", "Comments"]], ["President Trump returned to the White House Monday to continue his round-the-clock fight against the coronavirus after a three-day hospital stay.", "3.5K", ["884", "Comments"]], ["President Trump on Monday walked out of the military hospital where for three days he had been receiving an unprecedented level of care for COVID-19.", "1.4K", ["391", "Comments"]], ["TIPP’s numbers should be watched closely.", "79", ["44", "Comments"]], ["“So it begins,” said J. Christian Adams, president of the Public Interest Legal Foundation. “Vote in PERSON if you want your vote to count.”", "446", ["82", "Comments"]], ["A high school football game was canceled after anti-government activist Ammon Bundy refused to wear a mask or leave school grounds.", "279", ["198", "Comments"]], ["Left-wing conspiracies made it to the top of Twitter’s trending news feed on Monday with the hashtag #TrumpCovidHoax after good news regarding the president’s recovery.", "363", ["275", "Comments"]], ["The city of Tulsa removed a massive Black Lives Matter painting on Monday after activists painted it without the city’s permission.", "2.6K", ["414", "Comments"]], ["“This is a matter of humanity, but also of leadership by example.”", "467", ["294", "Comments"]], ["“Feeling really good! Don’t be afraid of Covid. Don’t let it dominate your life.”", "3.2K", ["1.8K", "Comments"]], ["Tracy’s tweet followed the news Monday that White House press secretary Kayleigh McEnany had tested positive for COVID-19, making her the 11th person in the president’s close circle to contract the virus.", "569", ["395", "Comments"]], ["The poll, released Monday, found that 56% of people surveyed believe the U.S. government’s actions are a “significant cause” of the current situation.", "582", ["670", "Comments"]], ["The giant panda team revealed the sex of cub online using a painting made by male giant panda Tian Tian, the cub’s father, which had blue paint strokes.", "24K", ["267", "Comments"]], ["The legal battle arose out of Nebraska, where lawmakers amended criminal law to deny juveniles who are adjudicated of certain crimes the right to possess a firearm until the age of 25.", "56", ["12", "Comments"]], ["Toomey said he was fulfilling a personal term-limits vision, having served just three terms in the US House from 1999 to 2005, then winning two Senate terms, first in 2010 and again in 2016.", "144", ["36", "Comments"]], ["“As an essential worker, I have worked diligently to provide needed information to the American People at this time.”", "2.5K", ["1.3K", "Comments"]], ["The delay could push the hearing back until after the election, dimming Republican hopes the hearing could produce an “October Surprise” about the Obama-era Justice Department’s investigation into President Trump’s 2016 campaign and alleged ties to Russia.", "464", ["218", "Comments"]], ["“The president and his team have been behaving as if the pandemic is over.”", "1.6K", ["1.3K", "Comments"]], ["President Trump leaves his quarantine at Walter Reed Medical Center to greet supporters, China is making a push for key leadership posts at United Nations agencies, and more on today's Front Page Podcast. Listen below, or visit http://www.washingtontimes.com/frontpage to read these stories and subscribe for free.", "19", ["12", "Comments"]], ["“We are still optimistic that he will be able to return to the White House later today, with his medical professionals making that determination later today.”", "1K", ["453", "Comments"]], ["\"The person there now tends to be a real true believer — in places like the Consumer Financial Protection Bureau or the Environmental Protection Agency especially — and you wind up with an absence of real public accountability over what is governing our lives.”", "59", ["9", "Comments"]], ["China is making a concerted push for control of the post-World War II institutions created to uphold the international order, often using bribery and economic coercion to get its way.", "311", ["204", "Comments"]], ["The battle for the faith vote heated up over the weekend as the Biden campaign launched a trio of ads aimed at winning over churchgoers.", "1.5K", ["1.2K", "Comments"]], ["“We need to have trust that what they’re telling us about the President’s condition is real.”", "974", ["767", "Comments"]], ["State and county officials in New Jersey are contacting more than 200 people who were at President Donald Trump’s Bedminster golf club for Thursday’s campaign fundraiser.", "66", ["105", "Comments"]], ["“If @realDonaldTrump were my patient ...\"", "2.7K", ["1.9K", "Comments"]], ["Several top deputies of Ken Paxton, Texas’ attorney general, have reported to law enforcement that their boss engaged in crimes including bribery and abuse of office, according to an internal letter.", "155", ["50", "Comments"]], ["Senate Democrats seized on the White House coronavirus outbreak in a bid to delay the confirmation of Supreme Court nominee Judge Amy Coney Barrett but the GOP majority won’t slow down.", "419", ["154", "Comments"]], ["Jennifer Harper writes: \"One veteran journalist believes these circumstances could benefit Mr. Trump and 'will reelect him.'\"", "820", ["347", "Comments"]], ["Lawmakers say the fact that The Times has what it claims to be Mr. Trump’s tax data means “there is a strong prospect that a felony crime was committed” by someone who leaked the legally protected information.", "1.1K", ["172", "Comments"]], ["The FBI whistleblower who is cooperating with a Justice Department probe of the bureau was an early skeptic of reports that said retired Army Lt. Gen. Michael Flynn had done something inappropriate with a Russian-born scholar.", "366", ["42", "Comments"]], ["Attorney General William Barr will self-quarantine out of caution after President Donald Trump and several other lawmakers and aides tested positive for the coronavirus.", "559", ["230", "Comments"]], ["Trump took a brief ride in a black SUV Sunday to wave to supporters outside of the military hospital where he is being treated for the coronavirus.", "4.6K", ["1.2K", "Comments"]], ["\"I learned a lot about COVID.\"", "2.2K", ["1.2K", "Comments"]], ["“It is not working,” she said of the president’s law-and-order posture. “I think because of his message. … It just gets too out of hand. His message escalates things more.”", "682", ["433", "Comments"]], ["Chris Rock joked about how the pandemic has ruined much of 2020. The actor-comedian sarcastically showed empathy toward Trump being hospitalized after his virus diagnosis.", "296", ["184", "Comments"]], ["Shutdowns would happen starting Wednesday in nine ZIP codes in the city, Mayor Bill de Blasio said.", "461", ["253", "Comments"]], ["“Anyone around the vice president [is] tested. People are kept very safe. And again, we can’t hide from this virus forever,” Jason Miller told NBC’s “Meet the Press.”", "691", ["140", "Comments"]], ["But the Republican governor repeatedly declined to criticize the president and his aides for flouting safety rules during Tuesday’s debate in Cleveland.", "167", ["126", "Comments"]], ["Symone Sanders said the Biden campaign hopes President Trump, who tested positive for the virus late Thursday, is medically able to participate.", "186", ["165", "Comments"]], ["The doctors said the hope is to discharge the president as soon as Monday if he continues to do better.", "1.9K", ["933", "Comments"]], ["He said that the government is “steady at the tiller” and that he planned to brief the president on security matters later Sunday.", "802", ["266", "Comments"]], ["Pelosi said the administration has been “anti-science” and needs to take testing and tracing and mask-wearing more seriously.", "1K", ["994", "Comments"]], ["In an evening health update, Conley said Trump had been up and moving around his medical suite without difficulty and conducting business. “While not yet out of the woods, the team remains cautiously optimistic,” he said.", "880", ["485", "Comments"]], ["“I came here, wasn’t feeling so well, I feel much better now, we’re working hard to get me all the way back.\"", "6.1K", ["1.4K", "Comments"]], ["“QAnon and the theories it promotes are a danger and a threat that has no place in our country’s politics.”", "595", ["396", "Comments"]], ["“Mr. McCabe is willing, able and eager to testify in person…. but he is not willing to put his family’s health at risk to do so. For these reasons, we are unwilling to appear in person for the October 6 hearing.”", "544", ["236", "Comments"]], ["“The Attorney General is feeling well and has tested negative for COVID-19 both yesterday and today,” Justice Department spokeswoman Kerri Kupec said in a tweet.", "1.1K", ["109", "Comments"]], ["Rubio said a significant increase in conspiracy theories and outrageous claims warranted the Trump administration regularly providing accurate details about the president’s medical condition.", "147", ["110", "Comments"]], ["Without mentioning Trump by name, Twitter reiterated part of its abusive behavior policy that prohibits posts “that wish or hope for death, serious bodily harm or fatal disease” against anyone.", "297", ["91", "Comments"]], ["Rep. Matt Gaetz, Florida Republican, joined the Democrat days earlier by co-sponsoring a similar resolution calling on the US drop its case against  Snowden, who is wanted for leaking as well.", "474", ["60", "Comments"]], ["Doctors gave President Trump a dose of the antiviral drug remdesivir at Walter Reed National Military Medical Center as a second treatment for his COVID-19 infection, his White House physician said late Friday.", "215", ["257", "Comments"]], ["Christie said that he will be receiving medical attention and “will keep the necessary folks apprised of my condition.”", "302", ["119", "Comments"]], ["The Senate will reconvene on October 19th, but McConnell vowed the delay will not interrupt the set start date for Supreme Court nominee Judge Amy Coney Barrett’s confirmation hearings.", "471", ["141", "Comments"]], ["The announcement makes Johnson the third Republican senator to test positive for COVID-19, the contagious disease caused by the novel coronavirus, in a span of roughly 24 hours.", "656", ["659", "Comments"]], ["Dr. Conley said repeatedly the president is not on oxygen “right now” but was evasive about whether he had been at any point.", "656", ["356", "Comments"]], ["“We’re praying for the president and his wife, and we’re praying for this nation,”", "1.9K", ["638", "Comments"]], ["Actor Tom Arnold tweeted Hope Hicks‘ “personal cell” number after she tested positive for COVID-19.", "444", ["210", "Comments"]], ["Football great Herschel Walker has accused California Gov. Gavin Newsom of “pandering” by signing first-of-its-kind legislation establishing a task force to develop reparations proposals for Black residents.", "993", ["126", "Comments"]], ["The 25th Amendment provides some answers about how presidential power could be transferred, either temporarily or more permanently.", "91", ["137", "Comments"]], ["Ms. Conway's daughter, Claudia, broke the news of her mother's condition earlier Friday evening on social media platform TikTok.", "776", ["315", "Comments"]], ["“He will fight through this with the same strength and conviction that he uses to fight for America each and every day,” Eric Trump said. “I ask you to join me in praying for his recovery.”", "4.5K", ["1.3K", "Comments"]], ["Rep. Ilhan Omar, a frequent target of President Donald Trump's, is blasting him for what she calls “actively spreading a deadly virus.”", "1K", ["1K", "Comments"]], ["North Korean leader Kim Jong-un on Saturday sent a message of sympathy to President Donald Trump and his wife Melania, wishing they would recover from the COVID-19 illness.", "2.1K", ["460", "Comments"]], ["A fifth person who attended the White House ceremony last weekend for President Trump’s Supreme Court pick has tested positive for COVID-19, fueling speculation that the Rose Garden gathering is becoming a “superspreader” event.", "303", ["288", "Comments"]], ["Senate Minority Leader Charles E. Schumer and the top Democrat on the Judiciary Committee Sen. Dianne Feinstein called on Senate Republicans to delay Supreme Court nominee Judge Amy Coney Barrett’s hearing.", "827", ["410", "Comments"]], ["Mr. Obama delivered his remarks during a fundraiser with Democratic Vice Presidential nominee Sen. Kamala Harris.", "264", ["251", "Comments"]], ["President Trump thanked the nation for supporting him Friday night as he left the White House to be hospitalized for COVID-19.", "3.5K", ["972", "Comments"]], ["A former top campaign staffer to both Hillary Clinton and former President Obama is facing fierce backlash for a tweet wishing death to President Trump.", "759", ["498", "Comments"]], ["Joseph R. Biden’s campaign is pulling negative ads from the air for the time being in light of President Trump’s positive coronavirus diagnosis.", "437", ["324", "Comments"]], ["President Trump was being hospitalized Friday night at Walter Reed Military Medical Center Friday for an expected stay of several days after being diagnosed with COVID-19.", "504", ["439", "Comments"]], ["The Michigan Supreme Court on Friday struck down months of orders by Gov. Gretchen Whitmer that were aimed at preventing the spread of the coronavirus.", "1.6K", ["228", "Comments"]], ["Liberal filmmaker Michael Moore on Friday cast doubts on President Trump’s positive COVID-19 diagnosis, saying the president is “not above weaponizing” the virus to buoy his chances in the election.", "858", ["444", "Comments"]], ["Supreme Court nominee Amy Coney Barrett and her husband had coronavirus earlier this year and recovered, according to two administration officials.", "654", ["93", "Comments"]], ["“It’s not a political issue, it’s a public health issue. And if I could say one thing to all of the people out there watching: Forget the politics. This is a public safety health issue.”", "430", ["437", "Comments"]], ["“We simply cannot allow the administration’s cavalier attitude to adversely affect this branch of government.”", "773", ["396", "Comments"]], ["“The positive test is a good reminder for me and perhaps for all of how vigilant we need to be.”", "119", ["70", "Comments"]], ["Officers do not receive dishonorable discharges or bad conduct discharges, which are punitive actions only a court martial can administer to enlisted personnel.", "186", ["366", "Comments"]], ["“So like a little kid, he put his hand in the fire, and gets burned.”", "647", ["642", "Comments"]], ["“Thank you for the love you are sending our way.”", "1.3K", ["330", "Comments"]], ["“Yesterday morning, I was experiencing symptoms consistent with longtime allergies. Out of an abundance of caution, I sought medical advice and was tested for COVID-19.”", "324", ["113", "Comments"]], ["“He still won’t wear a mask,” Tlaib tweeted. “He only cares about himself and his life, NOT those around him or the people he took an oath to protect.\"", "586", ["483", "Comments"]], ["The E-6B planes can convey instructions to nuclear-armed submarines, earning the aircraft their ominous nickname and making them a key piece of US defenses in the event of a catastrophe.", "50", ["10", "Comments"]], ["President Trump and first lady Melania Trump have received an outpouring of well-wishes from world leaders after they announced overnight that both had tested positive for COVID-19.", "1.4K", ["267", "Comments"]], ["“We urge everyone who attended yesterday’s event in Bedminster to take full precautions, including self-quarantining and getting tested.”", "118", ["64", "Comments"]], ["President Trump and first lady Melania Trump test positive for the coronavirus, House Speaker Nancy Pelosi rejects the latest coronavirus relief offer from the White House, and more on today's Front Page Podcast. Listen below, or visit http://www.washingtontimes.com/frontpage to read these stories and subscribe for free.", "11", ["11", "Comments"]], ["Pelosi said the country received the news about the president and first lady testing positive for the coronavirus “with great sadness” but hopes it will lead to a “saner” approach to fighting the pandemic.", "190", ["132", "Comments"]], ["Third and final day of Faith and Freedom Coalition's Road to Majority livestream event. Watch for free starting at 9AM EDT! It's time to mobilize and prepare for Election Day energized and excited to make an impact in your community. #RTM2020", "4", ["4", "Comments"]], ["Black Entertainment Television founder Robert Johnson says still doesn’t know Biden’s plan for the economy.", "485", ["136", "Comments"]], ["It’s part of a consolidation move to comply with a new law mandating the end of separate male and female recruit training.", "94", ["17", "Comments"]], ["“I’m waiting so we can do a little political theater. So that it’s on camera.”", "75", ["3", "Comments"]], ["President Trump had a busy schedule during the week the coronavirus hit home with him.", "106", ["157", "Comments"]], ["Trump’s positive test comes just hours after the White House announced that senior aide Hope Hicks came down with the virus after traveling with the president several times this week.", "1.5K", ["1.4K", "Comments"]], ["Mike Pence: “We join millions across America praying for their full and swift recovery.”", "2K", ["402", "Comments"]], ["Dr. Sean Conley, the physician to the president, says the president and first lady Melania Trump “are both well at this time, and they plan to remain at home within the White House during their convalescence.”", "1.1K", ["240", "Comments"]], ["President Donald Trump and first lady Melania Trump have tested positive for the coronavirus, the president tweeted early Friday.", "420", ["322", "Comments"]], ["Some observers are now suggesting that Steve Scully — who will serve as moderator for the next debate on Oct. 15 and is a longtime C-SPAN host — could be biased against the president.", "431", ["314", "Comments"]], ["“I denounce White supremacy. I denounce anti-Semitism. I denounce racism. I denounce fascism. I denounce communism and any other -ism that is prejudiced toward people because of their race, religion, culture, tone of skin.”", "2.9K", ["576", "Comments"]], ["President Trump said Thursday night that he and first lady Melania Trump will begin self-quarantining, after senior White House adviser Hope Hicks tested positive for COVID-19.", "913", ["527", "Comments"]], ["Lin Wood, the attorney for Kyle Rittenhouse, confirmed the lawsuit plans.", "3.8K", ["687", "Comments"]], ["The package passed on a 214-207 basis, with a surge of 18 moderate frontline Democrats defecting from the party.", "357", ["172", "Comments"]], ["Ms. Hicks traveled with the president on Air Force One to and from the presidential debate in Cleveland on Tuesday, and to his campaign rally in Minnesota on Wednesday.", "483", ["500", "Comments"]], ["A two-time Emmy-nominated sports anchor is out of a job after he called Republican Sen. Tim Scott “Uncle Tom.”", "1.3K", ["265", "Comments"]], ["House Speaker Nancy Pelosi said there won’t be a deal announced for a bipartisan coronavirus relief package Thursday evening.", "469", ["303", "Comments"]], ["Subway disagreed with the characterization in a statement. “Subway’s bread is, of course, bread,” the company said.", "56", ["15", "Comments"]], ["Voters want to see immigrants with criminal records deported, want to see rioters and looters arrested and prosecuted, and want to see stiffer border security, according to a new Harvard CAPS-Harris poll.", "1.2K", ["100", "Comments"]], ["“We have received word that Air Force One is not coming to La Crosse on Saturday.”", "514", ["374", "Comments"]], ["“We have to believe in our values, you have to believe that your commander in chief at the end of the day is someone that you can trust. And I can trust Joe Biden.”", "2.3K", ["1.5K", "Comments"]], ["LISTEN: Charlie Hurt tells Andy Parks why the Trump-Biden debate had only losers. #podcast", "3", ["20", "Comments"]], ["“I will go out and say that the Proud Boys as a whole — I will say this on behalf of the entire national organization — denounce White supremacy,” the chief of the Proud Boys Salt Lake Utah Chapter, who only gave the name Thad, told reporters.", "1.5K", ["429", "Comments"]], ["“Why would I allow the Debate Commission to change the rules for the second and third Debates when I easily won last time?”", "3K", ["1.3K", "Comments"]], ["\"One may legitimately question whether it is sound policy to have a group with little diversity of experience, examine, behind closed doors, the sensitive issues facing law enforcement and the criminal justice system in America today.”", "470", ["207", "Comments"]], ["“We need to hold each other accountable as Americans to back off of this fire that we’re playing with.”", "297", ["333", "Comments"]], ["“Never underestimate the ability to take a serious process and make it for prime-time TV and viral moments.”", "90", ["40", "Comments"]], ["The game, originally set for Sunday, will now be played later in the season, the NFL said in a statement. The league did not announce a new date.", "22", ["20", "Comments"]], ["“When routinely available sleep time is difficult to predict, soldiers might take the longest nap possible as frequently as time is available.\"", "45", ["7", "Comments"]], ["President Trump has set a cap of admitting no more than 15,000 refugees in fiscal year 2021, marking the lowest number since the US created its modern refugee system 40 years ago.", "1.3K", ["320", "Comments"]], ["Former FBI Director James Comey stops short of taking personal blame for the bureau's failures during the Trump-Russia probe, embattled White House coronavirus advisor Dr. Scott Atlas isn’t backing down under intense criticism, and more on today's Front Page Podcast. Listen below, or visit http://www.washingtontimes.com/frontpage to read these stories and subscribe for free.", "14", ["1", "Comment"]], ["The bill delays partisan disputes over spending until after the presidential election.", "307", ["75", "Comments"]], ["“I’ve spent a lot of time with Joe Biden when he was vice president. This is not the same man that I used to have breakfast with.”", "518", ["246", "Comments"]], ["Distrust between the commander in chief and Pentagon leadership has reached a near-unprecedented level, with both sides of the Potomac eyeing the other anxiously as Election Day draws near.", "163", ["226", "Comments"]], ["Notre Dame helped launch Judge Amy Coney Barrett’s journey to the federal bench, and the community is going all out to get her confirmed to the Supreme Court.", "1K", ["114", "Comments"]], ["A Democratic state representative from Ohio who is on the outs with her own party endorsed President Trump.", "1.4K", ["138", "Comments"]], ["By the book?:  During four hours of testimony to the Senate Judiciary Committee, Comey repeatedly said he wasn’t aware of much of what was going on beneath him.", "345", ["192", "Comments"]], ["“He ducked the question. In an election when you duck the question, you know what the answer is. That is exactly what they are up to.\"", "825", ["181", "Comments"]], ["A religious organization tied to Amy Coney Barrett sought to erase all mentions and photos of her from its website before she meets with lawmakers.", "135", ["116", "Comments"]], ["“I did what the corrupt media has refused to do — I held Joe Biden accountable for his 47 years of failure,” the president told thousands of supporters at a rally in Duluth, Minnesota.", "3.1K", ["1.7K", "Comments"]], ["California Gov. Gavin Newsom signed Wednesday a first-in-the-nation bill requiring every corporate board to include at least one director from an “underrepresented community.”", "703", ["343", "Comments"]], ["If Donald Trump is going to get a Nobel Peace Prize nomination, then left-wing lawmakers will ensure that Joe Biden, a man who holds no public office, will get one too.", "1.1K", ["364", "Comments"]], ["“I regret that I will cause consternation, perhaps, in some corners.”", "892", ["439", "Comments"]], ["“I’m a pro. I’ve never been through anything like this.”", "1.3K", ["921", "Comments"]], ["It turns out not everybody believes the Proud Boys are white supremacists, including a prominent Black professor at a historically Black university.", "1.3K", ["618", "Comments"]], ["President Trump’s remark telling the far-right Proud Boys group to “stand by” took on a life of its own Wednesday.", "598", ["842", "Comments"]], ["“We know who dies from this virus. It’s not equally impactful on different parts of society,” President Trump’s embattled coronavirus adviser, Dr. Scott Atlas, told The Washington Times.", "937", ["78", "Comments"]], ["Joe Biden flatly denied Tuesday that his son took huge sums of money from corrupt oligarchs and Chinese communists, but Treasury Department reports show that Hunter Biden did receive the money.", "3.8K", ["1.3K", "Comments"]], ["Liberal actor/activist Alec Baldwin was ready for violence as President Trump squared off against Joe Biden for the first time.", "533", ["291", "Comments"]], ["Investigators have arrested and charged a man in connection with the shooting of two Los Angeles County sheriff’s deputies earlier this month as they sat in their squad car.", "211", ["27", "Comments"]], ["The latest Campaign 2020 Podcast sorts through the crosstalk in Cleveland and breaks down what President Trump and Democratic presidential nominee Joe Biden actually said on the economy, COVID-19, climate change, and more. Listen below, and visit http://www.washingtontimes.com/elections for all of our #Campaign2020 coverage. You can also listen on Amazon Alexa connected devices - just say \"Alexa, play the Campaign 2020 Podcast.\"", "1", ["2", "Comments"]], ["Collins told FBI Director Christopher Wray he has proven to “unwilling or unable to bring accountability to the upper echelon of the FBI” and should accordingly “do the right thing for this country and resign.”", "1.1K", ["167", "Comments"]], ["The teenager’s attorney, Atlanta-based Lin Wood, says footage — much of which went viral on social media the night it happened — demonstrates clear acts of self-defense.", "744", ["371", "Comments"]], ["“I don’t think this plan was particularly well thought out and I worry about a number of aspects of its implementation.”", "43", ["14", "Comments"]], ["“Last night’s debate made clear that additional structure should be added to the format of the remaining debates to ensure a more orderly discussion of the issues.”", "667", ["584", "Comments"]], ["“There is no indication — and the inspector general would say it if he found it — that people were doing bad things on purpose, but that doesn’t make it any less concerning or embarrassing.”", "151", ["57", "Comments"]], ["“If he doesn’t correct it, I guess he didn’t misspeak.”", "762", ["995", "Comments"]], ["Biden said Trump gave a “dog whistle to white supremacy” when the president told the Proud Boys, a white nationalist group, to “stand back and stand by.”", "496", ["479", "Comments"]], ["“I do believe the American people benefited from a clear contrast from what they’ve got right now, but also what they can get.”", "117", ["22", "Comments"]], ["The president tweeted on Wednesday, “Nobody wants Sleepy Joe as a leader, including the Radical Left (which he lost last night!). He disrespected Bernie, effectively calling him a loser!”", "1K", ["618", "Comments"]], ["Comey, whom Trump had fired in 2017, unloaded on his former boss to the Senate Judiciary Committee, saying the president hasn’t been vocal enough in criticizing Russia, and there’s no good reason other than that Moscow is effectively blackmailing him.", "860", ["462", "Comments"]], ["A recap of a contentious first presidential debate in Cleveland, Supreme Court nominee Amy Coney Barrett meets with senators on Capitol Hill, and more on today's Front Page Podcast. Listen below, or visit http://www.washingtontimes.com/frontpage to read these stories and subscribe for free.", "3", ["13", "Comments"]], ["The former vice president shared the video on social media and said: “Had enough?”", "525", ["495", "Comments"]], ["A combative President Trump and an exasperated Democratic nominee Joe Biden attacked each other constantly in Tuesday night’s first presidential debate, disagreeing bitterly on everything from crime to health care from start to finish in their high-stakes confrontation.", "302", ["304", "Comments"]], ["Conservatives yearn for a Supreme Court ruling against the affordable care act next year that President Trump says will clear the way for a “far better” replacement. But the reality is messy. A stalemate or a push for narrow fixes is far more likely.", "111", ["56", "Comments"]], ["Supreme Court nominee Judge Amy Coney Barrett, who had her first sit-downs with senators Tuesday, has impressed congressional Republicans by redefining feminism, they said.", "1K", ["254", "Comments"]], ["There’s a word to describe Americans who believe in the colorblind society and that all people should be treated equally regardless of their skin color: racist.", "156", ["42", "Comments"]], ["From Washington Times Opinion: \"Mr. Trump has all the winning issues. Even his handling of the Chinese Plague is a winner for him, if he can just find his voice on it,\" writes Charles Hurt.", "306", ["367", "Comments"]], ["President Trump said that he wants his supporters to patrol polling locations on Election Day to make sure there’s no funny business going on.", "2.1K", ["605", "Comments"]], ["David Axelrod said on CNN that Trump came in too hot against former VP Biden.", "1.1K", ["591", "Comments"]], ["President Trump drew heavy criticism on social media Tuesday night when he told the white nationalist group Proud Boys to “stand back and stand by.\"", "1K", ["1.7K", "Comments"]], ["Chaos reigned. America got a binge session of politicians gone wild.", "105", ["111", "Comments"]], ["President Trump suggested Tuesday the Supreme Court may have to review the results of the presidential election if there are disputes over mail-in ballots in November.", "363", ["193", "Comments"]], ["Helen Reddy, who shot to stardom in the 1970s with her feminist anthem “I Am Woman” and recorded a string of other hits, had died. She was 78.", "240", ["40", "Comments"]], ["President Trump took a swipe during Tuesday’s debate at former Vice President Biden’s penchant for telling tall tales, blasting Biden’s debunked stories about his law-school record and attending a historically Black college.", "741", ["202", "Comments"]], ["“None of that is true,” Biden said, shaking his head.", "1.2K", ["584", "Comments"]], ["Joe Biden told President Trump he’s the worst president in US history at the first presidential debate in Cleveland on Tuesday.", "2.6K", ["2.1K", "Comments"]], ["President Trump turned on moderator Chris Wallace early in the debate Tuesday.", "3.8K", ["1.9K", "Comments"]], ["“I’m not elected for three years. I’m elected for four years,” Trump said.", "2.7K", ["719", "Comments"]], ["A group of four Australian law professors has reportedly nominated President Trump for the Nobel Peace Prize, marking his third nomination for the prestigious award ahead of the November election.", "463", ["59", "Comments"]], ["Biden mocked the idea that he’s preparing to climb onto the debate stage with a hidden earpiece, and jacked up on performance-enhancing drugs.", "128", ["76", "Comments"]], ["Financial experts say the notion of Trump going broke anytime soon is farfetched.", "640", ["247", "Comments"]], ["The Philadelphia chapter of the International Association of Fire Fighters broke with the IAFF on Tuesday to back President Trump for reelection over his Democratic rival Joe Biden.", "1.8K", ["123", "Comments"]], ["A federal judge left President Trump’s first national security adviser Michael Flynn in legal limbo Tuesday as the clock ticks down to a possible Biden administration that would undoubtedly continue the prosecution.", "411", ["124", "Comments"]], ["Rush Limbaugh says fans of self-proclaimed “centrist” Dwayne Johnson should follow the money if they want to know why he broke years of precedent and endorsed Democrat Joe Biden’s campaign.", "410", ["212", "Comments"]], ["Why President Trump appeals to them is heatedly debated, with explanations ranging from economics to race to the president’s blunt style of rhetoric.", "493", ["553", "Comments"]], ["Democratic presidential nominee Joe Biden predicted in 1991 that he would be “dead and gone” by 2020.", "332", ["142", "Comments"]], ["“The elite class is already treating Americans of faith like exotic animals on display.”", "624", ["54", "Comments"]], ["The photos showed Feinstein walking through a private airport terminal at Dulles, where her husband’s private jet, a Gulfstream, departed for San Francisco Friday afternoon.", "835", ["347", "Comments"]], ["“If we see multiple cases of challenging the election, if the court were to have only eight justices… a 4-4 court can’t decide anything.”", "192", ["91", "Comments"]], ["“Whether these allegations are accurate is not the question. The question is did the FBI investigate the allegations against Clinton like they did Trump? If not, why not?\"", "752", ["176", "Comments"]], ["“On top of the refusal to take a drug test, it seems pretty obvious that the Biden team is looking for any safety net they can find in the hours leading up to the debate.”", "2.1K", ["1.3K", "Comments"]], ["\"It is essential that we work together to keep children safe online and out of the vicious cycle of trafficking and abuse.”", "856", ["287", "Comments"]], ["The Bidens reported $944,737 in taxable income last year, $346,204 in total payments and a $46,858 refund.", "1.5K", ["1.4K", "Comments"]], ["“It’s not a partisan issue. It’s been abused to help both R & D candidates, including in North Carolina & California.”", "894", ["103", "Comments"]], ["In a statement, the NFL said the Vikings and the Titans are working with the league and the players’ union, as well as with infectious disease experts, on how to proceed.", "40", ["44", "Comments"]], ["The bill is expected to get a vote sometime this week, though no date has been officially set yet. This package is unlikely to gain any traction in the GOP controlled Senate.", "28", ["16", "Comments"]], ["“The FBI’s decisions, likely in consultation with DOJ leadership, violate Mr. McCabe’s rights to be properly prepared to testify under oath.\"", "197", ["36", "Comments"]], ["“The MPD is aware of the allegations of vote harvesting. We are in the process of looking into the validity of those statements.\"", "669", ["295", "Comments"]], ["A preview of what to expect at the first presidential debate in Cleveland, 150 million rapid coronavirus tests are on their way to states and other facilities as part of a White House deal with Abbott Laboratories, and more on today's Front Page Podcast. Listen below, or visit http://www.washingtontimes.com/frontpage to read these stories and subscribe for free.", "2", ["1", "Comment"]], ["Asked if the Supreme Court should be expanded if Judge Amy Coney Barrett is confirmed, Harris said her presidential running mate Joe Biden has been clear about the fact that people are voting right now.", "237", ["120", "Comments"]], ["One of Eastern Europe’s longest frozen conflicts has exploded into a hot war in recent days, with clashes between Armenia and Azerbaijan over the disputed enclave of Nagorno-Karabakh killing dozens of people and threatening to drag nearby Turkey and Russia into a direct military confrontation.", "85", ["60", "Comments"]], ["Cleveland is still recovering from a protest-turned-riot on May 30 that resulted in $6.3 million in damages. Businesses are still boarded up, neighborhoods are jittery. The Ohio city fears a repeat.", "64", ["81", "Comments"]], ["“It gives a unique, Secretary’s-level view” of the Pentagon and how it makes decisions.", "16", ["1", "Comment"]], ["“We will not give up and we will not give in.\"", "2K", ["1.1K", "Comments"]], ["What would you ask Joe Biden?", "106", ["218", "Comments"]], ["A possible ‘hostage situation’ led to a shooting involving police in Salem, The Marion County Sheriff’s Office said.", "106", ["21", "Comments"]], ["It’s the latest lawsuit by the Trump team, and it follows warnings from President Trump that a rush to make voting easier amid the coronavirus pandemic has created opportunities for massive fraud.", "1.3K", ["920", "Comments"]], ["Add Cream of Wheat to the list of brands that are getting a makeover due to “offensive” advertising.", "170", ["67", "Comments"]], ["Joe Biden is going on offense ahead of the first presidential debate to expand the electoral map.", "575", ["227", "Comments"]], ["Wheeler said it “begs the question of how you expect to run an electric car fleet that will come with significant increases in electricity demand, when you can’t even keep the lights on today.”", "1.6K", ["319", "Comments"]], ["The appeals court found it is unlawful to segregate a boy from his peers just because he is transgender.", "300", ["133", "Comments"]], ["The Democratic Party’s identity politics has paid off with the new generation of Asian voters.", "224", ["109", "Comments"]], ["Texas’ largest county has been approving voter registrations even when people say they’re not citizens, according to a lawsuit announced Monday that found some of those people managed to cast ballots, too.", "565", ["64", "Comments"]], ["More than 1,500 graduates of Judge Amy Coney Barrett's alma mater posted a letter Monday opposing her Supreme Court nomination, citing her \"anti-choice\" and \"hate group\" associations.", "17K", ["3K", "Comments"]], ["Brad Parscale has been hospitalized involuntarily since the incident Sunday afternoon.", "148", ["205", "Comments"]], ["Biden is expected to walk into a buzzsaw Tuesday when he climbs on stage for the first time to debate President Trump.", "861", ["723", "Comments"]], ["Jill Biden waved off a question by CNN’s Jake Tapper after he claimed her husband has a history of making “the occasional gaffe.”", "728", ["387", "Comments"]], ["Rep. John Becker, a Republican, says Gov. Mike DeWine has exceeded his authority under state law and the Ohio and U.S. constitutions.", "438", ["95", "Comments"]], ["Trump called the shipments a “massive and groundbreaking expansion” of the nation’s testing.", "297", ["125", "Comments"]], ["The committee’s hearings are scheduled to begin on Oct. 12, but several Democrats have already indicated that they oppose Judge Barrett and will not consider her nomination.", "448", ["95", "Comments"]], ["“I don’t understand how that works. Why are we having to pay, because I work every day like a whole bunch of people. Why is it all on us to do this? Where is he? How dare you! How dare you!”", "1.3K", ["895", "Comments"]], ["“Hope that the U.S. Attorney in Minnesota has this, and other of her many misdeeds, under serious review??? If not, why not???\"", "2.4K", ["829", "Comments"]], ["“In short, the COVID lockdown is a trial run for the climate lockdown.”", "275", ["74", "Comments"]], ["“I disagree with Hillary Clinton,” the Illinois Democrat told ABC’s George Stephanopoulos. “I respect her, I like her, but I think she’s just flat-out wrong.”", "330", ["65", "Comments"]], ["His lawyers aim to use the new evidence, revealed in unsealed court documents, to change the narrative of the Flynn case back to allegations of FBI wrongdoing.", "727", ["210", "Comments"]], ["“Judge Ginsburg had a dying wish that the next president choose... I will strongly, strongly, strongly oppose this nomination.”", "2.1K", ["1.4K", "Comments"]], ["“Trump is, you know — Trump is clearing protests in front of the White House that are peaceful, you know, with the military. This guy is more Castro than Churchill.\"", "303", ["141", "Comments"]], ["“With so much at stake, we cannot afford to fall into the traps of promoting medical disinformation.”", "218", ["88", "Comments"]], ["A preview of the upcoming Senate confirmation fight over Supreme Court nominee Amy Coney Barrett, sales of guns surged in August, and more on today's Front Page Podcast. Listen below, or visit http://www.washingtontimes.com/frontpage to read these stories and subscribe for free.", "11", ["5", "Comments"]], ["Saudi Arabia, which currently serves as G-20 president, said that the virtual summit will still be held on Nov. 21 and 22 and will have the theme of “Realizing Opportunities of the 21st Century for All.”", "56", ["9", "Comments"]], ["“He does things in certain years where you get depreciation, where you get [a] write-off, where you get historical tax credits like we did when we took on the risk of building the Old Post Office in D.C.”", "1.2K", ["1.1K", "Comments"]], ["Tactics formerly reserved for only the nastiest of political campaigns have in recent years bled over into battles for the judiciary, breaking down one of the last walls of decency in a town not known for it.", "109", ["59", "Comments"]], ["The number of people filing first-time claims for unemployment benefits is hovering around 860,000 per week, a big improvement from March and April but still far higher than the recession of 2008-2009.", "45", ["21", "Comments"]], ["“It’s almost a scale of desperation you see on these people’s faces. You can’t help them. You can’t supply them with something,” Mr. Hawk said.", "856", ["260", "Comments"]], ["“It might be very unlikely that I end up as a president. But the question has to be ‘where do we want to be in 2030?’”", "40", ["3", "Comments"]], ["Authorities said Edwards, 29, was requesting the money to shoot officers who were in the street in front of his residence during a disturbance.", "279", ["40", "Comments"]], ["A truck ran into a Utah congressional candidate’s campaign headquarters, damaging the building and destroying the majority of the campaign materials stored inside.", "650", ["130", "Comments"]], ["The majority of voters want the late Supreme Court Justice Ruth Bader Ginsburg’s vacant seat to be filled by whoever wins the November election, according to a new poll.", "1.7K", ["1.6K", "Comments"]], ["The Cook County medical examiner’s office said the girl, Serenity Arrington, was taken to a hospital where she was pronounced dead.", "393", ["63", "Comments"]], ["A former campaign manager for President Trump was taken into custody Sunday after barricading himself in his home and threatening to commit suicide.", "439", ["272", "Comments"]], ["“We can slow it down, perhaps a matter of hours, maybe days at the most, but we can’t stop the outcome.\"", "436", ["143", "Comments"]], ["The FBI’s most infamous epoch, a stretch of six months in 2016 and 2017 when Obama administration officials targeted Donald Trump and his allies, is coming into its own scandalous light in a steady flow of self-incriminating documents meant to stay secret.", "793", ["214", "Comments"]], ["“If you look at some of those debates, I said there’s no way he can continue…then all of a sudden he debated Crazy Bernie Sanders and you know the truth is, he was okay.”", "453", ["147", "Comments"]], ["President Trump said Sunday he feels like he’s gotten rid of Obamacare because the individual mandate penalty for shirking insurance was zeroed out.", "878", ["289", "Comments"]], ["“The story is a total fake,” Trump said. “It will be revealed. When you are under audit, you just don’t release them.”", "1.2K", ["1.2K", "Comments"]], ["At a press conference at the White House, Trump singled out The New York Times and referred to \"nasty\" comedians.", "731", ["304", "Comments"]], ["Sen. Lindsey Graham said Sunday that the Senate Judiciary Committee will approve Judge Amy Coney Barrett’s nomination to the Supreme Court by Oct. 22.", "1K", ["266", "Comments"]], ["Two weeks shy of a year after abruptly quitting Fox News with a declaration that “truth will always matter,” Shepard Smith returns to television this week.", "403", ["145", "Comments"]], ["Amy Coney Barrett adopted two of her seven children from Haiti, but she could still be racist, according to a leading “antiracism” expert.", "1.5K", ["698", "Comments"]], ["The size of the court was last changed legally in 1869, from seven to nine.", "852", ["93", "Comments"]], ["Berthel, who is up for reelection, said in a statement given to local media that he was unaware of the more “extreme” aspects of QAnon when he placed the sticker on his car’s rear windshield.", "49", ["64", "Comments"]], ["“We can slow it down, perhaps a matter of hours, maybe days at the most, but we can’t stop the outcome. What we should do is to address this now respectfully.”", "713", ["214", "Comments"]], ["The secretary of state said that leaders in Beijing need to recognize the Trump administration’s seriousness and Trump’s commitment in pushing back against Chinese expansionism.", "477", ["46", "Comments"]], ["“I tell you this: If they overturn the preexisting condition benefit, which they have been trying to do … they will be seeing elections that look exactly like 2018 over and over again.”", "1.7K", ["1.1K", "Comments"]], ["\"The pictures are of old empty envelopes from the November 2018 election that were disposed of as allowed by law.”", "61", ["29", "Comments"]], ["The president has been pushing allegations that the former vice president has been taking drugs to boost his performance, despite there being no evidence to support that.", "2K", ["1.3K", "Comments"]], ["“President Trump has once again put Americans’ healthcare in the crosshairs.”", "823", ["401", "Comments"]], ["It could up the consequences for rioters on a day when both far-right and left-wing activists have planned gatherings in the Oregon city.", "614", ["139", "Comments"]], ["\"This is not a recent phenomenon. This is who he is.”", "322", ["163", "Comments"]], ["The nomination of Judge Barrett is Trump’s third Supreme Court appointee — the most of any president since Ronald Reagan — and potentially tilts the high court’s balance dramatically in favor of conservatives for years to come.", "1.1K", ["631", "Comments"]], ["Biden said the Supreme Court has upheld Obamacare twice and said that it is unconscionable for the Trump administration and the GOP to try to gut the law amid a global pandemic.", "722", ["472", "Comments"]], ["The schedule would set the judge’s confirmation vote before the full U.S. Senate to take place by the end of the month — before the Nov. 3rd Election Day.", "1K", ["271", "Comments"]], ["According to several videos circulating on social media, Apple’s virtual assistant Siri would produce a list of directions to local law enforcement when asked to locate terrorists.", "203", ["27", "Comments"]], ["“The Simpsons” confirmed it recast the role of Carl Carlson, a Black character voiced for decades by a White actor, for the season premiere of the long-running animated sitcom airing on Fox this Sunday.", "201", ["127", "Comments"]], ["“She critiqued Chief Justice John Roberts’ majority opinion upholding the law in 2012.”", "1.8K", ["979", "Comments"]], ["Challenges have been filed in courts across the country and Trump has lost in most of them, though the Supreme Court has ruled construction can continue while the cases make their way through the process.", "332", ["138", "Comments"]], ["Police there say they received several inquiries after an email surfaced this week showing the major disparaging Antifa and Black Lives Matters activists. She has accepted responsibility and will retire.", "393", ["281", "Comments"]], ["Trump was making an appeal to Black voters when he mentioned the BLM movement. The room erupted in boos.", "888", ["188", "Comments"]], ["President Donald Trump nominated Judge Amy Coney Barrett to the Supreme Court on Saturday, capping a dramatic reshaping of the federal judiciary that will resonate for a generation and that he hopes will provide a needed boost to his reelection effort.", "4.3K", ["729", "Comments"]], ["The blowback on the right was immediate. “Disgusting,” tweeted Sen. Tom Cotton, Arkansas Republican. “The left now smearing Amy Coney Barrett for adopting children.” . . . Sen. Josh Hawley, Missouri Republican, called it “the Dem gameplan. Nothing but raw bigotry and hate. I promise you, this will not stand.”", "509", ["152", "Comments"]], ["“We call upon all senators and elected officials to reject applying religious tests for public office.”", "194", ["42", "Comments"]], ["Google notified advertisers it will be implementing its sensitive event policy after polls close to restrict a range of political ads referencing candidates and issues up for consideration this Election Day.", "54", ["24", "Comments"]], ["The former vice president has scored surprisingly well in surveys of U.S. troops and picked up the endorsement Thursday of nearly 500 national security figures, including 22 four-star retired officers.", "684", ["340", "Comments"]], ["In canceling the Obama administration’s Trans-Pacific Partnership and later rewriting the North American Free Trade Agreement, Trump has drafted a new script for negotiating trade deals.", "770", ["238", "Comments"]], ["“Where all the partners have really worked together quickly, all on the same page, all with the same mission, all aligned, it’s usually been nipped in the bud.”", "469", ["133", "Comments"]], ["They want the Justice Department to crack down on police departments with investigations known as pattern-and-practice probes, which were a hallmark of the Obama administration’s efforts to change police culture.", "111", ["69", "Comments"]], ["Late-breakers were key to President Trump’s upset victory in 2016, according to analysts. This year there are fewer of them but they could still swing close races in battleground states. Our own Seth McLaughlin talked to a few who shared why they're still on the fence. https://www.washingtontimes.com/…/undecided-voters-still-g…/", "58", ["107", "Comments"]], ["“It is not a protest or political event, and we are asking participants to not bring signs in support of any candidate or party.”", "467", ["71", "Comments"]], ["Respondents who voiced support for shutting down social media services during the span include 54% of Democrats and 51% of Republicans surveyed.", "127", ["82", "Comments"]], ["President Trump leaned hard into Second Amendment rhetoric during a rally in Virginia late Friday, arguing Joseph R. Biden will wage the most aggressive war on gun rights in U.S. history.", "1.1K", ["390", "Comments"]], ["NBA legends Charles Barkley and Shaquille O’Neal agree that details matter in the Breonna Taylor case and that her death shouldn’t be “lumped in” with other high-profile deaths of Black people like George Floyd.", "393", ["82", "Comments"]], ["Kentucky state Rep. Attica Scott was arrested and charged with felony rioting Thursday during a second night of violent protests sparked by the grand jury decision in the Breonna Taylor case.", "1.9K", ["598", "Comments"]], ["A bipartisan effort from Reps. Collin Peterson and Denver Riggleman seeks to codify the nine-seat Supreme Court panel of justices, and undermine attempts to expand the high court.", "396", ["48", "Comments"]], ["Women’s March co-founder Tamika Mallory on Friday smeared Kentucky Attorney General Daniel Cameron as no different than “the sellout negroes” who sold their ancestors into slavery.", "645", ["345", "Comments"]], ["“This is a political war, and people need to wake up.”", "1.9K", ["1.1K", "Comments"]], ["If convicted of one of the most serious charges he faces, Kyle Rittenhouse would be sentenced to life in prison.", "1.2K", ["1.3K", "Comments"]], ["Joseph R. Biden declared last year on the campaign trail that he began his academic career at Delaware State University, a historically Black college, a claim that the school refutes.", "2.2K", ["778", "Comments"]], ["President Trump urged Republican lawmakers on Friday to investigate bombshell disclosures that the FBI relied on a suspected Russian spy to justify secret surveillance of his 2016 campaign.", "1.1K", ["397", "Comments"]], ["A federal judge ruled Friday that the Trump administration’s leading steward of public lands has been serving unlawfully and has blocked him from continuing in the position.", "316", ["139", "Comments"]], ["President Trump signed an executive order Friday night to ensure that every infant born alive, including extremely premature or disabled babies, receives medical care.", "2.8K", ["1.1K", "Comments"]], ["A New Hampshire man who discovered his wife was having an affair kidnapped and killed the other man and forced his wife to decapitate him, police say.", "339", ["130", "Comments"]], ["Footage of the incident was captured by a news helicopter and included activists beating on the car’s window with a Black Lives Matter flag, a skateboard and a bicycle.", "487", ["271", "Comments"]], ["President Trump is expected to replace Justice Ruth Bader Ginsburg Saturday night with Judge Amy Coney Barrett.", "2.3K", ["732", "Comments"]], ["President Trump proposed a second-term agenda for Black America on Friday that would designate the KKK and Antifa as terrorist organizations, make lynching a national hate crime and boost investment in Black communities by nearly $500 billion.", "2.2K", ["1.3K", "Comments"]], ["Federal authorities have arrested two men on terror charges for allegedly plotting to bomb or shoot up sites including the White House and Trump Tower in New York City.", "397", ["124", "Comments"]], ["“It’s like going into a match, same kind of thing — a little bit less physical.”", "369", ["170", "Comments"]], ["President Trump touted the cards as part of a broad speech on health reform in North Carolina on Thursday, prompting fears he is using taxpayer money to appeal to seniors — a key voting bloc — in the run-up to Nov. 3rd.", "131", ["290", "Comments"]], ["Former Republican Rep. Ron Paul was hospitalized Friday after appearing to suffer a medical emergency during a livestream interview on his Liberty Report.", "80", ["20", "Comments"]], ["A pre-planned gathering of thousands of Christians on the National Mall could run headlong into angry protesters opposing President Trump’s Supreme Court appointment on Saturday night.", "205", ["127", "Comments"]], ["William J. Barnett said the evidence in the Russian collusion probe was so flimsy that he and others mocked it by turning it into a game they dubbed “Collusion Clue.”", "846", ["411", "Comments"]], ["Organizers say they are going to try again on Saturday at the same time.", "32", ["10", "Comments"]], ["“The reason they were perched for this, within just a couple of hours after the announcement of her passing … was so inappropriate.”", "339", ["177", "Comments"]], ["Northam and his wife plan to isolate for the next 10 days while working remotely.", "257", ["141", "Comments"]], ["There have been 34 men given the honor of lying in state, since the first bestowed on Henry Clay in 1852. Rosa Parks, the civil rights icon, laid in “honor” inside the Rotunda, but Justice Ginsburg is the first woman to lie in state.", "110", ["49", "Comments"]], ["In a statement, Putin proposed “exchanging guarantees of non-interference in each other’s internal affairs and electoral processes, including using information and communication technologies and high-tech methods.”", "421", ["137", "Comments"]], ["House Democrats propose more federal investigations of police departments, where the presidential candidates stand on trade, and more on today's Front Page Podcast. Listen below, or visit http://www.washingtontimes.com/frontpage to read these stories and subscribe for free.", "9", ["4", "Comments"]], ["“It’s the official policy of President Trump to make sure that any legislation, whether it’s new legislation moving forward, whether it’s executive orders or whatever else, that preexisting [conditions] will always be protected.”", "1K", ["369", "Comments"]], ["The FBI has not detected any evidence of a widespread fraud conspiracy in this year’s elections, including in ballot-by-mail states, but is vigilant to the possibility, bureau Director Christopher A. Wray said.", "543", ["401", "Comments"]], ["“George Soros is certainly one of the most influential powerful men on the planet — an absolute pillar of the left in all things nonprofit and political. However, people need to understand that the left has multiple Soroses.”", "353", ["252", "Comments"]], ["The package is expected to include new funds for the small business Paycheck Protection Program and another round of direct payments.", "279", ["179", "Comments"]], ["Police said in a news release that “Biden 2020,” “BLM” and an anarchy symbol had been written with fresh spray paint on the garage door.", "675", ["312", "Comments"]], ["Pelosi chided reporters for not being more focused on Mr. Trump’s comments about conceding the election in a hypothetical scenario.", "408", ["250", "Comments"]], ["She said the rally should be canceled, rescheduled or scaled down to comply with the governor’s order.", "818", ["459", "Comments"]], ["“I will not put my hands behind my back, I’m not doing nothing wrong!” she screams in the video.", "1.1K", ["1.1K", "Comments"]], ["Financier Richard Blum, husband of Sen. Dianne Feinstein, said “no one ever told me it was wrong.”", "1K", ["235", "Comments"]], ["An FBI analyst working on the bureau’s 2016 investigation into Michael Flynn expressed concerns about the case’s validity, saying agents involved “want a Clinton presidency,” according to court documents unsealed late Thursday.", "404", ["104", "Comments"]], ["Democrats plan to introduce a bill next week that would abolish life tenure for Supreme Court justices.", "1.2K", ["546", "Comments"]], ["President Trump exulted Thursday night in new bombshell disclosures of FBI malfeasance into the spying on his campaign in 2016, calling it “a big day” for him in the long-discredited Russian collusion investigation.", "963", ["201", "Comments"]], ["When Sen. Kamala Harris went toe-to-toe with Justice Brett Kavanaugh at his confirmation hearing, things didn’t quite work out as planned.", "287", ["180", "Comments"]], ["Archbishop Carlo Maria Viganò said the 2020 presidential election presents Americans with a “biblical” challenge “against the demonic forces of the deep state and against the New World Order.”", "2K", ["758", "Comments"]], ["The Senate Republican report on Hunter Biden shows he amassed a network of shady foreign clients who pumped millions into his bank accounts — all while his dad served as vice president.", "950", ["645", "Comments"]], ["The focus of the presidential race has shifted significantly following the death of Supreme Court Justice Ruth Bader Ginsburg. George Gerbo lays out the state of play on who's in President Trump's contention for the vacancy and how it affects the campaign on the latest Campaign 2020 Podcast. Listen below, and visit http://www.washingtontimes.com/elections for all of our Campaign 2020 coverage.", "8", ["3", "Comments"]], ["“Kyle Rittenhouse will go down in American history alongside that brave unknown patriot … who fired ‘The Shot Heard Round the World,”’ lead attorney John Pierce wrote. “A Second American Revolution against Tyranny has begun.”", "2.9K", ["1.5K", "Comments"]], ["The Justice Department and FBI are investigating potential mail-in ballot irregularities in Pennsylvania, a crucial swing state for the 2020 presidential election.", "1.4K", ["661", "Comments"]], ["The decision siding with Fox on Thursday called it “the kind of pitched commentary that one expects when tuning in to talk shows like Tucker Carlson Tonight.”", "575", ["14", "Comments"]], ["“The president will accept the results of a free and fair election,” said White House press secretary Kayleigh McEnany.", "424", ["266", "Comments"]], ["“We’ve hit — they say — an ominous number, ladies and gentlemen. Two hundred thousand people have died from the coronavirus. That is the biggest lie this century,” Levin told his listeners.", "1.1K", ["406", "Comments"]], ["Shocking video on social media shows an officer on a bicycle falling to the ground as black-clad protesters cheer.", "403", ["182", "Comments"]], ["“I never thought that a protest in support of minority rights would flip and do harm to local, minority-owned businesses. Unfortunately, that is exactly what happened to me as well as many other small shops in downtown Columbus.”", "553", ["205", "Comments"]], ["Ken Cuccinelli, the No. 2 person at Homeland Security, said he immediately dispatched a team to look into the shocking allegation and did not see evidence of rampant procedures.", "119", ["48", "Comments"]], ["“We need to be able to bring them down and have the money, the appropriations, to purchase the equipment to allow us to do that.”", "95", ["23", "Comments"]], ["“The gravest threat to American democracy right now is Donald Trump,” Schumer said in a speech on the Senate floor. “This is not a partisan issue. Democracy is at stake.”", "2.9K", ["2.1K", "Comments"]], ["“Peaceful protests honor the memory of Breonna Taylor. Peaceful protests move us toward justice — smashing windows does not.”", "636", ["135", "Comments"]], ["“I’m being out-spent 4-to-1, out-raised 5-to-1. I need some help.”", "197", ["140", "Comments"]], ["Within minutes of their arrival, some people gathered along barricades at the high court made a commotion, booting and jeering.", "2.3K", ["2.2K", "Comments"]], ["President Trump announces new tourism sanctions on Cuba, Joe Biden is taking an unconventional campaign approach in hoping President Trump manufactures his own defeat, and more on today's Front Page Podcast. Listen below, or visit http://www.washingtontimes.com/frontpage to read these stories and subscribe for free.", "12", ["5", "Comments"]], ["Forty-two percent of Americans said the court’s 5-4 conservative majority was “about right,” while 32% said it was “too conservative” and 23% thought it was “too liberal.”", "60", ["53", "Comments"]], ["Biden is giving President Trump a run for his money when it comes to being “Mr. Unconventional” in the 2020 presidential race.", "379", ["223", "Comments"]], ["[TODAY] Join CollaborateUp and PMI for a virtual roundtable discussing Reinventing the People & Places Left Behind by Globalization at 12PM EDT. Click to register now.", "5", ["1", "Comment"]], ["Amish voters appear motivated. In the past week, there were multiple horse, buggy and wagon parades in Pennsylvania and Ohio.", "436", ["32", "Comments"]], ["Americans should be prepared for bad actors to exploit the extra time needed to determine the results of the presidential election this November, the FBI and Department of Homeland Security warned.", "169", ["97", "Comments"]], ["Trump is pushing hard to increase his support among Hispanic voters, including Cuban Americans, about two-thirds of whom live in Florida.", "537", ["90", "Comments"]], ["The Department of Education and a group of Connecticut school districts have reached a last-minute compromise over an athletics policy that allows transgender girls to compete against cisgender women and girls.", "89", ["35", "Comments"]], ["California Gov. Gavin Newsom sought Wednesday to fight the state’s disastrous wildfires by phasing out gas-powered cars.", "826", ["384", "Comments"]], ["Asked whether he will support a “peaceful transfer of power” after the election, the president replied, “Get rid of the [mail-in] ballots, and you’ll have a very peaceful transfer. There won’t be a transfer.\"", "921", ["531", "Comments"]], ["Portland officials said the Proud Boys’ estimated crowd size of 10,000 people was too big under coronavirus safety measures.", "612", ["138", "Comments"]], ["BREAKING: At least two police officers have been shot in disturbances in Louisville, Kentucky, in the wake of Wednesday’s indictments in the Breonna Taylor death.", "843", ["503", "Comments"]], ["A 77-year-old military veteran in California is recovering from his wounds after he said he was beaten by two people because of his “Make America Great Again” hat.", "625", ["174", "Comments"]], ["“This is not a recent phenomenon. This is who he is.”", "256", ["192", "Comments"]], ["House Minority Leader Kevin McCarthy vowed Wednesday to retaliate if Democrats try to push an impeachment in order to delay a Supreme Court nomination, saying he would attempt to oust Speaker Nancy Pelosi.", "1.5K", ["257", "Comments"]], ["Anti-Trump forces expecting another insider’s tale on how awful the president is will be disappointed by retired Army Lt. Gen. H.R. McMaster.", "356", ["36", "Comments"]], ["Florida’s attorney general asked state and federal law enforcement on Wednesday to investigate possible election law violations by billionaire and former presidential candidate Mike Bloomberg.", "2.5K", ["856", "Comments"]], ["“Everyone should see this report for what it is: an election year hit job that uses as its very basis Russian disinformation.\"", "794", ["369", "Comments"]], ["“There are a lot of really fine women that I had to choose from, but I think she’s ready on day one.”", "581", ["214", "Comments"]], ["President Trump announced Wednesday that he will sign an executive order to ensure that all babies born alive receive medical care, including those that survive abortions or are born prematurely.", "2.1K", ["486", "Comments"]], ["“The publication of a memoir by a former National Security Adviser, right after his departure, is an unprecedented action, and it is not surprising that National Security Council staff would pay close attention to ensure that the book does not contain the release of classified information.”", "61", ["5", "Comments"]], ["“I was so shocked for the hate that people have, you know?” he added. “I don’t hate them. I never met them. I just can’t believe they would do something like that.”", "716", ["189", "Comments"]], ["“This has been the most corrupt administration in modern American history,” Biden said while campaigning in North Carolina. “The Justice Department has turned into the president’s private law firm.”", "894", ["584", "Comments"]], ["He accused the anti-religion secularists of replacing traditional morality with “a new orthodoxy that is actively hostile to religion.”", "636", ["164", "Comments"]], ["Attorney General Daniel Cameron’s announcement came six months after Taylor was shot to death by Louisville police officers executing a “no-knock” warrant for her boyfriend.", "279", ["433", "Comments"]], ["“There are three nation states we have to be very concerned about: One is Russia, one is China and one is Iran.”", "150", ["31", "Comments"]], ["“Firstly, this is my country & I am a member of the House that impeached you,” the Minnesota Democrat wrote. “Secondly, I fled civil war when I was 8. An 8-year-old doesn’t run a country even though you run our country like one.”", "1.3K", ["1.1K", "Comments"]], ["\"Should it be abolished? It’s not for me to say. I’m saying this is what Democrats are saying: Stack, the courts, get rid of the Electoral College. But there is no nuance and no context anymore so who really cares.”", "342", ["193", "Comments"]], ["“I would hope the president continues to focus on the big picture and the difference of a nation of law and order and a nation of chaos. You know which side moms are going to vote on.”", "257", ["198", "Comments"]], ["“Her voice in our court and in our conference room was soft, but when she spoke, people listened.”", "478", ["203", "Comments"]], ["The company says it plans to enroll up to 60,000 adults at nearly 215 clinical research sites in the US and abroad.", "73", ["30", "Comments"]], ["“I was betrayed by the Bidens,” Stevenson said. “Joe was my friend. Jill was my wife.”", "1.6K", ["1K", "Comments"]], ["“What the Chairmen discovered during the course of this investigation is that the Obama administration knew that Hunter Biden’s position on Burisma’s board was problematic and did interfere in the efficient execution of policy with respect to Ukraine.”", "1K", ["604", "Comments"]], ["Riots and protests have occurred in 140 cities across the nation and are expected to top up to $2 billion in damage. What about violence related to Election Day?", "512", ["513", "Comments"]], ["Ranked choice voting will be used for the first time in a presidential race in the U.S. under a ruling Tuesday by the Maine Supreme Court.", "242", ["201", "Comments"]], ["The “First Take” co-host took issue with Covington’s criticism of Black Lives Matter as a Marxist, anti-cop organization harmful for the U.S.", "244", ["58", "Comments"]], ["Media outlets have taken aim at U.S. District Court Judge Amy Coney Barrett, a possible Supreme Court nominee, whipping up alarm about her views and linking her to “The Handmaid’s Tale.”", "505", ["267", "Comments"]], ["Senate Minority Leader Charles E. Schumer held an outdoor press conference Tuesday on replacing Ruth Bader Ginsburg. And ran into some non-fans.", "1.2K", ["319", "Comments"]], ["CNN’s Don Lemon declared that “we’re going to have to blow up the entire system” if Democrats win in November.", "1.1K", ["499", "Comments"]], ["Pence was flying home to Washington from a campaign event at an airport hangar in nearby Gilford, New Hampshire.", "408", ["104", "Comments"]], ["Days after Florida Gov. Ron DeSantis won a court victory to keep felons from voting until they’ve paid off fines, restitution and court fees, billionaire Mike Bloomberg has stepped in.", "2K", ["1.2K", "Comments"]], ["Cindy McCain, the widow of the late Sen. John McCain, endorsed Joe Biden for president on Tuesday, calling him a good and honest man who will lead the country with dignity.", "4.7K", ["2.3K", "Comments"]], ["Rarely have relations between a president and a speaker been this toxic. Indeed it’s even making it difficult for House lawmakers to hear directly from Cabinet officials — something that used to be routine.", "269", ["235", "Comments"]], ["President Trump signed an executive order Tuesday barring federal funds from any contractors who conduct critical-race theory diversity training, saying it promotes a “destructive ideology.”", "1.3K", ["242", "Comments"]], ["Former Attorney General Eric Holder sharply criticized current Attorney General William Barr, saying removing him from power is a key reason why people should vote against President Trump.", "2.2K", ["1.3K", "Comments"]], ["Democratic Rep. Ilhan Omar says it’s “not my job” to explain rising crime in Minneapolis amid her calls to disband the police department in her district in the wake of George Floyd’s death.", "695", ["364", "Comments"]], ["ABC’s town hall that billed its participants as “uncommitted” included voters who called President Trump a “f—ing moron,” “punk a—,” “swine,” and a “villain” prior to the event.", "845", ["497", "Comments"]], ["“It’s not the same as it is on the page,” Woodward said. “The microphone really is a microscope.”", "412", ["278", "Comments"]], ["“In the earliest days of the virus, China locked down travel domestically while allowing flights to leave China and infect the world. The United Nations must hold China accountable for their actions.”", "1.5K", ["698", "Comments"]], ["AOC warned progressives “there’s no going back to brunch” regardless of the outcome of the November election because they have a “whole new world to build.\"", "529", ["322", "Comments"]], ["The first debate is expected to feature 15-minute segments devoted to each of the six topics.", "170", ["241", "Comments"]], ["He volunteered to provide information from the NYPD computer systems and helped Chinese consulate officials with access to senior NYPD officials through invitations to events.", "381", ["66", "Comments"]], ["How are leaders across the civil, private, and public sectors tackling the “new normal\"? Join PMI and CollaborateUp as they discuss during Thursday's virtual roundtable at 12PM EDT. Register now.", "2", ["1", "Comment"]], ["“Friends, be prepared for social media to be filled with an onslaught of arrogant pronouncements based on breathtaking ignorance of religion...\"", "812", ["153", "Comments"]], ["The announcement comes after the majority of the UN security council rejected US efforts to extend an arms embargo on Tehran and relaunch so-called “snapback sanctions.”", "490", ["45", "Comments"]], ["Buckle up. Stay calm. The nation faces what likely will prove a particularly bitter and aggressive partisan battle over the next Supreme Court nominee following the passing of Justice Ruth Bader Ginsburg.", "478", ["246", "Comments"]], ["“We had the first homicide from the far left in many, many years this year.”", "339", ["112", "Comments"]], ["Judge Amy Coney Barrett was strongly considered by the president previously for the high court in 2019, but Judge Barbara Lagoa has risen more recently as a contender. The president included her in a list of 20 new potential nominees that he released earlier this month.", "895", ["345", "Comments"]], ["\"Justice Ginsburg demonstrated that one can disagree without being disagreeable toward one’s colleagues or different points of view,” the president said.", "515", ["193", "Comments"]], ["Prosecutors said residents have the constitutional right “to record public officials engaged in the public discharge of their duties,” and the agent violated that, as well prohibitions on unreasonable force.", "95", ["74", "Comments"]], ["Moderna CEO Stephane Bancel said based on enrollment and the rates of infection, the company’s “best possible outcome” would be a sense of efficacy by October — though November is its best guess right now.", "64", ["9", "Comments"]], ["The CDC now says people who’ve been in close contact with a coronavirus-infected person should get a test, reversing controversial guidance that said they might not need one.", "227", ["182", "Comments"]], ["The Trump administration is also blocking companies from transferring funds or processing payments through WeChat in the US.", "383", ["222", "Comments"]], ["Twisted Sister singer Dee Snider had harsh words for anti-maskers who went into a Florida Target store blaring the group’s hit “We’re Not Gonna Take It” while ripping off their masks.", "296", ["168", "Comments"]], ["A U.S. judge on Thursday blocked Postal Service changes that have slowed mail nationwide, calling them “a politically motivated attack on the efficiency of the Postal Service” before the election.", "229", ["204", "Comments"]], ["Former FBI director James Comey will appear before the Senate Judiciary Committee before the end of the month.", "859", ["216", "Comments"]], ["The Minneapolis City Council that passed a unanimous resolution for a “transformative new model” of law enforcement is confused and livid over rising crime and slow response times by cops.", "974", ["250", "Comments"]], ["President Donald Trump … and “Spike?”", "396", ["187", "Comments"]], ["“ICE abandoned its law enforcement partners long ago.”", "62", ["16", "Comments"]], ["Israel signs historic diplomatic accords with the United Arab Emirates and Bahrain at the White House, the Los Angeles County Sheriff’s Department says that U.S. Immigration and Customs Enforcement “abandoned” local sheriffs and police departments, and more on today's Front Page Podcast.  Listen below, or visit http://www.washingtontimes.com/frontpage to read these stories and subscribe for free.", "18", ["10", "Comments"]], ["Iran Rising Up for Freedom Special Section available now. Read it here. #FreeIran2020 #NoImpunity4Mullahs", "42", ["10", "Comments"]], ["“I happen to believe statehood to be the most effective means of ensuring that residents of Puerto Rico are treated [equally], with equal representation at a federal level.”", "317", ["257", "Comments"]], ["Baylor University in Waco, Texas, apologized Monday after placing a “sensitive content” warning on a display set up by a conservative student group commemorating the victims of the Sept. 11, 2001, terrorist attacks.", "73", ["14", "Comments"]], ["Good thing for some Chicago Bears players that Mike Ditka isn’t the coach.", "320K", ["18K", "Comments"]], ["CNBC host Jim Cramer says he made a “very stupid comment” by referring to House Speaker Nancy Pelosi as “Crazy Nancy” during a televised interview Tuesday morning.", "945", ["457", "Comments"]], ["Biden backers fear their candidate could lose much of the campus-based youth support Democrats have come to count on in years past.", "259", ["103", "Comments"]], ["The whistleblower nurse said the rate of the procedure at the Georgia facility was a red flag and that some of the women didn’t understand why they were getting it.", "327", ["317", "Comments"]], ["“The secretary of health and human services, Alex Azar, has not only failed to push back against these outrageous moves by President Trump, he has been almost entirely silent about the chaos and mismanagement in his own agency.”", "700", ["408", "Comments"]], ["“They can have riots and they can all sorts of things and that’s OK. You can burn up the house, that’s OK,” President Trump said at the rally. “If you call it a protest, you’re allowed to have it. So, if anybody asks you outside, this is called a ‘friendly protest.’”", "917", ["360", "Comments"]], ["A majority of voters in Pennsylvania and other battleground states trust the billionaire businessman more than Democratic challenger Joseph R. Biden to restore the economy.", "1K", ["436", "Comments"]], ["“You can vote for someone without supporting them.\"", "625", ["210", "Comments"]], ["\"I want to be in the political fight.\"", "378", ["149", "Comments"]], ["The former New York Jets player was charged with fraudulently obtaining the loan and spending the money on luxury items, including Gucci, Dior and dropping $63,000 at a Florida casino.", "119", ["86", "Comments"]], ["The president said he didn’t want to “jump up and down” and scream “death” before it was clear how bad the virus would get in the US.", "1.7K", ["1.2K", "Comments"]], ["“No rider has the right to endanger fellow riders by putting themselves above the law & refusing to wear a mask.”", "286", ["126", "Comments"]], ["“Now remember, Lindsey Graham is supposed to be a Republican, so why would he do something like that?”", "333", ["268", "Comments"]], ["WATCH: Guy Taylor on #InsideTheStory", "7", ["4", "Comments"]], ["Barr told reporters that federal case law is “crystal clear” that officials — including the president, vice presidents and members of Congress — can be represented by the federal government when tort claims arise from their duties.", "760", ["359", "Comments"]], ["“Violence in any form is unacceptable, but harming another person — let alone a child — because of the expression of their views betrays the principles on which our country was founded,” said Delaware AG Kathleen Jennings.", "753", ["137", "Comments"]], ["The state late last month notified the lab of “three significant certification deficiencies that put patients at immediate risk of harm.”", "364", ["19", "Comments"]], ["The drugmakers are hoping to reassure the public as the vaccine race becomes a political football in the homestretch of the presidential campaign.", "63", ["43", "Comments"]], ["“We will be investigating this issue, but I believe the Board of Governors must take emergency action to immediately suspend Mr. DeJoy, who they never should have selected in the first place.”", "195", ["119", "Comments"]], ["Officials specifically cited the looming rollout of the Army Green Service Uniform, more commonly known as the “Pinks and Greens,” and expected to be wildly popular among service members.", "59", ["9", "Comments"]], ["Facebook cited its rule on dangerous individuals and organizations, which it created last year and recently expanded to cover groups that pose “significant risks to public safety.”", "544", ["292", "Comments"]], ["Details of the incident are murky, but the Navy said that the Nimitz reported a “man overboard” just before 7 p.m. local time after conducting a thorough search of the ship.", "126", ["9", "Comments"]], ["“These are very serious allegations that must be investigated immediately, independent of the Trump Justice Department,” Schumer wrote.", "569", ["347", "Comments"]], ["Candidates engaging with the QAnon conspiracy theory are running for seats in state legislatures, breathing more oxygen into a once-obscure conspiracy movement that has grown in prominence.", "322", ["369", "Comments"]], ["George Washington University is investigating the case of a history professor who allegedly admitted to fraudulently pretending to be a Black woman for her entire career.", "127", ["55", "Comments"]], ["The two men are members of the Boogaloo Bois and a sub-group that operates as the Boojahideen. The groups have a violent anti-government philosophy.", "241", ["227", "Comments"]], ["The government is using the hotels as a stopgap measure to keep migrants for about five days before they are expelled back to their home country under the public health emergency.", "146", ["91", "Comments"]], ["Over half of Republicans surveyed about QAnon said they believe there is some truth in the main claim at the heart of the baseless yet budding far-right conspiracy theory movement.", "432", ["383", "Comments"]], ["“But it really might even be delivered before the end of October. How would you like that? Wouldn’t that be nice?”", "358", ["388", "Comments"]], ["Greene wrote in a since-deleted Facebook post, “We need strong conservative Christians to go on the offense against these socialists who want to rip our country apart.”", "162", ["56", "Comments"]], ["Biden said the revelations fit a pattern that shows the president, who received five draft deferments during the Vietnam War, has no sense of service to anyone but himself.", "3K", ["2.6K", "Comments"]], ["\"I would not convict him of a single one of these charges.\"", "2.5K", ["836", "Comments"]], ["It was the first time the unemployment rate fell below 10% since the coronavirus pandemic forced widespread shutdowns in March.", "691", ["368", "Comments"]], ["“I see President @realDonaldTrump consistently express his heartfelt gratitude and absolute admiration for our brave men and women in uniform.\"", "1.6K", ["1K", "Comments"]], ["\"She is overwhelmed by the flood of support and is grateful for those who are willing to speak out and stand up along her side.\"", "4.1K", ["587", "Comments"]], ["“This is not the time to be injecting politics into a really serious situation that the president helped solve.”", "417", ["364", "Comments"]], ["A Black man who had run naked through the streets of a New York city died of asphyxiation after police officers put a hood over his head, then pressed his face into the pavement for two minutes, video shows.", "151", ["230", "Comments"]], ["President Trump ordered his Justice Department to create a name-and-shame list of “anarchist jurisdictions” deemed to be allowing lawlessness to spread on their streets.", "1.4K", ["495", "Comments"]], ["WATCH: Culture reporter Chris Vondracek joins FreedomWorks' Inside The Story to discuss President Trump's call for schools to teach American exceptionalism and a campaign to pause politics this Labor Day.", "5", ["7", "Comments"]], ["House Speaker Nancy Pelosi get her hair styled at a shuttered San Francisco salon this week that was supposed to be closed under the city’s coronavirus rules — and she didn’t wear a mask.", "989", ["416", "Comments"]], ["Places like California, which faces wildfires, and Louisiana, which was smacked by Hurricane Laura, will benefit from the first shipments of the tests.", "35", ["15", "Comments"]], ["“Look he doesn’t want to do anything that would create a tussle, if you will, on the ground.”", "531", ["144", "Comments"]], ["Robert F. Kennedy’s grandson is facing an uphill battle with both candidates running on staunchly liberal records in one of the bluest of blue states.", "49", ["7", "Comments"]], ["“He’s a weak person. He’s controlled like a puppet.”", "2.5K", ["1.3K", "Comments"]], ["Six Democratic mayors from Minnesota’s Iron Range endorsed President Trump’s reelection in an open letter that praised the president as a champion for working-class people and slammed Democratic nominee Joseph R. Biden as “out of touch.”", "1.9K", ["269", "Comments"]], ["Nearly 70% has been returned, a Treasury official told the GAO. But that still about a half-billion dollars outstanding.", "116", ["18", "Comments"]], ["\"That’s the kind of feckless leadership you would get from Joe Biden as president,” Cotton said. “Not enforcing the law - not using force where necessary to deter this kind of violence but simply words on paper.”", "165", ["146", "Comments"]], ["“Russians are again interfering to help the president in his reelection.”", "5.3K", ["3K", "Comments"]], ["PBS White House correspondent Yamiche Alcindor felt the wrath of the Twitter ratio after she chose to politicize the inspiring moment Madison Cawthorn lifted himself from his wheelchair to stand on the RNC stage.", "309", ["120", "Comments"]], ["“Don’t be fooled - the Washington establishment is trying to sell you on their candidate,” Grenell said. “Every time Joe Biden offers a new idea, you should ask yourself: ‘Why didn’t he try that over the last 48 years?’”", "426", ["59", "Comments"]], ["White House Press Secretary Kayleigh McEnany vouched for President Trump as a supportive boss who backed her as a working mom and lifted her spirits after a preventive mastectomy.", "1.2K", ["329", "Comments"]], ["CNN analyst Joe Lockhart was quickly reminded of his network’s settled lawsuit after referring to RNC speaker and former Covington Catholic student Nicholas Sandmann as a “snot-nose entitled kid.”", "690", ["261", "Comments"]], ["“TODAY, I will be sending federal law enforcement and the National Guard to Kenosha, WI to restore LAW and ORDER!”", "3.4K", ["1.1K", "Comments"]], ["To secure his cooperation, Behdad Esfahbod says the Iranians threatened to frame him for downing a Ukrainian commercial airliner, told him a family member would lose a job, and confiscated devices and data from his digital accounts.", "59", ["16", "Comments"]], ["For the roughly two-thirds of US colleges offering in-person classes, it’s been a rocky start.", "34", ["28", "Comments"]], ["“My father ran, not because he needed the job, but because he knew hardworking people across this great country were being left behind.\"", "1.2K", ["517", "Comments"]], ["“They believe your skin color must dictate your politics. If you fail to conform while exercising your God given right to speak and think freely, they will cut you down,” Daniel Cameron said.", "2K", ["212", "Comments"]], ["The agency will still conduct citizenship swearing-in ceremonies, but those seeking to adjust their immigration status or to apply for naturalization will see longer wait times.", "34", ["3", "Comments"]], ["“This is the Biden economic agenda. Destroy every small business in America. Kill tens of millions more jobs. This is madness.”", "514", ["361", "Comments"]], ["\"There’s this really false idea that if you care about makeup or if your interests are in beauty and fashion, that that’s somehow frivolous. But I actually think these are some of the most substantive decisions that we make — and we make them every morning.”", "103", ["116", "Comments"]], ["The besieged official said he wanted to confront “inaccuracies” and denied that he directed the collection of mail collection boxes, decommissioning of the mail-sorting machines, or cuts to overtime.", "162", ["171", "Comments"]], ["“Don’t pay any attention to what the President is saying, because it is all designed to suppress the vote.”", "1.9K", ["1.1K", "Comments"]], ["The judge ruled in the church’s favor after Los Angeles County sought more than $20,000 in penalties over the decision to hold in-person services Sunday at its 3,500-seat sanctuary in defiance of county COVID-19 restrictions.", "523", ["71", "Comments"]], ["\"We really are moving these machines out to make room to process packages. We still have hundreds of these machines everywhere and still not any kind of drain on the capacity.”", "214", ["116", "Comments"]], ["Joseph R. Biden on Thursday formally accepted the Democrats’ presidential nomination, vowing to take the country in a different direction from what he has described as a scorched-earth approach from President Trump.", "1.1K", ["677", "Comments"]], ["“While we — like all Americans — had hoped that Donald Trump would govern wisely, he has disappointed millions of voters who put their faith in him and has demonstrated that he is dangerously unfit to serve another term.”", "2.7K", ["1.9K", "Comments"]], ["“We believe in freedom, individual freedom. We optimize for individual rights.”", "391", ["235", "Comments"]], ["“Sorry, Cher. The USPS doesn’t allow volunteers — but they are hiring.”", "275", ["136", "Comments"]], ["President Trump plans to wait to see if he wins before deciding whether to challenge the results of November’s race, White House press secretary Kayleigh McEnany said Wednesday.", "525", ["434", "Comments"]], ["“Trump feeds off a live audience,” Limbaugh said. “So whatever Trump’s involvement is, you know that there’s going to be some audience element somewhere, and I think they probably are watching what’s going on here and figuring out.\"", "550", ["143", "Comments"]], ["Scholars of women’s studies rip move saying the pardon is meaningless because women’s suffrage champion Susan B. Anthony never wanted one.", "180", ["97", "Comments"]], ["“I think he would be greatly honored. He loved our country. He loved our country so much. He was so proud of what we were doing and what we are doing for our country. So I think it would be appropriate.”", "392", ["149", "Comments"]], ["The ruling means transgender athletes wanting to participate in sports that match their gender identity can do so this fall.", "1K", ["339", "Comments"]], ["Washington, D.C. Mayor Muriel Bowser on Monday lambasted President Trump for the “photo op” near historic St. John’s Church on June 1 after law enforcement had cleared the area of protesters.", "303", ["173", "Comments"]], ["The St. Louis couple who brandished guns to protect their home from rioters will reportedly participate in next week’s Republican National Convention and support President Trump.", "4.5K", ["873", "Comments"]], ["Just 24% said they’d heard from Democrats, and 14% reported hearing from the GOP. Another 6% said they had heard from a civic group.", "22", ["12", "Comments"]], ["The Cook Political Report said Monday that Sen. Lindsey Graham’s reelection bid in South Carolina is facing a more serious threat than previously anticipated.", "107", ["67", "Comments"]], ["The U.S. House is coming back from recess to consider recent U.S. Postal Service changes, U.S. and Israeli officials are suggesting other Gulf Arab powers may soon follow the lead of the United Arab Emirates and begin diplomatic ties with Israel, and more. Listen below, or visit http://www.washingtontimes.com/frontpage to read these stories and subscribe for free.", "14", ["6", "Comments"]], ["Chicago Alderman Anthony Napolitano accuses Cook County State’s Attorney Kim Foxx of running a “catch-and-release system.” He pointed to an analysis that found she had dropped more than 25,000 felony cases.", "243", ["37", "Comments"]], ["President Trump attacked the integrity of November’s election and speculated Americans will “maybe never know” the results of his race to remain in the White House.", "306", ["467", "Comments"]], ["“It makes no sense to permit the world’s largest state sponsor of terrorism to purchase and sell weapons systems,” Pompeo said. “I mean, that’s just nuts.”", "322", ["39", "Comments"]], ["Erdogan explained that he has instructed his foreign minister that he may decide to “take a step in the direction of suspending diplomatic ties with the Abu Dhabi leadership or pulling back our ambassador.”", "195", ["56", "Comments"]], ["“He has some great ideas for what he’d like to see happen in the country and that’s why he has the candidacy that he’s been doing.”", "100", ["43", "Comments"]], ["As an apparent statement, the customer had worn his face mask, which is supposed to cover the nose and mouth, as an eye mask instead, like a superhero.", "167", ["117", "Comments"]], ["President Trump and like-minded allies are centering their push for college football on the fate of student-athletes, but the impact of major-conference cancellations is far more widespread.", "118", ["41", "Comments"]], ["The woman’s 10-year-old daughter was online with her teacher and classmates when the shots were fired.", "113", ["10", "Comments"]], ["Several GOP officials distanced themselves from Greene’s campaign, and she came under criticism from those in the party for videos that surfaced in June of her expressing racist, anti-Semitic and Islamaphobic statements.", "222", ["164", "Comments"]], ["“We will obey God rather than men.”", "29", ["16", "Comments"]], ["A judge declined Tuesday to order the immediate closure of a Southern California church that held indoor worship services despite a temporary restraining order barring it from doing so.", "570", ["181", "Comments"]], ["Through the lawyers, Ghislaine Maxwell said she should be housed in the general population at the Metropolitan Detention Center.", "62", ["61", "Comments"]], ["“As soon as we get him in the White House, and even before with these task forces that we had, we were able to significantly push Joe Biden to do things that he hadn’t signed on to before.\"", "226", ["67", "Comments"]], ["Harris, a 55-year-old first-term senator, is also one of the party’s most prominent figures and quickly became a top contender for the No. 2 spot after her own White House campaign ended.", "3.1K", ["1.7K", "Comments"]], ["“The point is not to be first with a vaccine — the point is to have a vaccine that is safe and effective for the American people and the people of the world.”", "111", ["22", "Comments"]], ["A shooting near the White House interrupts a President Trump news conference and sends two to the hospital, a Centers for Disease Control and Prevention report found no spike in coronavirus cases, hospitalizations, or deaths following the Wisconsin primary election in April, and more on today's Front Page Podcast. Listen below, or visit http://www.washingtontimes.com/frontpage to read these stories and subscribe for free.", "11", ["5", "Comments"]], ["Those targeted include Sens. Ted Cruz, Marco Rubio, Tom Cotton, Josh Hawley and Pat Toomey, as well as Rep. Chris Smith, along with five human rights leaders who have advocated for democratic causes.", "135", ["31", "Comments"]], ["“The kindest thing I can say is he doesn’t know what he’s talking about or, something is wrong there. Something is very, very wrong there.”", "627", ["497", "Comments"]], ["“Having the Brigade of Midshipmen back in one central location is critical to our mission accomplishment.”", "287", ["3", "Comments"]], ["“The proposal the U.S. will put forward is reasonable and needed. We will do the right thing.”", "97", ["16", "Comments"]], ["“It is perhaps the most American of issues, and it should be one that unites us.”", "293", ["246", "Comments"]], ["In the Flynn case, Judge Sullivan pressed to proceed with the prosecution after the Justice Department asked to drop it over alleged prosecutorial misconduct.", "139", ["73", "Comments"]], ["Marijuana regulators in Michigan recalled pre-rolled joints sold throughout the state Thursday over concerns they could have been licked by the person who put them together.", "58", ["15", "Comments"]], ["“If the candidates were to agree that they wished to add to that schedule, the Commission would consider that request but remains committed to the schedule of debates it has planned.”", "333", ["808", "Comments"]], ["Parents fed up with online learning have launched Facebook pages and petitions calling for the resumption of in-classroom learning, pushing back against concerns that in-person learning will fuel another outbreak of COVID-19.", "257", ["155", "Comments"]], ["Wheeler, who is also the city’s police commissioner, said he’s authorized officers to “do whatever is necessary” to gain control after another night of rioting against officers.", "1.3K", ["477", "Comments"]], ["\"The political Crime of the Century, and she had no idea what they were doing?”", "341", ["135", "Comments"]], ["“It has always been the case that ‘buy American, hire American’ are the two most simple rules of the Trump administration.”", "937", ["275", "Comments"]], ["“Like I found out, you can do what you think is the best and try the hardest to avoid it and [sometimes] it still affects you.”", "57", ["19", "Comments"]], ["“Every current voting system that’s been examined is terrible in some way and probably exploitable.”", "59", ["28", "Comments"]], ["“The problem is the job itself,” she wrote on her website. “It forces skilled journalists to make bad decisions on a daily basis.”", "195", ["19", "Comments"]], ["“A dignified transfer of our Marines and sailor will occur as soon as possible after the conclusion of recovery operations.”", "1.3K", ["105", "Comments"]], ["“It is mostly a right-wing media tempest, fueled by hour after hour of Fox commentary (not reporting), far removed from campaign reality.”", "210", ["103", "Comments"]], ["The footage came from the body cameras worn during the May 25th arrest by Minneapolis Officers Thomas Lane and Alex Keung. All four officers at the scene were fired and have been charged in Floyd’s death.", "510", ["781", "Comments"]], ["Trump said his order ensures that Medicare covers telehealth visits at no additional cost and allows co-pays to be waived.", "467", ["155", "Comments"]], ["“It’s a great asset, but it’s not a great asset in the United States unless they have the approval of the United States.”", "181", ["94", "Comments"]], ["“I have a lot of powers with respect to executive orders. And we’re looking at that very seriously right now.”", "321", ["110", "Comments"]], ["State Department officials said the U.S. “unequivocally supports U.K. sovereignty” over the islands and suggested that a change in ownership of Diego Garcia could have a negative impact on American security.", "55", ["6", "Comments"]], ["“Clearly, President Trump wants people who will swear allegiance to him over the Constitution,” the ranking member said. “This is a flagrant end run around the confirmation process.”", "137", ["114", "Comments"]], ["\"I found an area of agreement in their beliefs — where all people, of whatever race, color or creed are created with equal rights, which is what my remarks were about.”", "163", ["44", "Comments"]], ["Rescue crews from the Navy, Marine Corps and Coast Guard searched more than 1,000 nautical square miles over the last 40 hours for any sign of the missing service members before officials suspended the effort.", "98", ["5", "Comments"]], ["“While I cannot blame anyone directly for this, this week has shown that there are some Members of Congress who fail to take this crisis seriously.”", "345", ["162", "Comments"]], ["\"I cannot even say ‘miscarriage of justice’ because clearly ‘justice’ was not even considered. This was theater of the absurd.”", "83", ["15", "Comments"]], ["Officials say the effort will hopefully add millions of tests per week by September, allowing nursing homes, schools and other settings to protect their residents, students and workers.", "53", ["14", "Comments"]], ["Lawmakers the day prior quietly adopted an amendment to the defense bill offered by Rep. Jackie Speier, California Democrat, to prohibit military funds from being spent on implementing the controversial policy.", "164", ["56", "Comments"]], ["“People could be heard in the crowd repeating that the protest was to remain peaceful.”", "278", ["159", "Comments"]], ["A woman identified only as “Jane Doe #3” detailed a litany of disturbing allegations, accusing Ms. Maxwell of recruiting her in 1999, when she was 15 years old, according to the newly released court filings.", "173", ["50", "Comments"]], ["Robert Bordner, owner of Slidewaters Waterpark on Lake Chelan, refuses to go quietly, waging a legal battle against what he described as a “hypocritical” state reopening plan that threatens to sink his family-owned business.", "100", ["17", "Comments"]], ["The U.S. economy suffered its worst period ever in the second quarter during the coronavirus shutdowns, although the contraction wasn’t quite as bad as feared.", "427", ["400", "Comments"]], ["“When it’s time to actually make a law, Democrats would rather keep political issues alive than find a bipartisan way to resolve them,” McConnell said.", "470", ["152", "Comments"]], ["Michael Avenatti, the flamboyant lawyer who used to dominate cable news shows with his threats to take down President Trump, is now so poor that he was awarded a court-appointed lawyer Wednesday.", "266", ["52", "Comments"]], ["A Twitter representative was not on hand for Wednesday’s hearing, as Twitter CEO Jack Dorsey was not invited by the antitrust subcommittee despite Republicans’ request that Dorsey be called to attend.", "51", ["12", "Comments"]], ["“When it’s time to actually make a law, Democrats would rather keep political issues alive than find a bipartisan way to resolve them.”", "445", ["182", "Comments"]], ["Twitter intervened shortly afterward and removed the tweet.", "251", ["361", "Comments"]], ["The governor emphasized the educational and social upside of a return to in-person learning, citing research that COVID-19 poses less of a threat to kids.", "2.5K", ["436", "Comments"]], ["“At times, his site is indistinguishable from the Daily Beast or any other woke propaganda outlet posing as a news company.”", "124", ["31", "Comments"]], ["Microsoft co-founder Bill Gates said Tuesday that the “benefits outweigh the costs” when it comes to getting young children back in the classroom.", "106", ["61", "Comments"]], ["NFL defensive end Stephon Tuitt says trying to change his mind on kneeling for the flag will be like trying to penetrate a steel curtain.", "540", ["129", "Comments"]], ["In a team survey, the “vast majority” of Washington Nationals players voted against traveling to Miami this weekend for a scheduled three-game series against the Miami Marlins.", "15", ["5", "Comments"]], ["Judge John Kastrenakes rejected the challengers’ claim that the ordinance violates their rights to privacy and personal autonomy.", "210", ["216", "Comments"]], ["“The video circulating on social media appears to be from June 2020 when high winds caused several border wall panels that were pending additional anchoring to fall over at a construction site near Deming, New Mexico.”", "61", ["5", "Comments"]], ["William R. Evanina, director of U.S. counterintelligence, warned that China, Iran, and Russia have engaged in active measures to influence political opinion ahead of the November election.", "198", ["136", "Comments"]], ["The White House says three federal agents deployed to Portland, Oregon, may have been “permanently” blinded by laser attacks.", "379", ["191", "Comments"]], ["Kansas City Mayor Quinton Lucas said Sunday his city has 60 unsolved murders but he thinks President Trump is looking to leverage his city’s “pain” to help him win reelection.", "429", ["242", "Comments"]], ["Seattle police retreated to a precinct early Sunday, just hours after declaring a riot during large demonstrations in the city’s Capitol Hill neighborhood.", "1.5K", ["924", "Comments"]], ["A nonpartisan Christian organization said it asked for and received the resignation of Rep. Ted Yoho from its board of directors following what it called his “verbal attack” on Rep. Alexandria Ocasio-Cortez.", "506", ["405", "Comments"]], ["Prosecutors said all four were caught on video using straps to try to pull down the statue, which stands on federal land in Lafayette Park, across the street from the White House. The statue was targeted earlier this week as an outgrowth of the Black Lives Matter protests that have roiled cities across the country over the last month.", "4.2K", ["821", "Comments"]], ["Inside the Beltway: “Historians often deem this event to be the opening volley of the Cold War — which was to smolder on until Ronald Reagan brought it to an end in 1991.” #BestOfWashTimes", "62", ["25", "Comments"]], ["Michael McKenna: “Despite what you hear from some, the polling in the 2020 elections is very likely not broken, biased or wrong.” #BestOfWashTimes", "263", ["262", "Comments"]], ["Cheryl K. Chumley: “One person complains — and down the foundations fall.” #BestOfWashTimes", "19", ["13", "Comments"]], ["In the midst of the coronavirus pandemic, the Trump administration on Thursday urged the Supreme Court to overturn the Affordable Care Act.", "1.9K", ["766", "Comments"]], ["Two brothers who admitted helping actor Jussie Smollett stage a racist and homophobic attack in Chicago last year are now willing to help in the case, their attorney said Thursday.", "584", ["80", "Comments"]], ["The FBI said the rope, while fashioned in the shape of a noose, was there as a garage pull. Wallace has responded by saying he’d never seen a garage pull tied in that way before.", "109", ["124", "Comments"]], ["Al Sharpton said Wednesday that the FBI’s findings regarding a NASCAR “noose” that has hung in a garage since October 2019 will not bring closure to the story.", "406", ["228", "Comments"]], ["Tulsa Athletic announced it will no longer play “The Star-Spangled Banner” before games because it is insufficiently inclusive “of every race, ethnicity, religion and sexual orientation.”", "231", ["103", "Comments"]], ["President Trump on Wednesday said top Obama-era FBI and Justice Department officials should apologize to former National Security Adviser Michael Flynn.", "1.5K", ["301", "Comments"]], ["In an appearance on CNN, NASCAR’s only black driver told host Don Lemon that the offending rope was definitely a noose, intended as a lynching threat.", "391", ["294", "Comments"]], ["A 24-year-old real estate investment CEO has won the Republican primary runoff for Mark Meadows’ North Carolina congressional seat over President Trump’s endorsed candidate.", "243", ["60", "Comments"]], ["“None of us have ever been told to slow down on testing. That just is a fact.\"", "585", ["239", "Comments"]]]