[["These polling numbers are consistent with the theory that voters don't appreciate when presidents stick their privates into light sockets. We might feel bad for you but we don't want you running anything.", "117", ["6", "Comments"]], ["He didn't even claim it was better than Lincoln's!", "90", ["1", "Comment"]], ["Liveblogging the Trump Coronapocalypse!", "24", ["3", "Comments"]], ["I'll alert the media.", "102", ["23", "Comments"]], ["The ID Now was never intended to help Republicans pretend COVID-19 exists. If you try to ignore the coronavirus, it'll go all Fatal Attraction on you.", "85", ["5", "Comments"]], ["Getting tased does not make someone feel better than they have in 20 years. It hurts a lot, which explains the convulsions.", "196", ["6", "Comments"]], ["We liked the parts where Biden actually followed a train of thought and didn't veer off into conspiracy theories, which was  all of it.", "184", ["4", "Comments"]], ["If Trump had contracted COVID-19 at Amy Coney Barrett's coronavirus pool party on September 26, he might've tested positive as early as Tuesday, September 29, when he “debated\" Joe Biden. Trump was around RNC Chair Ronna “The Rona\" McDaniel on September 24 and 25. McDaniel tested positive shortly afterward, so a new theory is that Trump himself was the Outbreak monkey at the Barrett bash. It would make sense because everyone present would’ve with interacted the president at least briefly. It's still unclear how Melania Trump contracted the virus.", "197", ["19", "Comments"]], ["What’s with these people?", "47", ["1", "Comment"]], ["What the hell did we just watch?", "169", ["34", "Comments"]], ["It's your morning news roundup!", "20", ["1", "Comment"]], ["Karma's a bitch, and so is Wayne LaPierre.", "405", ["22", "Comments"]], ["Just like dear old Dad.", "164", ["28", "Comments"]], ["He also compared himself to black people during Jim Crow, because sure, why not?", "156", ["43", "Comments"]], ["Why won't Joe Biden infect himself with coronavirus like that specimen of perfect manhood Donald J. Trump?", "118", ["18", "Comments"]], ["Trump is like the gangsters in movies who are so paranoid they demand only local anesthesia when having surgery, so they can \"see what's happening.\" Of course, in reality, Trump would probably faint at the first sight of a scalpel.", "82", ["1", "Comment"]], ["Pastor John Hagee has COVID-19.", "359", ["71", "Comments"]], ["Biden stood at least 12 feet from President Pandemic during the debate, so he was never within what the Centers for Disease Control considers “close contact.\" Yes, there is a possibility of infection, but nothing on the level of Mike Pence, who practically sat in Utah Senator Mike Lee's lap during Barrett's Death Covid Jam. Pence was indoors, in close contact, with people who have since tested positive, including Trump. Pence is also next in line to a hospitalized and heavily medicated president. But, hey, both sides!", "83", ["14", "Comments"]], ["Why would anyone with a functioning brain and a short-term memory trust the Trump family to operate under the “honor system”? We wouldn't trust any of them alone with a “leave or penny, take a penny\" dish.", "188", ["3", "Comments"]], ["What a sacrifice!", "121", ["7", "Comments"]], ["You would think that after your boss caught a deadly virus due to not listening to his own guidelines, there would be less mocking of Biden taking the proper precautions to avoid it.", "60", ["9", "Comments"]], ["Farah insisted Trump was the toughest guy she knew, not at all an old man who's at risk of severe complications from the disease he never took seriously. It was confirmed that Trump received supplemental oxygen after his blood oxygen levels twice dropped below 94 percent. Actual doctors who don't specialize in pep rally medicine point out that this is serious, no-joke COVID. Meanwhile, Mike Pence, next in line to the presidency, isn't quarantining and is still planning to fly places. Oh well, at least Nancy Pelosi is safe.", "85", ["7", "Comments"]], ["Never one to be outdone in the race to inherit his father's debts, Eric Trump boasted Sunday about the president's much vaunted work ethic. The man watches more Fox News than a racist retiree and tweets more frequently than a spoiled tween whose parents don't impose any screen time restrictions.", "233", ["17", "Comments"]], ["If Hickenlooper and Bullock win, we'll even stop razzing them for their ill-considered presidential runs. Maybe.", "94", ["5", "Comments"]], ["The saga continues.", "265", ["27", "Comments"]], ["Even while stricken, Trump remains true to form, which is grotesque. He prioritized his reelection, as always, over the health and safety of others. He attended an indoor fundraiser in New Jersey when the White House knew he'd been exposed to the virus. Saturday, White House physician, Dr. Sean Conley, suggested Trump might've tested positive on Wednesday, so instead of immediately entering quarantine, he tried to hide it, endangering the lives of everyone he encountered.", "271", ["37", "Comments"]], ["Well this is just very surprising.", "197", ["20", "Comments"]], ["You know who might not be fine? All of the people he came in contact with in the last week.", "161", ["32", "Comments"]], ["Trump’s not the only one paying the price for dancing on Ginsburg’s grave. It seems like Barrett’s coming out party was possibly a COVID-19 superspreader event, a collaboration between O. Henry and Edgar Allan Poe with “Ballroom Blitz\" as the soundtrack.", "465", ["71", "Comments"]], ["We wanna say this is a new low for Tucker, but we can't be sure.", "294", ["93", "Comments"]], ["This will be the topic of many future dissertations, assuming we still have history departments, or universities, in 30 years.", "116", ["43", "Comments"]], ["The House voted 371-18 today to condemn the QAnon conspiracy that claims Donald Trump is engaged in a secret battle against Satanic Deep State baby-eating child sex traffickers.", "116", ["16", "Comments"]], ["Private history of a scandal that failed.", "162", ["18", "Comments"]], ["What do you mean sinking? We're way up in the air!", "67", ["2", "Comments"]], ["It's gonna be tough to hold press conferences from the prison cafeteria.", "237", ["10", "Comments"]], ["The Lone Star, No-Vote State", "106", ["7", "Comments"]], ["This is tough news for those (like his own son) who believe COVID-10 is a hoax.", "94", ["20", "Comments"]], ["Now, Bob wants to collect from that same fund he has always tried to destroy.", "86", ["7", "Comments"]], ["What kind of people?", "217", ["27", "Comments"]], ["Last night we were all reminded once again what a selfish pile of collagen and botulinum toxin our FLOTUS is. (Yeah, we wrote this before the news about her COVID diagnosis. Still true!)", "241", ["41", "Comments"]], ["Think nice thoughts about a sociopath, please.", "128", ["12", "Comments"]], ["It's amazing it didn't happen sooner, frankly.", "150", ["44", "Comments"]], ["It's your morning news roundup!", "16", ["1", "Comment"]], ["Relax, stay inside, and listen to some music. Do you have any Allman Brothers?", "280", ["7", "Comments"]], ["Yeah about that", "70", ["1", "Comment"]], ["He really thinks he won.", "93", ["5", "Comments"]], ["Not all heroes wear capes. But we can get her a cape if she wants.", "158", ["7", "Comments"]], ["Still batshit after all these years.", "66", ["8", "Comments"]], ["They seem nice.", "192", ["64", "Comments"]], ["These men are far from the only people who have committed horrific, violent crimes in the name of Donald Trump.", "135", ["7", "Comments"]], ["There's a lot going on here", "251", ["42", "Comments"]], ["Let us all give thanks unto the Dear Leader, source of all blessings.", "121", ["21", "Comments"]], ["Breaking news!", "537", ["26", "Comments"]], ["This is so gross.", "69", ["2", "Comments"]], ["Why is everyone deferring to this \"Norm\" guy?", "69", ["5", "Comments"]], ["Women tend to have had bad experiences with men who talk like Trump does.", "355", ["37", "Comments"]], ["It's your morning news roundup!", "23", ["1", "Comment"]], ["Just trying to help", "154", ["20", "Comments"]], ["Trump had the facts wrong, if you can imagine such a thing!", "150", ["7", "Comments"]], ["They suck at everything!", "52", ["2", "Comments"]], ["She's not wrong", "120", ["8", "Comments"]], ["Trump is exclusively the commander-in-chief for white supremacists, bigots, and all Klan-adjacent Americans.", "174", ["14", "Comments"]], ["\"Let the people decide\" shouldn't sound quite so novel.", "63", ["5", "Comments"]], ["Last night was some weird shit.", "310", ["32", "Comments"]], ["Virtually everything he said was a lie. We held up a teaspoon to the firehose and looked at a few of the worst.", "66", ["30", "Comments"]], ["Trump said racial sensitivity training is “racist\" but he can't condemn the Proud Boys as racist. Elizabeth Neumann warned that Trump's \"actions and rhetoric are in fact racist\" and make it harder for Homeland Security to do its job keeping all Americans safe, not just those who vote for Donald Trump.", "248", ["28", "Comments"]], ["This happened yesterday too.", "119", ["8", "Comments"]], ["Joe Biden is leading Donald Trump 50 to 47 percent among likely voters. White voters in the state support Trump 67 to 31 percent because they presumably appreciate the great work the president has done killing Black people with COVID-19.", "104", ["8", "Comments"]], ["Oh god here we go.", "170", ["3", "Comments"]], ["When \"Work to Rule\" means a speed-up.", "181", ["2", "Comments"]], ["The real crime isn't that Trump avoided taxes. It's that we know he did.", "341", ["39", "Comments"]], ["They’re not gonna steal this election from us!", "54", ["2", "Comments"]], ["BEHOLD MY WORKS YE MIGHTY, AND ... Oh, shit, already?", "240", ["12", "Comments"]], ["thank heavens", "125", ["10", "Comments"]], ["Like Russia was going to send a W-2 showing $750 in federal taxes withheld.", "95", ["9", "Comments"]], ["It would be irresponsible to speculate he spoke loudly enough to be overheard on purpose, so we certainly won't do that.", "65", ["1", "Comment"]], ["Trump uses evangelical leaders, and they use him, and both have a good laugh over the rubes who think he's a very godly guy.", "74", ["10", "Comments"]], ["Now Trump's most loyal lackeys, including Georgia Senator and Disney villain henchman Kelly Loeffler, are insisting that voters have a right to know whether Biden is “mentally fit to serve as president.\" Seems fair. Maybe Biden can agree to meet with Trump for a \"formal discussion on a particular topic in a public meeting or legislative assembly, in which opposing arguments are put forward.\" That might better demonstrate Biden's mental fitness than the status of his urine.", "208", ["35", "Comments"]], ["The charges against the protesters are absolutely nuts: felony theft charges for allegedly taking some racist counter-protesters' racist signs; felony kidnapping charges because some cops were inside the police building and couldn't leave during a protest.", "97", ["14", "Comments"]], ["Hemingway doesn't just insult our intelligence. She also casts aspersions on our tax dodging skills. If we all filed our taxes like a common Trump, how would the government have any money? In 2017, a reported 141 million Americans paid taxes. If our bill topped out at $750 each, the government would've only took in about $107 billion, which is significantly less than the $1.6 trillion paid that year in individual income taxes. Maybe Hemingway secretly is down with defunding the police!", "108", ["4", "Comments"]], ["Candice Parscale claimed her husband had become violent in recent weeks. We're not going to dignify linking that timeline to any public events in Brad Parscale's professional life because it doesn't matter. Nothing justifies acting out on your loved ones. Nothing justifies domestic violence.", "411", ["74", "Comments"]], ["There is something very wrong with this man.", "295", ["18", "Comments"]], ["If Joe Biden carries every state Hillary Clinton won in 2016, flips Arizona and returns Wisconsin and Michigan to the blue column, he'd have exactly 269 electoral votes, an Electoral College tie with President Tax Cheat. The race would go to the House of Representatives, which the Democrats control. Hooray! Unfortunately, Republicans will deny that “hooray!\" because they are expected to win more state delegations and that's who'll decide the winner. Man, it seems like you'd have a fairer shot of unseating Satan as President of Hell, where there's a straightforward popular vote system because the Devil actually believes in democracy.", "153", ["37", "Comments"]], ["No one pays us for talking to OURselves. Unfair!", "552", ["57", "Comments"]], ["Even Trump's much-reviled “illegal immigrants\" pay federal taxes. This is their way of demonstrating the “good moral character\" we like to see in our citizens, unless they're fake billionaires who launder money through their daughters.", "119", ["5", "Comments"]], ["Dennis Quaid is very upset that we have cancel cultured him.", "157", ["16", "Comments"]], ["President Slander McLibelson has no evidence for his baseless juicing charges. It's most likely that Biden was just rusty early on and has gotten better with more consistent practice, as opposed to Trump whose mind has rotted like that Halloween pumpkin you forgot about and left on your porch until after New Year's.", "178", ["60", "Comments"]], ["The TikTok teens ruined his Tusla rally, and now they must pay.", "87", ["7", "Comments"]], ["Go away, Matt.", "101", ["8", "Comments"]], ["The phone number for the national suicide prevention lifeline is 1-800-273-8255.", "56", ["26", "Comments"]], ["He’s gonna kill us all and not just the stupid people.", "83", ["7", "Comments"]], ["Can you blame us for preferring TV to 2020?", "99", ["11", "Comments"]], ["The smile on Wendy Rittenhouse's face is very different from the anguish you see from the mothers of Breonna Taylor, Jacob Blake, Ahmaud Arbery, Tamir Rice, and Trayvon Martin. She looks confident that the system is going to work out in her son's favor ... either that or she's very pleased with her chicken piccata appetizer.", "260", ["90", "Comments"]], ["Truly disturbed and extraordinarily unoriginal.", "263", ["61", "Comments"]], ["Almost as terrifying as Trump nominating another Supreme Court Justice.  Almost.", "133", ["37", "Comments"]], ["Satan's master plan involved Sarah Palin in a pink bear costume, as foretold in the Bible.", "69", ["12", "Comments"]], ["As you might imagine, Trump's version of America's history is ... just a little bit entirely bastardized.", "95", ["3", "Comments"]], ["Good.", "310", ["133", "Comments"]], ["THREE nice-time voting stories in a single day? Can you even handle that in 2020?", "66", ["1", "Comment"]], ["Well, it's something!", "363", ["17", "Comments"]], ["How dare he say true things!", "112", ["10", "Comments"]], ["We're avoiding the \"Is this the year Georgia goes blue?\" cliche by ... Oh, hell, we're not avoiding it at all, are we?", "112", ["3", "Comments"]], ["This is their defense now.", "321", ["48", "Comments"]], ["Why is John Lewis at the top of this post? Because he's STILL pissed at what Trump is doing to healthcare.", "101", ["19", "Comments"]], ["But how did those dastardly Dems sneak into a Republican-run county board of elections to steal the election? Or seven ballots. Which will be counted anyway, because it was a simple fuckup, not fraud of any kind.", "54", ["2", "Comments"]], ["It looks like an artsy perfume ad from 1995.", "11", ["2", "Comments"]], ["Oh, hooray — Trump will definitely accept the results of the election if he wins. How generous of him!", "170", ["23", "Comments"]], ["Another edition of Voter Suppression Theater.", "169", ["17", "Comments"]], ["They keep saying that anything is justified when people are resisting arrest.", "175", ["49", "Comments"]], ["It's your morning news roundup!", "26", ["1", "Comment"]], ["DO IT", "352", ["32", "Comments"]], ["Oh, just the Department of Justice trying to suppress a book by Melanie's former BFF. That's perfectly normal.", "141", ["6", "Comments"]], ["Where they go dumb, they go all.", "71", ["17", "Comments"]], ["They have yet to explain why they find the buttons unacceptable.", "41", ["5", "Comments"]], ["But Barr et al really belieeeeeeeeeve their bullshit conspiracy crap! It has to be real!", "148", ["6", "Comments"]], ["Flawless reasoning here.", "52", ["6", "Comments"]], ["It was \"self defense,\" justifying the 32 shots fired, except for the ten bullets that went through the apartment wall and then became dangerous to the neighbors.", "83", ["8", "Comments"]], ["Everything about this is so creepy.", "51", ["4", "Comments"]], ["Boy, PLEASE.", "239", ["13", "Comments"]], ["Excellent timing, since Donald Trump will make sure votes for Biden don't count, thus preserving democracy.", "274", ["103", "Comments"]], ["It's not hyperbole. It's happening.", "281", ["33", "Comments"]], ["It's your morning news roundup!", "28", ["7", "Comments"]], ["They are POLL DANCERS, get it?", "74", ["1", "Comment"]], ["You do.", "561", ["37", "Comments"]], ["\"That's intolerable.\" No disagreement there.", "41", ["1", "Comment"]], ["Couldn't find anything illegal, so he's accusing Biden of criminal \"awkwardness.\" We swear we are not making that up.", "220", ["18", "Comments"]], ["FYI", "127", ["28", "Comments"]], ["It's a cynical campaign ploy to appeal to conspiracy theorists, but it's also real money going to real organizations that work with victims, so ... good?", "92", ["64", "Comments"]], ["Reporters deserve to be beaten, so it's not inciting violence.", "107", ["4", "Comments"]], ["The gun is good!", "59", ["7", "Comments"]], ["'Advise and consent'? More like MOTHER MAY I!", "53", ["9", "Comments"]], ["Were you expecting better?", "64", ["5", "Comments"]], ["It's kind of his thing.", "72", ["4", "Comments"]], ["Some troubling numbers about letters.", "81", ["7", "Comments"]], ["He failed to meet the moment.", "221", ["34", "Comments"]], ["Could Lindsay Graham and Joni Ernst be in trouble? Let's hope so!", "80", ["4", "Comments"]], ["Body armor is a *kind* of personal protective equipment, isn't it?", "156", ["5", "Comments"]], ["And here we are again.", "154", ["13", "Comments"]], ["Government of the clusterfuck, by the clusterfuck, and for the clusterfuck shall not perish from this earth.", "47", ["6", "Comments"]], ["Just asking.", "171", ["49", "Comments"]], ["Next she'll be publicly supporting the Vandals.", "82", ["11", "Comments"]], ["Yes, it's that bad.", "48", ["1", "Comment"]], ["He no longer has the first job.", "185", ["9", "Comments"]], ["Sunday shows!", "64", ["3", "Comments"]], ["Now flip it! Flip it good!", "321", ["4", "Comments"]], ["Rich people making money off of poor people eating each other alive.", "37", ["7", "Comments"]], ["He just became presidential.", "78", ["8", "Comments"]], ["Paper towels for everyone!", "62", ["9", "Comments"]], ["Full stop", "738", ["72", "Comments"]], ["He wants to cut off federal funding to these cities, and still have those who live in them pay federal taxes. Is there another word for that?", "170", ["26", "Comments"]], ["Nothing is a foregone conclusion at this point.", "261", ["13", "Comments"]], ["It's yr morning news roundup!", "12", ["1", "Comment"]], ["Be friends with people who are nice instead!", "594", ["23", "Comments"]], ["And so we shall.", "116", ["2", "Comments"]], ["Welp. We need two more.", "295", ["75", "Comments"]], ["Incredible that they're not laying low after humiliating themselves earlier this week.", "120", ["31", "Comments"]], ["We got a bunch of requests for RGB merch, so here ya go! (Not afraid to be servicey, even when we are super bummed)", "108", ["10", "Comments"]], ["RIP.", "178", ["1", "Comment"]], ["The only thing anyone can rely on is that Republicans will always act in bad faith.", "237", ["17", "Comments"]], ["He's so popular!", "43", ["5", "Comments"]], ["Why is the FBI even involved in \"intelligence gathering\" when they could just take Donald Trump's word on everything? That just seems rude!", "83", ["4", "Comments"]], ["https://www.wonkette.com/ruth-bader-ginsburg-1933-goddammit", "560", ["72", "Comments"]], ["Wonkette History Day continues!", "79", ["13", "Comments"]], ["This is not going to be an exception to that rule.", "219", ["84", "Comments"]], ["The Defense Department's top cop in the Washington region also asked if the DC National Guard had a microwave-like weapon called the \"Active Denial System,\" which isn't something a dominatrix uses. The pleasant device is designed to \"make people feel as if their skin is burning when in range of its invisible rays.\"", "88", ["18", "Comments"]], ["He’s terrible, evil, and gross.", "120", ["23", "Comments"]], ["What if teaching kids fake history for the purpose of promoting patriotism is actually a bad idea? https://www.wonkette.com/trump-gonna-make-all-the-kids-as-s…", "152", ["16", "Comments"]], ["Disgraced pervert Bill O'Reilly suggested that the debate was rigged because Biden was somehow aware of current events from the past six months. That could've only happened if he'd been fed questions in advance and memorized them all, as people with dementia can so easily do.", "393", ["26", "Comments"]], ["The Right has latched onto the term \"grooming,\" and it's not going well.", "59", ["13", "Comments"]], ["Yes, it's a reasonable position [to remove Confederate memorials], unless you're afraid that if we stop glorifying white supremacists, we'd have no other white men to admire. Relax: We'll always have Chris Evans and the impressive contents of his camera roll.", "62", ["6", "Comments"]], ["Wait till you see what these \"rainbows\" look like.", "170", ["27", "Comments"]], ["Tenant farming hits the Sunday Styles section!", "33", ["1", "Comment"]], ["Your morning news roundup!", "15", ["2", "Comments"]], ["This is so GD stupid", "45", ["3", "Comments"]], ["Oh no, he is sad!", "62", ["3", "Comments"]], ["Yes, it's that bad.", "72", ["10", "Comments"]], ["Rep. Pramila Jayapal successfully pressured the DHS to investigate the alleged forced hysterectomies at an ICE detention center in Georgia.", "285", ["25", "Comments"]], ["When you're embarrassing to even Marco Rubio ...", "71", ["7", "Comments"]], ["He's one slimy motherfucker.", "207", ["35", "Comments"]], ["Also literally evil.", "189", ["20", "Comments"]], ["This is pretty much where the whole GOP is headed.", "192", ["30", "Comments"]], ["Hahahaha OK", "399", ["40", "Comments"]], ["Horserace coverage!", "60", ["4", "Comments"]], ["Get lost, deadbeat.", "68", ["12", "Comments"]], ["Republican Voters Against Trump's ads are effective because they offer moving testimonials from Republicans about how Trump is an existential threat to the values that conservatives claim are important to them, such as patriotism, national security, and continued lung function.", "50", ["1", "Comment"]], ["Paul Alexander, whom we met last week here, is OUT. This is very very good news! https://www.wonkette.com/meet-the-part-time-assistant-profe…", "66", ["2", "Comments"]], ["How very shock!", "140", ["9", "Comments"]], ["Anti-maskers don't want to look like monsters or anything so they claim, with all the evidence they can pull from their asses, that the rising COVID-19 death toll is a big hoax designed to line the pockets of Big Mask. Maybe 3,000 more people than usual died in South Carolina over a period of six months, but did anyone actually see the coronavirus in the study with the candlestick?", "42", ["8", "Comments"]], ["Charlie Kirk's face looks like if God was trying to do Photoshop by himself before finally giving up and asking his Son for help", "204", ["31", "Comments"]], ["So that was weird", "462", ["47", "Comments"]], ["Even by the police's melodramatic teenager standards where if you don't let them do whatever they want, you must hate them, there's not much evidence that Biden hates cops. As conservative Max Boot noted, Biden doesn't support defunding the police or abolishing ICE. But Trump doesn't need proof when he's got instinct or at least manipulated video.", "88", ["4", "Comments"]], ["Maybe the most honest thing the Trump campaign has ever done", "100", ["5", "Comments"]], ["“I can't begin to imagine your pain\" is an expression Black people have heard often from our white friends and allies this summer. It's well-meaning and certainly accurate. However, it indicates the great chasm between our lived experiences in America. If you're on the more secure side of the chasm, it might tempt you to think $12 million in exchange for the life of a 26-year-old woman is a pretty good deal. It's not.", "68", ["10", "Comments"]], ["How embarrassing for us all", "220", ["43", "Comments"]], ["Daniel Walters who reported on this for The Pacific Northwest Inlander gave Graham some benefit of the doubt. Maybe she didn't realize when she posted a Facebook link to a tired-old anti-vaccine article that the site was a home for crackpot QAnon conspiracies, including the not-at-all anti-Semitic claim that globalist (wink) pedophiles like to chug children's blood before sacrificing them to Satan, who I guess only takes the empties.", "56", ["7", "Comments"]], ["The past week has been catastrophic, and the problem is climate change. Anyone with a brain knows the problem is climate change, but a majority of white voters in 2016 decided to go with the brainless presidential candidate, so here we are. Yesterday, President Lab Coat declared to people smarter than he is, including the chair holding up his ass, that this problem that has only gotten worse over the years will suddenly disappear ... as if by magic.", "109", ["10", "Comments"]], ["Pure evil.", "67", ["5", "Comments"]], ["Things are not OK in America.", "204", ["36", "Comments"]], ["Yes it's that bad", "223", ["47", "Comments"]], ["None of these dummies seem to grasp that Republicans would want Hawkins on the ballot as a spoiler so they could repeat Donald Trump's performance in 2016. President Klan Robe's margin of victory in Wisconsin was about 23,000 votes. Democracy falls by less than a percentage point. However, more than 30,000 people voted for Green Party candidate Jill Stein because what's the worst that could happen?", "261", ["104", "Comments"]], ["Saying the quiet part loud again", "154", ["20", "Comments"]], ["Perdue's big TV spots don't even mention Trump, and that makes sense: People are usually trying to eat when those air during \"Wheel of Fortune.\" He does show President Pandemic some love in mailers and digital ads directly targeting \"core GOP voters\" or what will soon be known as Marjorie Taylor Greene Republicans.", "37", ["1", "Comment"]], ["This is not a drill.", "113", ["28", "Comments"]], ["This all seems normal", "109", ["16", "Comments"]], ["This is such absolute nonsense.", "217", ["32", "Comments"]], ["We watch the Sunday shows so you won’t have to!", "104", ["5", "Comments"]], ["Let’s assume, just for the moment, that Bill Barr is a dishonest man.", "171", ["3", "Comments"]], ["So, what exactly are these people protesting, aside from Black people's continued existence? Trump's the president. He controls the executive branch of government and has a lease to own the judicial. This is hardly the March on Washington. It's a live performance event, and that's an industry COVID-19 has crushed.", "70", ["11", "Comments"]], ["That seems like a super boring demonic ritual, but ok.", "477", ["142", "Comments"]], ["We understand if you don't have the stomach to watch another one of these clips. Suffice it to say, that must've been a seriously broken tail light.", "180", ["52", "Comments"]], ["Well done, Mr. Stable Genius.", "57", ["5", "Comments"]], ["Donald Trump's campaign released an attack ad last week called “Meet Joe Biden's Supporters,\" and of course, the intent was to shamelessly link rioters, looters, and “anarchists\" to the former vice president. It's a low blow because while the rightwing thugs who shoot protesters with paintballs, pepper spray, and literal bullets are overtly Trump supporters, no one in the “antifa mobs\" has been spotted wearing “No Malarkey\" hats.", "139", ["9", "Comments"]], ["Looks like someone just gave a whole bunch of people in prison grounds for an appeal!", "247", ["34", "Comments"]], ["Judge Jeanine, without any self-awareness, claimed Trump ran in 2016 as the “law and order\" candidate. Here in reality, Trump's campaign was more or less a criminal enterprise, one that produced more felons than the Legion of Doom. Even if Donny \"Tiny Hands\" wasn't a glorified mob boss, he actually sucked at maintaining “law and order.\"", "178", ["9", "Comments"]], ["This is not cancel culture, of course.", "188", ["41", "Comments"]], ["If you have something terrible in your background, maybe ... DON'T RUN", "165", ["31", "Comments"]], ["Gideon asked Collins several times if she planned to vote for President Pandemic. The only good response is “hell to the no\" and the only honest response is “Damn right, I'm ordering the code orange.\" Collins instead replied like she was a common Salt-N-Pepa: “If I want to put a fascist back in the White House ... none of your business!\"", "325", ["5", "Comments"]], ["Bye!", "389", ["31", "Comments"]], ["Only 31 years late.", "125", ["11", "Comments"]], ["This pretty much means she's going to congress.", "180", ["56", "Comments"]], ["Happy weekend!", "35", ["1", "Comment"]], ["Dr. Michael Brown simply cannot believe that people would be so rude as to mock him for simply claiming that Black Lives Matter activists were doing witchcraft! https://www.wonkette.com/jesus-guy-cant-believe-hes-getting…", "92", ["13", "Comments"]], ["Help him. Help the bomb-throwing dipshit.", "150", ["17", "Comments"]], ["Looks like the last three adults at the White House are trying desperately to save Trump from diving down the rabbithole with Rudy again.", "139", ["12", "Comments"]], ["Get ready for Donald Trump to threaten to withhold federal funding from school districts that don't immediately open restaurants with tables close together. Or at least cocktail lounges.", "54", ["1", "Comment"]], ["You will be shocked to discover that this is, in fact, a Q thing.", "335", ["68", "Comments"]], ["Holy Adderall, Batman!", "261", ["29", "Comments"]], ["What if they let her wear the shirt, but everyone else gets to wear another shirt using their \"free speech rights\" to call her an asshole?", "132", ["60", "Comments"]], ["Journalists are a dime a dozen, Bob. You know that, don't you? But princes, they don't come along every day and buy arms systems from just anyone.", "221", ["13", "Comments"]], ["We really should think about doing something.", "86", ["22", "Comments"]], ["Y'all.", "668", ["44", "Comments"]], ["The President of the United States wants to use US tax dollars as his personal rape defense slush fund.", "301", ["19", "Comments"]], ["Some much-needed nice time!", "86", ["12", "Comments"]], ["Take a break from Bob Woodward, because this is fucking important.", "315", ["23", "Comments"]], ["You don't need to practice to yell \"GYNA!\" anyway.", "60", ["9", "Comments"]], ["That is certainly a very complicated way of looking at things.", "102", ["18", "Comments"]], ["Baby, Baby, Where Did our Rights Go?", "88", ["11", "Comments"]], ["Donald Trump desperately wants to keep having his campaign Klan-bakes. But the 5,000 maskless idiots expected for an airport rally would have violated the governor's order to not infect a crowd in Reno just to watch them die.", "131", ["5", "Comments"]], ["How could this idiot be an actual MD? (The HHS guy, not Dr. Spaceman. Him, we trust.)", "41", ["2", "Comments"]], ["More Bob Woodward!", "216", ["9", "Comments"]], ["Jesus, BOB.", "455", ["95", "Comments"]], ["Ben Sasse is not a smart man.", "78", ["9", "Comments"]], ["Good to know they have some damn priorities there.", "65", ["7", "Comments"]], ["Isaiah Elliott, a Black seventh grader in Colorado, played with a toy gun and is lucky to be alive. That's the extent of his good fortune. His mother, Dani, was at work when the vice principal at Grand Mountain School in Colorado Springs called to inform her that a police officer was on the way to her house. Cops don't deliver pizzas to Black kids. They bring choke holds and bullets.", "165", ["34", "Comments"]], ["The Tillis staffer’s not even comparing health care to clothing essentials, like a warm coat on a winter's day. He's talking about fashion, luxuries ... a new dress shirt. Also, who's even bought a dress shirt in the past six months? Most people in the dress shirt-required industries are working from home.", "89", ["3", "Comments"]], ["The medical cost for Sturgis infections may total $12.2 billion. At that rate you could have paid each of the estimated 462,182 rally attendees $26,553.64 not to attend. And to think, millions of Americans didn't go for free!", "205", ["54", "Comments"]], ["Of course", "298", ["28", "Comments"]], ["It's Cover Up Embarrassing Shit Week. Again, and always.", "138", ["8", "Comments"]], ["According to the California Department of Forestry and Protection, the El Dorado Fire in San Bernardino County started because some fool set off a “smoke-generating pyrotechnic device.\" This is worse than Mrs. O'Leary's cow, because milk serves a constructive purpose. Gender-reveal parties don't. Also, cows are idiots and incapable of shame or embarrassment.", "53", ["13", "Comments"]], ["No, the Huckster didn't “mislead\" anyone. She lied because she's a liar who lies. “Misleading\" is “Read my lips, no new taxes\" or “If you like your crappy insurance plan, you can keep it.\" She just imagined herself in a room with the president as he made phone calls that the president never makes. Those are fables from a fabulist.", "61", ["9", "Comments"]], ["Can't you all just be a little more understanding of the chief for leaving Daniel Prude's death unreported for months?", "60", ["1", "Comment"]], ["We are just asking!", "65", ["2", "Comments"]], ["It's your morning news roundup, practically perfect in every way.", "20", ["2", "Comments"]], ["Huh.", "59", ["8", "Comments"]], ["It's not going to pass, but at least it's useless!", "97", ["3", "Comments"]], ["Finally, a Strzok text that's worth reading.", "246", ["14", "Comments"]], ["Hundreds more Donald Trump supporters gathered for a clown car caravan in Oregon this weekend. They reportedly wanted to show their \"support for the president and the police.\" That's their constitutional right as Americans. Although, if they really wanted to support modern policing, they should let the cops beat the crap out of them without complaint. That's one job Black people are fine with losing to less-qualified white guys.", "267", ["53", "Comments"]], ["Sure would be funny if campaign insiders were lining their own pockets. But what are the chances of *that*? Why, that might even be illegal!", "297", ["39", "Comments"]], ["Lock him up.", "302", ["27", "Comments"]], ["Senator Kamala Harris arrived in Milwaukee Monday for her first solo campaign stop as the Democratic vice presidential nominee. And what an arrival it was! She hit the ground running in black Chuck Taylors. Give the sister a sonic screwdriver and she's ready to save the world.", "797", ["34", "Comments"]], ["Sunday shows!", "66", ["4", "Comments"]], ["Good morning.", "116", ["24", "Comments"]], ["Whiny Trump is a very boring Trump. He might've successfully stoked white cultural grievance in 2016 but he also presented himself as someone who could get away with anything. Now Trump seems to think Biden's the guy who can shoot someone on Fifth Avenue without the press covering it.", "162", ["8", "Comments"]], ["Hey hey, It's your morning news roundup!", "25", ["1", "Comment"]], ["Happy Labor Day!", "151", ["2", "Comments"]], ["The only film that was blacklisted during the red scare!", "82", ["2", "Comments"]], ["Cal Cunningham has two yellow labs. And there are other reasons to support him, too!", "175", ["8", "Comments"]], ["Summer is almost over, but COVID-19 is not. While those of us who didn't vote for Donald Trump's bigoted incompetence might deserve some last hoorah of fun in the sun (or even a first hoorah), we're not getting one. The summer of 2020 lies floating in a pool of murdered dreams like Jay Gatsby.", "79", ["5", "Comments"]], ["Poor baby!", "369", ["24", "Comments"]], ["They thought it would help them start their little race war.", "243", ["27", "Comments"]], ["Remember when the Trumpists cried for years about Kathy Griffin?", "112", ["10", "Comments"]], ["Might have been a better argument against vote by mail if any of it had been true. Not that facts matter anymore anyway.", "96", ["11", "Comments"]], ["How dare they!", "179", ["15", "Comments"]], ["Kindest, bravest, warmest, most wonderful troop supporter ever.", "86", ["15", "Comments"]], ["Prior to the fugitive task force shooting Reinoehl, Donald Trump sent out a tweet demanding his arrest.", "176", ["75", "Comments"]], ["Classy!", "235", ["40", "Comments"]], ["This is why we need to divert funds from law enforcement to mental health services.", "125", ["12", "Comments"]], ["If you have to make up a bunch of crap in order to get what you want, it means the thing you want is unjustified.", "205", ["19", "Comments"]]]